سپاس از خدا ایزد رهنمایکه از کاف و نون کرد گیتی بپای 
یکی کش نه آز و نه انباز بودنه انجام باشد نه آغاز بود
تن زنده را در جهان جای از وستخم چرخ گردنده بر پای از وست
از آن پس که آورد گیتی پدیدهمه هرچه بد خواست و دانست و دید
زگردون شتاب و زهامون درنگز دریا بخار و ز خورشید رنگ
پدید آورد نیک و بد ، خوب و زشتروان داد و تن کرد و روزی نوشت
چنان ساخت هرچیز به انداز خویش کز آن ساختن کم نیامد نه بیش
چه تاری چه روشن چه بالا چه پستنشانست بر هستی اش هر چه هست
نه جایی تهی گفتن از وی رواستنه دیدار کردن توان کو کجاست 
مدان از ستاره بی او هیچ چیزنه از چرخ و نز چارگوهر به نیز 
که هستند چرخ و زمان رام اونجوید ستاره مگر کام او 
 نگاری کجا گوهر آرد همینباشد جز آن کاو نگارد همی 
به کارش درون نیست چون و چرانپرسد از او ، او بپرسد ز ما 
نه از بهر جایست بر عرش راستجز آنست کز برش فرمانرواست
بزرگیش ناید به وهم اندروننه اندیشه بشناسد او را که چون
 نبد چیز از آغاز ، او بود و بسنماند همیدون جز او هیچ کس
چنان چون مرو را کسی یار نیستچو کردار او هیچ کردار نیست
همه بندگانیم در بند اویخنک آنکه دارد ره پند اوی
ثنا باد بر جان پیغمبرش محّمد فرستاده و بهترش
که بُد بر در دین یزدان کلیدجهان یکسر از بهر او شد پدید
بدو داد دادار پیغام خویشبپیوست با نام نام خویش
ز پیغمبران او پسین بُد درستولیک او شود زنده زیشان نخست
یکی تن وی و خلق چندین هزاربرون آمد و کرد دین آشکار
ببرد از همه گوی پیغمبریکه با او کسی را نبد برتری
خبر زآنچه بگدشت یا بود خواستزکس ناشنیده همه گفت راست
به یک چشم زد از دل سنگ خواستبه معجز برآورد نوبر درخت
دل دنیی از دیو بی بیم کردمه آسمان را به دو نیم کرد
ز هامون به چرخ برین شد سوار سخن گفت بر عرش با کردگار
گه رستخیز آب کوثر وراستلوا و شفاعت سراسر وراست
مر اندامش ایزد یکایک ستودهنرهاش را بر هنر برفروزد
ورا بُد به معراج رفتن ز جای به یک شب شدن گرد هر دو سرای
مه از هر فرشته بُدش پایگاه بر از قاب قوسین به یزدانش راه
سرافیل همرازش و هم نشستبراق اسب و جبریل فرمان پرست
همیدونش بر ساق عرشست نامنُبی معجز او را ز ایزد پیام
به چندین بزرگی جهاندار راستبدو داد پاک این جهان او نخواست
نمود آنچه بایست هر خوب و زشتره دوزخ و راه خرم بهشت
چنان کرد دین را به شمشیر تیزکه هزمان بود بیش تا رستخیز
ز یزدان و از ما هزاران درودمر او را و یارانش را برفزود
دل از دین نشاید که ویران بودکه ویران زمین جای دیوان بود
نگه دار دین آشکار و نهانکه دین است بنیان هر دو جهان
پناه روانست دین و نهادکلید بهشت و ترازوی داد
در رستگاری ورا از خدایره توبه و توشهٔ آن سرای
ز دیو ایمنی وز فرشته نویدز دورخ گذار و به فردوس امید 
رهانندهٔ روز شمار از گدازدهنده به پول چینود جواز 
چراغیست در پیش چشم خردکه دل ره به نورش به یزدان برد
روانراست نو حله ای از بهشتکه هرگز نه فرسوده گردد نه زشت
ره دین گرد هرکه دانا بودبه دهر آن گراید که کانا بود
جهان را نه بهر بیهده کرده اندترا نز پی بازی آورده اند
سخن های ایزد نباشد گزافره دهریان دور بفکن ملاف
بدان کز چه بُد کاین جهان آفریدهمان چون شب و روز کردش پدید
چرا باز تیره کند ماه وتیرزمین در نوردد چو نامه دبیر
دم صور بشناس و انگیختنروان ها به تن ها برآمیختن
همان کشتن مرگ روز شمارزمین را که سازد به دل کردگار
زمان چیست بنگر چرا سال گشت الف نقطه چون بود و چون دال گشت
تن و جان چرا سازگار آمدندچه افاتد تا هر دو یار آمدند
همه هست در دین و زینسان بسستولیک آگه از کارشان کو کسست
اگر کژ و گر راست پوینده اندهمه کس ره راست جوینده اند
ولیکن درست آوریدن بجایمر آن را نماید که خواهد خدای
ره دین بپای آر خود چون سزاستکه گیتی به دین آفرید ست راست
همه گیتی از دیو پر لشکرندستمکاره تر هر یک از دیگرند
اگر نیستی بندشان داد و دینربودی همی این از آن آن ازین
به یزدان بدین ره توان یافتنکه کفرست از و روی تافتن 
بد ونیک را هر دو پاداشنستخنک آنک جانش از خرد روشنست
ازین پس پیمبر نباشد دگربه آخر زمان مهدی آید به در
بگیرد خط و نامهٔ کردگارکند راز پیغمبران آشکار
ز کوچک جهان راز دین بزرگگشاید خورد آب با میش گرگ
بدارد جهان بر یکی دین پاکبرآرد ز دجال و خیلش هلاک
همان آب گویند کآید پدیددَرِ توبه را گم بباشد کلید
رسد ز آسمان هر پیمبر فرازشوند از گس مهدی اندر نماز
سوی خاور آید پدید آفتابهم آتش کند جوش طوفان چو آب 
از آن پس شگفت دگرگونه گونبس افتد جهاندار داند که چون
تو آنچ از پیمبر رسیدت به گوشبه فرمان بجای آر آنرا بکوش
بر اسپ گمان از ره بیش و کممشو کت به دوزخ برد با فدم
به دست آرد از آب حیوان نشانبخورزو و پس شادزی جاودان
سر هر دوره راست کن چپ و راست از آن ترس کآنجا نهیب و بلاست
وز آن بانگ کآید در آن رهگذارکه ره دین مراین را آن را بدار
نشین راست با هرکس و راست خیزمگر رسته گردی گه رستخیز
جهان ای شگفتی به مردم نکوستچو بینی همه درد مردم از وست
یکی پنج روزه بهشتست زشتچه نازی به این پنج روزه بهشت
ستاننده چابک رباییست زودکه نتوان ستد باز هرچ او ربود
سراییست بر وی گشاده دو دریکی آمدن را شدن ، زآن به در
نه آن کآید ایدر بماند درازنه آنرا که رفت آمدن هست باز
چو خوانیست بر ره که هرکس زپیش شود زود چون خورد از وبهر خویش
بتی هست گویا میانش اهرمنفریبنده دل ها به شیرین سخن
هرآنکش پرستد بود بت پرست چه با او چه با دیو دارد نشست
چه چابوک دستست بازی سگال که در پرده داند نمودن خیال
دو پرده بر این گنبد لاجوردببندد همی گه سیه گاه زرد
به بازی همین زین دو پرده برونخیال آرد از جانور گونه گون
بتی شد تنش از رشک و جانش ز آزدو دست از امید و دو پای از نیاز
دل از بی وفایی و طبع از نهیبرخان از شکست و زبان از فریب
دو گونه همی دم زند سال و ماهیکی دم سپید و یکی دم سیاه
بر این هر دو دم کاو برآرد همییکایک دم ما شمارد همی
اگر سالیان از هزاران فزون دراو خرمی ها کنی گونه گون
به باغی دو در ماند ار بنگری کز این در درآیی ، وزان بگذری 
بر او جز نکوهش سزاوار نیستکه آنک آفریدش سبکبار نیست
کنون چون شنیدی بدو دل مبندو گر دل ببندی شوی درگزند
چو دریاست این گنبد نیگونزمین چون جزیره میان اندرون
شب و روز بر وی چو دو موج باریکی موج از و زرد و دیگر چو قار
چو بر روی میدان پیروزه رنگدو جنگی سوار این ز روم آن ز زنگ
یکی از بر خنگ زرین جناغیکی بر نوندی سیه تر ز زاغ
یکی آخته تیغ زرین ز بریکی بر سر آورده سیمین سپر
جهان حمله گه کرده تا زنده تیزگه اندر درنگ و گه اندر گریز
نماید گهی رومی از بیم پشتگریزان و آن زرد خنجر به مشت
گهی آید آن زنگی تاخته ز سیمین سپر نیمی انداخته
دو گونست از اسپانشان گرد خشکیکی همچو کافور و دیگر چو مشک
ز گرد دو رنگ اسپ ایشان به راهسپیدست گه موی و گاهی سیاه
نه هرگز بودشان به هم ساختننه آسایش آرند از تاختن
کسی را که سازند با جان گزندبکوبندش از زیر پای نوند
تکاور تکانند هر دو چو بادسواران چه بر غم از ایشان چه شاد
گهر های گیتی به کار اندرندز گردون به گردان حصار اندراند
به تقدیر یزدان شده کارگرچو زنجیر پیوسته در یکدگر
پهارند لیکن همی زین چهارنگار آید از گونه گون صد هزار
به هر یک درون از هنر دستبردپدیدست چندانکه نتوان شمرد
ولیکن چو کردی خرد رهنمونستایش زمین راست زیشان فزون
ره روزی از آسمان اندراستولیکن زمین راه او را درست
شب از سایهٔ اوست کز هر کرانببینی از بر سپهر اختران
بزرگان و پیغمبران خدایهمه بر زمین داشتند جای
هرآن صحف کز ایزد آورده اندبر او بود هر دین که گسترده اند
هم از آب و آتش هم از باد نیزبه دل بر زمین راست تا رستخیز
زمینست چون مادر مهرجویهمه رستنی ها چو پستان اوی
بچه گونه گون خلق چندین هزارکه شان پروراند همی در کنار
زمین جای آرام هر آدمیستهمان خانه کردگار از زمینست
بساط خدایست هرکه به رازبر او شد، توان نزد یزدان فراز
همو قبلهٔ هر فرشته است راستبدان کز گلش بود چو آدم که خاست
گهرهای کانی وی آرد همیجهان هم بدو نیز دارد همی
زمینست هر جانور را پناهتن زنده و مرده را جایگاه
همو بردبارست کز هر کسیکشد بار اگر چند بارش بسی
زمین آمد از اختران بهره مندهم از هر سه ارکان ط چرخ بلند
همو عرصه گاهیست شیب و فرازمعلق جهانبانش گسترده باز
ز هر گونه نو جانور صد هزارکند عرض یزدان درین عرصه راز
چو جای نمازست گشتست پستهمه در نماز از برش هرچه هست
از و راست مردم دو تا چارپاینگون رستنی که نشسته به جای
همان اختران از فلک همچنینهمه سا جدانند سر بر زمین 
هوا و آتش و آب هریک جداستزمین هر چهارند یکجای راست
نیابی نشان وی از هر سه شانو زیشان در او بازیابی نشان 
زمین را به بخشنگی یار نیستچنان نیز دارنده زنهار نیست
گر از تخم هر چش دهی زینهاریکی را بدل باز یابی هزار
چو خوانیست کآرد بر او هر زمانبی اندازه مردم همی میهمان
نه هرگز خورشهاش بّرد ز همنه مهمانش را گردد انبوه کم
زمین قبلهٔ نامور مصطفی استاز او روی برگاشتن نارواست
گر آتش به آمد بر مغ چه باکاز آتش بد ابلیس و آدم زخاک
ببین زین دو تن به کدامین کسستهمان زین دو بهتر نشان این بسست
زمینست گنج خدای جهانهمان از زمینست فخر شهان
پرستنده او مه و آفتابهمیدون فلک زآتش و باد و آب
رهی وار گردش دوان کم وبیشچو شاهی وی آرمیده بر جای خویش
همیدون تموز و دی اش چاکرستبهارش مشاطه خزان زرگرست
ز زرّ و گهر این نثار آوردز دیبا همی آن نگار آورد
یکی زر بفتش دهد خسروییکی شارها بافدش هندوی
همش عاشقست ابر با درد و رشککش از دیده هزمان بشوید به اشک
گهی ساقی و کاردانش بودگهی چتر و گه سایبانش بود
زمین چونش مردم نباشد گمستزمین را پرستنده هم مردمست
خور و پوشش تنش را زوست چیزهم ایزد از او آفریدست نیز
همی از زمین باشد آمیختنوز او بود خواهد برانگیختن
ازین چار ارکان که داری بنامببین کاین هنرها جز او را کدام
کنون زین پس از مردم آرم سخنکه گیتی تمام اوست ز آغاز وبن
به گیتی درون جانور گو نه گون بسند از گمان وز شمردن فزون 
ولیک از همه مردم آمد پسندکه مردم گشادست و ایشان به بند 
خرد جانور به ز مردم ندیدکه مردم تواند به یزدان رسید 
زمین ایزد از مردم آراستستجهان کردن از بهر او خواستست
به مردم فرستاد پیغام خویشزگیتی ورا خواند هم نام خویش
بدو داد شاهی ز روی هنربدین بیکران گونه گون جانور
که گر کشتن ار کارش آید هوابدیشان کند هرچه باشد روا
ز مردم بدان راستی خواستستکه هر جانور کژ و او راستست
همه نیکوی ها به مردم نکوستز یزدان تمام آفرینش بدوست
سپهریست نو پرستاره بپای جهانیست کوچک رونده ز جای
چو گنجیست در خوبتر پیکریدرو ایزدی گوهر از هر دری 
مرین گنج را هرکه یابد کلیددر راز یزدانش آید پدید
ببیند ز اندک سرشت آب و خاکدو گیتی نگاریده یزدان پاک
یکی دیدنی روی و فرسودنینهان دیگر و جاودان بودنی
دلت را همی گر شگفت آید اینبه چشم خرد خویشتن را ببین
تنت آینه ساز و هر دو جهانببین اندر و آشکار و نهان
هر آلت که باید بدادست نیزبهانه بر ایزد نماندست چیز
یکی موی از این کم نباید همیوگر باشد افزون نشاید همی
گر از ما بدی خواهش آراستنکه دانستی از وی چنین خواستن
بر آن آفرین کن که این کار اوستنکوتر ز هرچیز کردار اوست
ببین وبدان کز کجا آمدیکجا رفت باید چو ز ایدر شدی
چرا این پیام و نشان از خدایچه بایست چندین ره رهنمای
همه با توست ار بجوییش بازنباید کسی تا گشایدت راز 
ازین بیش چیزی نیارمت گفتبس این گر دلت با خرد هست جفت
چنین دان که جان برترین گوهر استنه زین گیتی از گیتی دیگرست
درفشنده شمعیست این جان پاکفتاده درین ژرف جای مغاک
یکی نور بنیاد تابندگیپدید آر بیداری و زندگی
نه آرام جوی و نه جنبش پذیرنه از جای بیرون و نه جای گیر
سپهر و زمین بستهٔ بند اوستجهان ایستاده به پیوند اوست
نهان از نگارست لیک آشکارهمی برگرد گونه گونه نگار
کند در نهان هرچه رأی آیدش رسد بی زمان هرکجا شایدش
ببیندت و دیدن ورا روی نیستکشد کوه و همسنگ یک موی نیست
تن او را به کردار جامه است راستکه گر بفکند ور بپوشد رواست
به جان بین گرامی تن خویشتنچو جامه که باشد گرامی به تن 
تنت خانه ای دان به باغی درونچراغش روان زندگانی ستون
فروهشته زین خانه زنجیر چارچراغ اندر او بسته قندیل وار
هر آن گه که زنجیر شد سست بندزهر گوشه ناگه بخیزد گزند
شود خانه ویران و پژمرده باغبیفتد ستون و بمیرد چراغ
از آن پس چو پیکر به گوهر سپردهمان پیشش آید کز ایدر ببرد
چو دریاست گیتی تن او را کنار بر این ژرف دریاست جان را گذار
به رفتن رهش نیست زی جای خویشمگر کشتی و توشه سازد ز پیش 
تو کشتیش دین و دهش توشه دانره راست باد و خرد بادبان
و گرنه بدان سر نداند رسیددر این ژرف دریا شود ناپدید
گرت جان گرامیست پس داد کنز یزدان و پادافرهش یاد کن
ز تو هرچه نتوانی ایزد نخواستتو آن کن که فرمودت از راه راست
مپندار جان را که گردد نچیزکه هرگز نچیز او نگردد بنیز
تباهی به چیزی رسد ناگزیر که باشد به گوهر تباهی پذیر
سخنگوی جان جاودان بودنیستنه گیرد تباهی نه فرسودنیست
از این دو برون نیستش سرنبشتاگر دوزخ جاودان گر بهشت
یکی کار جستم همی ارجمندکه نامم شود زو به گیتی بلند
اگر نامهٔ رفتنم را نویددهند این دو پیک سیاه و سپید
به رفتن بود خوش دل شاد منبه نیکی کند هرکسی یاد من
مهی بُد سر داد و بنیاد دینگرانمایه دستور شاه زمین
محمّد مه جود و چرخ هنرسمعیل حصّی مر او را پدر
ردی دانش آرای یزدان پرستزمین حلم و دریا دل و راد دست
ز چرخ روان تا بره تیره خاکچه و چون گیتی بدانسته پاک
خوی نیک و خوبی و فرزانگی ره رادی و رأی مردانگی
نکوبختی و دانش و کلک وتیغخدا ایچ ناداشته زو دریغ
برادرش والا براهیم رادگزین جهان گرد مهتر نژاد
خنیده به کلک و ستوده به تیربدین گنج بخش و بدان شهر گیر
دو پرورده شاه بدخواه سوزیکی داد و ورز و یکی دین فروز
جهان را چو دو دیدهٔ روزگارزمان را چو دو دست فرمانگزار
ز هرکس فزون جاهشان نزد شاهگذشته درفش مهیشان ز ماه
به بگماز یک روز نزدیک خویشمرا هر دو مهتر نشاندند پیش
بسی یاد نام نکو رانده شدبسی دفتر باستان خوانده شد
ز هر گونه رأیی فکندند بنپس آن گه گشادند بند سخن 
که فردوسی طوسی پاک مغز بدادست داد سخن های نغز 
به شهنامه گیتی بیاراستستبدان نامه نام نکو خواستست
تو همشهری او را و هم پیشه ایهم اندر سخن چابک اندیشه ای 
بدان همره از نامهٔ باستان به شعر آر خرّم یکی داستان 
بسا نامداران که بردند رنجنهانی نهادند هر جای گنج
سرانجام رفتند و بگذاشتندنه زیشان کسی بهره برداشتند
تو زین داستان گنجی اندر جهانبمانی که هرگز نگردد کمی
همش هرکسی یابد از آدمیهم از برگرفتن نگیرد کمی
بُوی مانده فرزند ایدر بجایکه همواره نام تو ماند بپای
ز دانش یکی خرم نهی که از میوه هرگز نگردد تهی
جهان جاودانه نماند به کسبهین چیز از و نیک نامست و بس
کنون کان یاقوت دانش بکن ز دریای اندیشه دُر دَر فکن
خرد آتش تیز و دل بوته ساز سخن زرِّ کن پاک بر هم گداز
پس این زر و این گوهران بار کندر این گنج یکباره انبار کن
زکس یاد این گنج بر دل میارجز از شاه ارّانی شهریار
مجوی اندرین کار جز کام اویمنه مُهر بر وی به جز نام اوی
که تا جایگه یافتی نخجوانبدین شاه شد بخت پیرت جوان
کنون ز ابر دریای معنی گهرببارم ، گل دانش آرم به بر 
فزایم ز جان آفرین شاه راکه زیباست مر خسروی گاه را
شه ارمن و پشت ایرانیانمه تازیان ، تاج شیبانیان
ملک بودلف شهریار زمینجهاندار ارّانی پاک دین
بزرگی که با آسمان همبرستز تخم براهیم پیغمبرست
فروغست رایش دل و دیده را پناهست دادش ستمدیده را
نبشتست بخت از پی کام خویشبه دیوان فرهنگ او نام خویش 
به فرّش توان رفت بر مشتریبه نامش توان بست دیو و پری
 تن و همتش را سرانجام برست که آنجا که ساقش زحل را سرست
به صد لشکر اندر گه رزم و نامنپرسید باید ز کس کاو کدام
چنو دست زی تیغ و ترکش کشیدکه یارد به نزدیک تیغش چخید
اگر خشتی از دستش افتد به رومشوندش رهی هر کز آن مرز و بوم
برد سهم او دل ز غران هژبرکند گرد او خشک باران در ابر
به دریا بسوزد ز تف خیزران چنو زد نوند سبک خیز ران
اگر بابت روم کین آوردبه شمشیر بت را به دین آورد
جهان را اگر بنده خواند ز پیشز بهرش کند حلقه در گوش خویش
ز گردون چنان کرد جاهش گذارکز او نیست برتر به جز کردگار
فرستست خشتش به گاه پیامنبردش نویدست و کشتن خرام
عقابیست تیرش که در مغز و ترگبچه فتح باشد ورا خایه مرگ 
سپه را که چون او سپه کش بودچه پیش آب دریا ، چه آتش بود
زمینی که شد جای ناورد اویکند سرمه در دیده مه گرد اوی
برون از پی دینش پیکار نیستبرون از غراش ایچ کردار نیست
چلیپاپرستان رومی گروهچنانند از او وز سپاهش ستوه
بدارند روز و شب از بس هراسبه هر کوه دیده ، به هر دیر پاس 
ستون سپهر روان رأی اوستسر تخت بخوان جوان جای اوست
چنانست دادش که ایمن به نازبخسبد همی کبک درپّر باز
شود در یکی روزه ده بار بیشبه پرسیدن گرگ بیمار میش
چو خواهندگان دید شادی کندفزون زان که خواهند رادی کند
دو دستش تو گویی گه کین و مهریکی هست دریا و دیگر سپهر
درین موجها گوهر و جود نم در آن ماه تیغ و ستاره درم
کز آن گوهر و زر که را داد پیشبه یک ره گر آری از و کم و بیش
بدین کرد شاید نهان آفتاببدان شاید انباشت دریا و آب
که را راند خشمش فتد در گدازکه را خواند جودش برست از نیاز
چنو تاج و اورنگ را شاه نیستجز او چرخ فرهنگ را ماه نیست
ز هر افسری برتر ست افسرشز هر گوهری پاکتر گوهرش
هماییست مر چرخ را فّر اویکه شاهی دهد سایهٔ پّر اوی
به چوگان چو برداشت گوی زرنگز بیمش بگردد رخ مه زرنگ 
کمندش چو از شست گردد رهاتو گویی که برداشت ابر اژدها
ز هامون شب تیره بر چرخ تیرکند رشته در چشم سوزن به تیر
چو مالد به زه گوشهای کمانبمالد به کین گوش گشت زمان
به باد تک اسپش به خاور زمینکند غرق کشتی به دریای چین
تف تیغش از هند شب کرد بوم کند باز قنذیل رهبان به روم
نه کس را بود فرّه و جود اونه فرزند چون میر محمود او
شهی مایهٔ شاهی و سروریبزرگی ز گوهر به هر گوهری
گرد زیب از او نامداری همی دهد بوی از او شهریاری همی
دل اختر از جان هوا جوی اوستزبان زمانه ثناگوی اوست
سخنهاش درّست و دانش سرشت خبرهاش هریک چراغ بهشت
چو خرسند بد خوب کاری کندچو خشم آیدش بردباری کند
به نیزه مه آرد ز گردون فرودبه ناوک به کیوان فرستد درود
ز دریا کند در تف تیغ میغز باران خونین کند میغ تیغ
روا باشد این شاه را ماه تخت که فرزند دارد چنان نیکبخت
برادرش چون ماه آن پاکزادبراهیم بن صفر با فر و داد
پناه جهان خسرو ارجمنددل گیتی امید تخت بلند
بزرگی که اختر گه مهر و خشمبه فرمان او دارد از چرخ چشم
بهی در خور تخت او روز بارزهی از در بخت او روزگار
ز شمشیر او لعل جای کمینبریزد ز کف زر به روی زمین
سزد گر کشد بر مه این شاه سر که زینسان برادر وز آنسان پسر
نه زین شاه به در خورگاه بودنه کس را به گیتی چنان شاه بود
نبینی ز خواهنده و میهمانتهی بارگاه ورا یک زمان 
همی هرکه جایی فتد در نیازبدین درگه آیند تازان فراز
رسد هر که آید هم اندر شتاببه خوان و می و خلعت و جاه و آب 
نه کس زین شهنشاه دل خسته شدبه بر هیچ مهمان درش بسته شد
هر آن کز غم جان و بیم گناهبه زنهار این خانه گیرد پناه
ز بدخواه ایمن شود وز ستمچو از چنگ یوز آهو اندر حرم
اگر داد باید شهی هرچه هستدهد این شه و ندهد او را ز دست
چنین باد تا جاودان نام اومگر داد چرخ از ره کام او
همی تا بماند زمان و زمین به فرمانش بادا هم آن و هم این
تن زندگانیش چون کدخدایسلب روز و شب وین جهانش سرای
ز بالای تابنده ماه افسرشز پهنای گیتی فزون کشورش
جهان خرم از فر و اورند اویهم از میر محمود فرزند اوی
ز کردار گرشاسب اندر جهانیکی نامه بُد یادگار از مهان
پر از دانش و پند آموزگارهم از راز چرخ و هم از روزگار
ز فرهنگ و نیرنگ و داد و ستمز خوبّی و زشتیّ و شادّی و غم
ز نخجیر و گردنفرازی و رزمز مهر دل وکین و شادی و بزم
که چون خوانی از هر دری اندکیبسی دانش افزاید از هر یکی
ز رستم سخن چند خواهی شنودگمانی که چون او به مردی نبود
اگر رزم گرشاسب یاد آوریهمه رزم رستم به باد آوری
همان بود رستم که دیو نژندببردش به ابر و به دریا فکند
سُته شد ز هومان به گرز گرانزدش دشتبانی به مازندران
زبون کردش اسپندیار دلیر به کشتیش آورد سهراب زیر
سپهدار گرشاسب تا زنده بودنه کردش زبون کس ، نه افکنده بود
به هند و به روم و به چین از نبرد بکرد آنچه دستان و رستم نکرد
نه ببر و نه گرگ آمد از وی رهانه شیر و نه دیو و نه نر اژدها
به جنگ ار سوار ار پیاده بدیجهان از یلان دشت ساده بدی
سپردی به هنگام که مال میل فکندی به کشتی و کوپال پیل
به شهنامه فردوسی نغزگوی که از پیش گویندگان برد گوی
بسی یاد رزم یلان کرده بودازین داستان یاد ناورده بود
نهالی بُد این رُسته هم زان درختشده خشک و بی بار و پژمرده سخت
من اکنون ز طبعم بهار آورممراین شاخ نو را به بار آورم
به باد هنر گل کفانم بر اویز ابر سخن دُر فشانم بر اوی
برش میوهٔ دانش آرم برون کنم آفرین شهنشه فزون
بسازم یکی بوستان چون بهشتکه خندد ز خوشی چو اردیبهشت 
گلش سربه سر درّ گویا بوددرخت و گیا مشک بویا بود
بتستانی آرایم از خوش سخنکه هرگز نگارش نگردد کهن 
بتش از خردزاده و جان پاکز دانش سرشته نه از آب و خاک
ببافم یکی دیبهٔ شاهوارز معنیش رنگ و ز دانش نگار
ز جان آورم تار و پودش فرازکنم خسروی را برو بر طراز
مرا جز سخن ساختن کار نیستسخن هست لیکن خریدار نیست
ز رادان همی شاه ماندست و بسخریدار از او بهترم نیست کس
که همواره من بنده را شاد داشتسرم را زهم پیشگان بر فراشت
دبیر وی آورد زی من پیام گزین دهخدا لولوی نیکنام
که گوید همی شاه فرهنگ جویبه نام من این نامه را بازگوی
اگر زانکه فردوسی این را نگفتتو با گفتهٔ خویش گردانش جفت
دو گویا چنین خواست تا شد ز طوس چنان شد نگویی تو باشد فسوس
کنون گر سپهرم نسازد کمین بگویم به فرمان شاهِ زمین
کز او نام را خوب کاری بودز من در جهان یادگاری بود
ز بهتر سخن نیست پاینده تر وز او خوشتر و دل فزاینده تر
سخن همچو جان ز آن نگردد کهنکه فرزند جانست شیرین سخن
چنان تند و خودکام گشتی که هیچبه کاری در از من نخواهی بسیچ
ز سر تاج فرهنگ بفکنده ایز تن جامهٔ شرم برکنده ای
نگویی مرا کز چه این روزگارگریزانی از من چو کاهل ز کار
دو چشم ترا دیدنم سرمه بودکنون از چه گشتست آن سرمه دود
گمانی که رازت ندانم همیز چهرت چو نامه بخوانم همی
زبانت ار چه پوشندهٔ راز تستهمی رنگ چهرت بگوید درست
رخت پیش بُد چون یکی گلستاندر آن گلستان هر گلی دلستان
کنون سوسنت دردمندی گرفتگلت ریخت ، لاله نژندی گرفت
بهاری بُدی چون نگار بهشتنمانی کنون جز به پژمرده کِشت
ز خورشید رویت بُد آن گه فزونفروغ چراغی نداری کنون
نه آنی که بودی اگرچه توییکه آن گه یکی بودی اکنون دویی
ز مردان ازین پیش ننگ آمدتز بودن بود مرد ار به جنگ آمدت
پس پرده گشتی چنین پرفسوسنه آگه من از کار و ، تو نوعروس
نگویی تو را جفت در خانه کیستپس پرده این مرد بیگانه کیست
چو دختر شود بد، بیفتد ز راهنداند ورا داشت مادر نگاه
چنین گفت دانا که دختر مبادچو باشد، به جز خاکش افسر مباد
به نزد پدر دختر ار چند دوستبتر دشمن و مهترین ننگش اوست
پریرخ بغلتید در پیش شاهبه خاک از سر سرو بر سود ماه
چنین گفت کای بخت پیشت رهیتو دانی که ناید ز من بی رهی
اگر بزم، اگر ساز جنگ آورمنه آنم که بر دوده ننگ آورم
مرا داده بودی تو فرمان ز پیشکه آن را که خواهم کنم جفت خویش
کنون جفتم آن شاه نیک اخترستکه از هر شه اندر جهان بهترست
همه کار جم یاد کرد آنچه بودچو بشنید ازو شاه شادی نمود
بدو گفت خوش مژده ای دادیمز شادی دری تازه بگشادیم
ز تو بود فرخ مرا تاج و تختز تست اینکه جم را به من داد بخت
کنون بر هیون بسته او را به گاهفرستم به درگاه ضحاک شاه
که گفتست هر ک آرد او را به بندبه گنج و به کشور کنمش ارجمند
ز جان دختر امید دل بر گرفتبه پیش پدر زاری اندرگرفت
دو مشکین کمان از شکن کرد پرببارید صد نوک پیکان ز دُر
مشو، گفت در خون شاهی چنینکه بدنام گردی برآیی ز دین
هم از خونش تا جاودان کین بودهم از هرکسی بر تو نفرین بود
گرت سوی نخچیر کردن هواستهم از خانه نخچیر نکنی رواست
بترس از خداوند جان و روانکه هست او توانا و ما ناتوان
گر ایدر نگیردت فرجام کاربگیرد به پاداش روز شمار
بدی گرچه کردن توان با کسیچو نیکی کنی بهتر آید بسی
اگرچند بدخواه کشتن نکوستاز آن کشتن آن به که گرددت دوست
گر او را جدا کرد خواهی ز مننخستین سر من جدا کن ز تن
بگفت این و شد با غریو و غرنگبه لؤلؤ ز لاله همی شست رنگ
روان پدر سوخت بر وی به مهربه چهرش بر از مهر برسود چهر
مبر، گفت غم کان کنم کت هواستبه هر روی فرمان و رایت رواست
ز بهر جم از جان و شاهی و گنجبرای تو بدهم ندارم به رنج
تو رو زو ره پوزش من بجویکه فردا من آیم به گه نزد اوی
بشد دلبر و شاه را مژده دادشد ایمن جم و بود تا بامداد
سپهر آتش روز چون برفروختدرو خویشتن شب چو هندو بسوخت
بیامد بَر جم شه سرفرازز دور آفرین کرد و بردش نماز
لبت گفت جاوید پرخنده باددرین خانه بودنت فرخنده باد
چو خورشید بی کاست بادی و راستبداندیش چون ماه بگرفته کاست
بر آمد جم از جای و بنواختشبه اندازه بستود و بنشاختش
به بهبود برگفت بر من گمانگرت نابیوس آمدم میهمان
بود نام نیک و سرافراشتنز ناخوانده مهمان نکو داشتن
همی تا توان راه نیکی سپرکه نیکی بود مر بدی را سپر
همی خوب کاریست نیکی به جایکه سودست بر وی به هر دو سرای
ازین پس دهد بوسه ماه افسرتهم از گوهر من بود گوهرت
بود نامداری دلیر و سترگوزین تخمه خیزد نژادی بزرگ
به پنجم پسر باز گرد اوژنیبود اژدهاکش هژبر افکنی
که جوشنش پیل ار به هامون کشدبه گردن نتابد به گردون کشد
ولیکن بترسم که از بهر منبتابدت روزی ز راه اهرمن
به طمع بزرگیم بدهی به بادبدان اژدها پیکر دیوزاد
به جم گفت شه کای جهان شهریاربه من بنده بر بد گمانی مدار
به یزدان که گردون به پرگار زدکره هفت پیمود و بر چار زد
به باد این زمین باز گسترد پستبه آبش گشاد و به آتش ببست
که جز کام تو تا زیم زین سپسنجویم، نه رازت بگویم به کس
به از خوب کاری به گیتی چه چیزکی اندر رسم من بدین روز نیز
گرم دسترس در سزای تو نیستبسندم که ایدر ترا هست زیست
که با دختر خویش تا زنده امپرستار تُست او و، من بنده ام
گر اکنون نه آنی که بودی ز پیشبَرِ من همانی وزان نیز بیش
گهر گرچه اُفتد به کف بی سپاسگرامی بود نزد گوهرشناس
درنگ آور ایدر،همی زی به نازبود کاید آن بخت برگشته باز
نماند جهان بر یکی سان شکیبفرازیست پیش از پس هر نشیب
پسِ تیرگی روشنی گیرد آببرآید پسِ تیره شب آفتاب
بهر بدت خُرسند باید بُدنکه از بد بتر نیز شاید بُدن
غمی نیست کان دل هراسان کندکه آن را نه خُرسندی آسان کند
نبست ایچ دَر داور بی نیازکز آن به دری پیش نگشاد باز
بگفت این و با مهر برخاست تفتبه رخ خاک پیشش برُفت و برفت
می و عنبر و عود و کافور خشکهم از دیبه و فرش و دینار و مشک
فرستاد ازین هرچه بُد در خورشیکی بار هر هفته رفتی برش
همی بود با دلبر و جام جمکه روزی نگشت از دلش کام کم
نهان مانده در کاخ آن سرو بُنچو اندر دل رازداران سخن
بر اورنگ بنشست شیدسب شاد به شاهی دَرِ داد و بخشش گشاد
یکی پورش آمد ز تخمی بزرگ به رسم نیا نام کردش طورگ
چو شد سرکش و گرد و دهسال گشت به زور از نیا وز پدر در گذشت
یلی شد که در خَمّ خام کمند گسستی سر زنده پیلان ز بند
کس آهنگٌ پرتاب او درنیافت ز گردان کسی گرز او برنتافت
ز بالای مه نیزه بفراشتی ز پهنای کُه خشت بگذاشتی
گران جوشن و خود کردی گزین به چابک, سواری ربودی ز زین 
پدرش از پی کینه روزی به گاه به کابل همی خواست بردن سپاه 
چو دید او گرفت آرزوساختن که من با تو آیم به کین آختن 
پدر گفت کاین رای پدرام نیست تو خُردی, ترا رزم هنگام نیست 
هنوزت نگشتست گهواره تنگ چگونه کشی از بَرِ باره تنگ 
تو باید که در کوی بازی کنی نه بر بورکین رزم تازی کنی 
پُر آژنگ رخ داد پاسخ طورگ که گر کوچکم هست کارم بزرگ 
تو از مشک بویش نگه کن نه رنگ ز دُر گرچه کوچک بهابین نه سنگ 
چو خُردی بزرگ آورد دستبرد به از صد بزرگی کِشان کار خرد 
اگر کوچکم کار مردان کنم ببینی چو آهنگ میدان کنم 
مران گرگ را مرگ به در ده که بی خورد ماند میان گله 
پس از چه رسد سرفرازی مراچو کوشش ترا گوی بازی مرا 
پدر شادمان شد گرفتش به بر زره خواست با ترگ و زرین سپر 
یکی تیغ و کوبال و گرزگران همان پیل بالا و برگستوان 
درفشی ز شیر سیه پیکرش همایی ز یاقوت و زر از برش 
بدو داد و کردش سپهدار نو بخواهید گفت اسب سالار نو 
غو کوس بر چرخ و مه برکشید به پرخاش دشمن سپه برکشید 
وزان روی کابل شه از مرغ و مای جهان کرد پر گرد رزم آزمای 
بُد او را یکی پور نامش سرند که زخمش ز پولاد کردی پرند 
درفش و سپه دادش و پیل و ساز فرستادش از بهر کین پیشباز 
دو لشکر چو درهم رسیدند تنگرده برکشیدند, برخاست جنگ 
به مه برشد از عاج مهره خروشجهان آمد از نای رویین به جوش 
دل کوس بستد ز تندر غریوسر خشت برکند دندان دیو 
پر از خاک شد روی ماه از نبردپر از گرد شد کام ماهی ز گرد 
جهان کرد پر گرد آورد جویزخون خاست در جای ناوری جوی 
ز بانگ یلان مغز هامون بخستاز انبوه جان راه گردون ببست 
زمین همچو کشتی شد از موج خونگهی راست جنبان و گه چپ نگون 
دزی بود هر پیلِ تازان به جنگز هر سوی او گشته پرّان خدنگ
ز گرد سیه خنجر جنگیانهمی تافت چون خنده زنگیان
کمان ابر و بارانش الماس شدسر و مغز پربار سر پاس شد
تو گفتی هوا لاله کارد همیز پولاد بیجاده بارد همی
ز بس کشته کآمد ز هردو گروهز خون خاست دریا و از کشته کوه
نه پیدا بُد از خون تن رزم کوشکه پولاد پوشست یا لعل پوش
چو شد سخت بر مرد پیکار کارروان گشت با تیغ خونخوار خوار
به پیش پدر شد طورگ دلیربپرسید کای برهنر گشته چیر
سرند از میان سران سپاهکجا جای دارد بدین رزمگاه
کدامست ازین جنگیان چپ و راستسلیحش چه چیزو درفشش کجاست
که گر هست بر زین که کینه کشهم اکنون کشان آرمش زیرکش
بدو گفت آنکو به قلب اندرونستادست و بر کتف رومی ستون
به سر بر درفشان درفشی سپیدپرندش همه پیکر ماه و شید
کلاه و سپر زرد و خفتانش زردهمان اسب و برگستوان نبرد
تو گویی که کوهیست از شنبلیدکه باد وزانش از بر آتش دمید
دلاور ز گفتِ پدر چون هژبریکی نعره زد کآب خون شد در ابر
یکی تیز کرد از پی جنگ چنگبر آهخت گلرنگ را تنگ تنگ
چنان تاخت تند ارغُن سنگ سمکه در گنبد از گرد شد ماه گم
به زخم سر تیغ و گرز و سنانهمی تافت در حمله هرسو عنان
به هر حمله خیلی فکندی نگونبه هر زخم جویی براندی ز خون
دل پیل تیغش همی چاک زدز خون خرمن لاله بر خاک زد 
شد آن لشکر گشن پیش طورگرمان چون رمه میش از پیش گرگ
به هم شان برافکند یکبارگیهمی تاخت تا قلبگه بارگی
سرند از کران دید دیوی به جوشبه زیر اژدهایی پلنگینه پوش
از آسیبش افتاده بر پیل پیلسواران رمان گشته بر میل میل
برانگیخت کُه پیکرِ بادپایبه گرز گران اندر آمد ز جای
چنان زدش بر کرگ ترگ ای شگفتکه کرگش ز ترگ آتش اندر گرفت
طورگ دلاور نشد هیچ کٌندعقاب نبردی برانگیخت تٌند
بیاویخت از بازویش گرز جنگبزد بر کمربندش از باد چنگ
ز زین درربود و همی تاختشبه پیش پدر برد و انداختش
چنین گفت کاین هدیه کابلینگهدار ازین کودک زابلی
ازین پس یکی پرهنر دان مرامخوان کودک و شیر نر خوان مرا
دگر ره شد آهنگ آویز کردبر آورد گرز اسپ را تیز کرد
سپه چون سپهبد نگون یافتندهزیمت سوی راه بشتافتند
درفش و بٌنه پاک بگذاشتندگریزان ز کین روی برگاشتند
طورگ و دلیران زابل بدٌمبرفتند چندان که سود اسپ سم
از ایشان فکندند بسیار گردبه جای آن کسی رّست کش اسپ برد
گریزنده را تا به کابل فرازسنان از قفا هیچ نگسست باز
همه ره ز بس کشته بر یکدگرسر و پای و دل بود و، مغز و جگر
از آن دشت تا سال صد زیر گِلهمی گرگ تن برد و کفتار دل
چو پیروز گشتند از آن رزمگاهسوی زابل اندر گرفتند راه
فروماند کابل شه آشفته بختز شیدسب کین کش بترسید سخت
که ناگه سرآرد جهان بر سرندکُشد نیز هرچ از اسیران سرند
به بیچارگی ساو و باژ گرانبپذرفت با هدیه بیکران
کرا کُشته بد دادشان خونبهابدان کرد فرزند و خویشان رها
چو بگذشت ازین کار یکچند گاهبه شیدسب بر تیره شد هور و ماه
گرفت از پسش پادشاهی طورگسرافراز شد بر شهان بزرگ
یکی پورش آمد به خوبی چو جمنهاد آن دلارام را نام شم
ز شم زآن سپس اثرط آمد پدیدوزین هردو شاهی به اثرط رسید
به زور تن و چهره و برز و یالشد این اثرط از سروران بی همالی
چو با تاج بر تخت شاهی نشستچو با تاج بر تخت شاهی نشست
به هر کار بُد اخترش دلفروزبه هر کار بُد اخترش دلفروز
بیاکند گنجش ز گنج نهانپر انبه شدش بارگاه از مهان
چو بختش به هر کار منشور دادسپهرش یکی نامور پور داد
بدان پورش آرام بفزود و کامگرانمایه را کرد گرشساب نام
به خوبی چهر و به پاکی تنفروماند از آن شیرخوار انجمن
به روز نخستین چو یک ماهه بودبه یک مه چو یک ساله بالا فزود
چو شد سیر شیر از دلیریّ و زورز گهواره شد سوی شبرنگ و بور
زره کرد پوشش به جای حریربه بازی کمان خواست با گرز و تیر
به جای خوروخواب کین جست و جنگبه جای بّرِ دایه شیر و پلنگ
به ده سالگی شد ز مردی فزونبه یک مشت گردی فکندی نگون
چو زین آبگون چرخ گوهر نگارگذر کرد سالش دو پنج و چهار
یلی شد که جستی ز تیغش گریغبه دریا درون موج و بر باد میغ
زدی دست و پیل دوان را دو پایگرفتی فرو داشتی هم به جای
بدش سی رشی نیزه ز آهن به رزممی از ده منی جام خوردی به بزم
به زخم از سنان آتش افروختیبه یک تیر ده درع بر دوختی
کمربند گردان گرفتی به کینبرانداختی نیزه بالا ز زین
اگر خود اگر گرز و خفتانش پیلکشیدی، نبردی فزون از دو میل
به کوه ار کمند اندر آویختیبکندی، چو باره برانگیختی
رخ مرگ در تیغ پر خون ز پیشبدیدی چو در آینه چهر خویش 
بسی بر سپاه گران گشته چیربسی سروران را سرآورده زیر
کسی نیز بر اثرط کینه جوینیارست کاویدن از بیم اوی
ز تور اندرون تا که گرشاسب خاستگذر کرده بُد هفتصد سال راست
بزرگان این تخمه کز جم بُدندسراسر نیاکان رستم بُدند
همان سال ضحاک کشورستانز بابل بیامد به زابلستان
به هندوستان خواست بردن سپاهکه رفتی بدان بوم هر چندگاه
درِ گنج اثرط سبک باز کردسپه را به نزل و علف ساز کرد
بزد کوس و با لشکر و پیل و سازسه منزل شد از پیش ضحاک باز
فرود آوریدش به ایوان خویشسران را همه خواند مهمان خویش
کیانی یکی جشن سازید و سورکه آمد ز مینو بدان جشن حور
دَم مشک از مغز بر میغ شددِلِ میغ ازو عنبر آمیغ شد
ز عکس می زرد و جام بلورسپهری شد ایوان پُر از ماه و هور
به تلّ بود زرّ ریخته زیر گامبه خرمن برافروخته عودِ خام
کشیده رَده ریدگان سرایبه رومی عمود و به چینی قبای
دو گلشان به باد از شبه دِرع سازدو سٌنبل به میدان گل گوی باز
می زرد کف بر سرش تاختهچو دٌرّ از بَرِ زرّ بگداخته
شهان پاک با یاره و طوقِ زرهمان پهلوانان به زرّین کمر
شده هر دل از خرّمی نازجویلَبِ می کشان با قدح رازگوی
نوازان نوازنده در چنگ چنگز دل برده بگماز چون زنگ زنگ
ز بس کز نوا بود در چرخ جوشهمی زهره مر ماه را گفت نوش
همه چشم ضحاک از آن بزم و سوربه گرشاسب بٌد خیره مانده ز دور
که از چهر و بالا و فرّ و شکوههمانند او کس نبد زآن گروه
به اثرط چنین گفت کز چرخ سراگر بگذرانی، سزد زین پسر
هنرهاش زآنسان شنیدم بسیکه نادیده باور ندارد کسی
ستود اثرط از پیش ضحاک رابه رخساره ببسود مر خاک را
به فرّ تو شاه جهاندار گفتچنانست کش در هنر نیست جفت
چو او بانگ بر جنگی ادهم زندسپاهی به یک حمله بر هم زند
سنانش آتش کین فروزد همیخدنگش دل شیر دوزد همی
کس ار هست بدخواه شاه زمینفرستش بَرِ وی به پرخاش و کین
که گر هست میدانش چرخ اسپ میغسرش پیشت آرد بریده به تیغ
جهاندار گفتا چنینست راستبدین، برز و بالا و چهرش گواست
هنر هرجه در مرد والا بودبه جهرش بر از دور پیدا بود
چو گوهر میان گهردار سنگکه بیرون پدیدار باشدش رنگ
شنیدم هنرهاش و دیدم کنونبه دیدار هست از شنودن فزون
به جمشید ماند به چهر و به پوستگواهی دهم من که از تخم اوست
بدین یال و گردی بَر و گرده گاهچه سنجد به چنگالِ او کینه خواه
کنون آمدست اژدهایی پدیدکزآن اژدها مِه دگر کس ندید
از آن گه که گیتی ز طوفان برستز دریا برآمد به خشکی نشست
گرفته نشیمن شکاوند کوههمی دارد از رنج گیتی ستوه
میان بست بایدش بر تاختشوزان زشت پتیاره کین آختن
چنین گفت گرشاسب کز فرّ شاهببندم بر اهریمنِ تیره راه
مرا چون به کف گرز و شبرنگ زیربه پیشم چه نر اژدها و چه شیر
کنم ز اژدهای فلک سر زکینچه باک آیدم ز اژدهای زمین
سرِ اژدها بسته دام گیرتو اندیشه او مبر، جام گیر
مهان بر ستایش گشادند لبهمه روز ازین بٌد سخن تا به شب
چو در سبز بُستان شکوفه برُستجهان زردی از رخ به عنبر بشست
گسستند بزم نی و رود و بادپراکنده گشت انجمن مست و شاد
به گرشاسب گفت اثرط ای شوربختز شاه از چه پذرفتی این جنگ سخت
نه هر جایگه راست گفتن سزاستفراوان دروغست کان به زراست
نگر جنگ این اژدها سرسریچنان جنگ های دگر نشمری
نه گورست کافتد به زخم دُرشتنه شیری که شاید به شمشیر کشت
نه دیوی که آید به خم کمندنه گردی کِش از زین توانی فکند
دمان اژدهاییست کز جنگ اوسُته شد جهان پاک بر چنگ او
زدندش بسی تیر مویی ندوختتنش هم ز نفظ و ز آتش نسوخت
مشو غرّه زین مردی و زورِ تنبه من برببخشای و بر خویشتن
به خوان بر نیاید همی میهمانکش از آرزو در دل آید گمان
به گیتی کسی مرد این جنگ نیستاگر تو نیازی، بدین ننگ نیست
فکندن به مردی تن اندر هلاکنه مردیست کز باد ساریست پاک
هر امید را کار ناید به برگبس امید کانجام آن هست مرگ
بدو گفت گرشاسب مَندیش هیچتو از بهر شه بزم و رامش بسیچ
شما را می و شادی و بمّ و زیرمن و اژدها و کُه و گُرز و تیر
اگر کوه البرز یک نیمه اوستسرش کنده گیر از که آکنده پوست
همه کس ز گرشاسب دل برگرفتکه تند اژدهایی بٌد آن بس شگفت
به دُم رود جیحون بینباشتیبه دَم زنده پیلی بیو باشتی
ز برش ار پریدی عقاب دلیربیفتادی از بوی زهرش به زیر
کُهی جانور بُد رونده ز جایبه سینه زمین در به تن سنگ سای
چو سیل از شکنج و چو آتش ز جوشچو برق از درخش و چورعد از خروش
سرش بیشه از موی وچون کوه تنچو دودش دَم و همچو دوزخ دهن
دو چشم کبودش فروزان ز تابچو دو آینه در تَف آفتاب
زبانش چو دیوی سیه سر نگونکه هزمان ز غاری سرآرد برون
ز دنبال او دشت هرجای جویبه هر جوی در رودی از زهر اوی
تنش پُر پشیزه ز سر تا میانبه کردار بر عیبه برگستوان
ازو هر پشیزه چو گیلی سپرنه آهن نه آتش برو کارگر
نشسته نمودی چو کوهی به جایستان خفته چندانکه پیلی به پای
کجا او شدی از دَم زهر بیزدو منزل بُدی دام و دَد را گریز
ز دندان به زخم آتش افروختیدرخت و گیاها همی سوختی
پس از بهر جنگش یل زورمندیکی چرخ فرمود سهمن بلند
کمانی چو چفته ستونی ستبرزهش چون کمندی ز چرم هژبر
که بر زه نیامد به ده مرد گردنه یکیّ توانستش از جای برد
چنان بود تیرش که ژوپین گرانشمردند هر تیر خشتی گران
ز کردار آن چرخ بازوگسلخبر یافت ضحاک و شد خیره دل
به اثرط بفرمود و گفتا به گاهبه دشت آر گرشاسب را با سپاه
که تا زین دلیران ایران، هنرببیند چو گردند با یکدگر
سواری او نیز ما بنگریمبه میدان هنرهای او بشمریم
چو از خواب روز اندرآمد به خشمرخش شست چشمه به زر آب چشم
تبیره زنان لشکر آراستهبه دشت آمد و گرد شد خاسته
سران سوی بازی گرفتند رایببستند پیلان جنگی سرای
به آماج و ناورد و مردی و زورنمودند هر یک دگرگونه شور
برون تاخت گرشاسب چون نرّه شیریکی بور چوگانی آورده زیر
کمر چون دل عاشقان کرده تنگچو ابروی خوبان کمانی به چنگ
به گرز و سنان اسپ تازی گرفتبه ناورد صدگونه بازی گرفت
بینداخت ده تیر هر ده ز برچو زنجیر پیوست بر یکدگر
به خاری سپر شش به هم بربداشتبزد تیر و بیرون ز هر شش گذاشت
به هم بسته زنجیر پیلان چهاربیفکند نیزه درآمد سوار
بدان نیزه آهن آهنگ کردهمه برربود از مه آونگ کرد 
به تک همبر اسپ نیزه به دستدوید و هم از پای بر زین نشست
به شمشیر هر چار نعل ستوربیفکند کز تک نیاسود بور
یکی گوی در خم چوگان فکندبدانسانش زی چرخ گردان فکند
کزان زخم شد روی چرخ آبنوسبه رفتن لب ماه را دادبوس
چو بازآمد از ابر بگذاشتشبه چوگان هم از راه برگاشتش
برانداخت چندانکه با زهره گویچنان شد که سیبی که گیری به بوی
به بازی ز تازش ناستاد بازشد آن گوی چون مهره او مهره باز
سه ره دردوید از پسش همچنینکه نگذاشت گوی از هوا بر زمین
پس آنگاه آن چرخ کین درربودکه پیش از پی اژدها کرده بود
چناری بد از پیش میدان کهنچو ده بارش اندازه گردبن
سه چوبه بزد بر میان چناربه دو نیمه بشکافتش چون انار
پیاده شد و پای پیلی دمانگرفت و بزد بر زمین در زمان
ببوسید از آن پس زمین پیش شاهغو کوس و نای اندر آمد به ماه
گرفت آفرین هرکس از دل برویجهاندار چشمش ببوسید و روی
بدو گفت زینسان هنر کار تستتو دانی هم از اژدها کینه جست
گر این کار گردد به دست تو راستدر ایران جهان پهلوانی تراست
پراکنده گشتند هر کس که بودسپهبد شد و ساز ره کرد زود
پدر چندش از مهر دل داد پندز پندش به دل درنیفتاد بند
چو چاره نبد چندش آگاه کردز خویشانش ده مرد همراه کرد
بدان تا اگر جنگ را روی و سازنبینند، آرندش از جنگ باز
چه چیز آمد این مهر فرزند و دردکه در نیک و بد هست با جان نبرد
چو نبود دل از بس غمش خون بودچو باشد غم آنگاه افزون بود
مغ از هیر بد موبدان کهنز ضحاک راندند زینسان سخن
که بی جادوی روز نگذاشتیز بابل بسی جادوان داشتی
بفرمود تا از شگفتی بسینمودند گرشاسب را هر کسی
ز تاریکی و آتش و باد و ابرز غول و دژم دیو وز شیر و ببر
نشد هیچ از آن کُند گرد دلیرگذشت از میان همچو غرنده شیر
چو زی اژدها ماند یک میل راهبدیدند در ره یکی دیده گاه
برو خانه ای از گچ و خاره سنگدرش آهنین، راه دشوار و تنگ
خروشان ز بامش یکی دیده دارکه ای بیهشان نیست جانتان به کار
چه گردید ایدر چه جای شماستکزآن سو نشیمنگه اژدهاست
اگر زان دره سر یکی برکشدهم این جایگه تان به دَم درکشد
ز مردم پرداخت این بوم و مرزهم از چارپای و هم از کشت و رز
من ایدر بُوَم روز و شب دیده بانچو آید شب آتش کنم در زمان
که تا هر که بیند گریزند زودنشانست شب آتش و روز دود
سپهبد بدو گفت جایش کجاستچه مایست بالاش برگوی راست
نشیمنش گفت این شکسته درهکه بینی پر از دود و دم یکسره
بدین خانه هر گه که ساید برشز بالای دیوار باشد سرش
گریزید از ایدر که نا گه کنوناز آن کوه پایه سرآرد برون
گو پهلوان گفت چندین مگویمن از بهر او آمدم جنگجوی
هم اکنون بدین گرزه صد منیبه آرمش از آن چرم اهریمنی
بخوابم تنش خوار بر خاک برسرش بسته آرم به فتراک بر
بدو دیده بان گفت کای گرد کینگرش هیچ بینی نگویی چنین
برو کارگر خنجر و تیر نیستدم آهنج کوهیست نخچیر نیست
نسوزد تنش زآتش و تف و تابز دریاست خود بیم نایدش از آب
نبینی ز زهرش جهان گشته رودهمه شخ سیاه و همه کُه کبود
پذیره مشو مرگ را زینهارمده خیره جان را به غم زینهار
همان ده دلاور ز خویشانش نیزبسی لابه کردند و نشنود چیز
ز تریاک لختی ز بیم گزندبخورد و گره کرد بر زین کمند
مر آن ویژگان را همانجا بماندبه یزدان پناهید و باره براند
درآمد بدان درّه آن نامداریکی کوه جنبان بدید آشکار
برآن پشته بر پشت سایان به کینز پیچیدنش جنبش اندر زمین
چو تاریک غاری دهن پهن و بازدو یشکش چو شاخ گوزنان دراز
زبان و نفس دود و آتش به همدهان کوره آتش و سینه دم
به دود و نفس در دو چشمش زنوردرفشان چو در شب ستاره ز دور
ز ثف دهانش دل خاره مومز زهر دَمش باد گیتی سموم
گره در گره خَم دُم تا به پشتهمه سرش چون خار موی درشت
پشیزه پشیزه تن از رنگ نیلازو هر پشیزی مِه از گوش پیل
گهی چون سپرها فکندیش بازگهی همچو جوشن کشیدی فراز
تو گفتی که بُد جنگیی در کمینتنش سر به سر آلت جنگ و کین
همه کام تیغ و همه دم کمرهمه سر سنان و همه تن سپر
چو بر کوه سودی تن سنگ رنگبه فرسنگ رفتی چکاکاک سنگ
ببد خیره زو پهلوان سترگبه دادار گفت ای خدای بزرگ
توانایی و آفرینش تراستهمی سازی آنچ از توانت سزاست
کنی زنده هرگونه گون مرده رادهی تازگی خاک پژمرده را
نگاری تن جانور صدهزارکزیشان دو همسان ندارد نگار
ز دریا بدینگونه کوه آوریجهانی ز رنجش ستوه آوری
تو دِه بنده را زورمندی و فرّکه از بنده بی تو نیاید هنر
بگفت این و زی چرخ کین دست بردبه کوشش تن و جان به یزدان سپرد
سمندش چو آن زشت پتیاره دیدشمید و هراسید و اندر رمید
نزد گام هرچند برگاشتشپیاده شد از دست بگذاشتش
بَرِ اژدها رفت و بفراخت دستخدنگی بپیوست و بگشاد شست
زدش بر گلو کام و مغزش بدوختز پیکان به زخم آتش اندرفروخت
چو بفراخت سر دیگری زد به خشمز خون چشمه بگشادش از هر دو چشم
دمید اژدها همچو ابر از نهیبچو سیل اندر آمد ز بالا به شیب
به سینه بدرید هامون ز همسپر درربود از دلاور به دم
زدش پهلوان نیزهای بر ز فرسنانش از قفا رفت یک رش به دَر
دُم اژدها شد گسسته به دردبرافشاند با موج خون زهر زرد
به کام اندرش نیزه آهنینبه دندان چو سوهان بیازد به کین
به گرز گران یاخت مرد دلیردرآمد خروشنده چون تند شیر
بدانسان همی زدش با زور و هنگکه از کُه به زخمش همی ریخت سنگ
سر و مغزش آمیخت با خاک و خونشد آن جانور کوه جنگی نگون
همه جوشنش زان دم و زهر تیزبجوشید و برجای شد ریزریز
زمانی بیفتاد بی هوش و رایچو آمد به هُش راست برشد به جای
بغلتید پیش گرو گر به خاکهمی گفت کای دادفرمای پاک
ز تُست این توان من، از زور نیستکه بی تو مرا زورِ یک مور نیست
همه زور و فرّ و توان و بهیتو داری و آن را که خواهی دهی
سواران او هم بدان دیده گاهبَرِ دیده بان دیده مانده به راه
سمندش بدیدند کز تنگ کوهبیامد دوان وز دویدن ستوه
تن زرّ گون کرده سیمین ز خویکشان زین و برگستوان زیر پی
گمانشان چنان بُد که شد گردگیرسرشکش همه خون شد و رخ زریر
فتادند بر خاک بی هوش و تیوهمی داشتند از غم دل غریو
دژم دیده بان گفت کای بیهشانچه گریید ازین اسپ و وین زین کشان
سپهند به دام دم اژدهااگر ماندی اسپش نگشتی رها
که او اسپ اندر تک زور و رک ز فرسنگی آهو بگیر به تک
درین سوک بودند و غم یکسرهکه گرشاسب زد نعره ای از دره
همی آمد آشفته چون پیل مستبه بازو کمان، گرز و خنجر به دست
بدان مژده از دیده بان خاست غودویدند پیش سپهدار نو
همی گفت هر کس که یزدان سپاسکه رَستی تو از رنج و ما از هراس
بی آزار باز آمدی تن دُرستاز آن اژدها کین نبایست جُست
چو نتوان ز دشمن بر آورد پوستازو سر به سر چون رهی هم نکوست
یل نیو گفت آنکه بدخواه ماستچنان باد بیچاره کان اژدهاست
برفتند و دیدند، هرکس که دیدبرآن دست و تیغ آفرین گسترید
از آن مرز برخاست هرسو خروشز نظاره کوه و درآمد به جوش
برآن اژدها و یَل نامدارفزون گرد شد مردم از صدهزار
سپهبد هم آنجا چو آمد فرودشد از رزم زی شادی و بزم و رود
فرسته برون کرد گردی گزینبدادش عرابی نوندی به زین
یکی دشت پیمان برّنده راغبه دیدار و رفتار زاغ و نه زاغ
سیه چشم و گیسوفش و مشک دُمپری پوی و آهو تک و گور سم
که اندام مه تازش و چرخ گردزمین کوب و دریا بُرو ره نورد
به پستی چو آب و به بالا چو ابرشناور چو ماغ و دلاور چو ببر
از اندیشه دل سبک پوی ترز رای خردمند ره جوی تر
چو شب بد ولیکن چه بشتافتیبه تک روز بگذشته دریافتی
به گامی شمردی کُه از وی زوربدیدی شب از دور بر موی مور
بجستی به یک جستن از روی زمبگشتی به ناورد بر یک درم
چو بر آب جستی چو بر کوه راهبه روز از خور افزون شدی شب زماه
برو مژده بر چون ره اندر گرفتجهان گفتی از باد تک برگرفت
چنان شد میان هوا تیرپویکه چوگان بُدَش دست و خورشید گوی
همی جست چون تیر و رفتار تیرز نعلش زمین چون ز باد آبگیر
فروهشته پُش چون زره بر عنانبرافراشته گوش ها چون سنان
همی بست از گرد تک چشم مهرهمی کافت از شیهه گوش سپهر
سوارش ازو باز ناورد پایمگر بر در شاه زابل خدای
رسانید مژده به شاه دلیرکه بر اژدها چیره شد نرّه شیر
ز شادی برو جان برافشاندندبر آن مژده بر آفرین خواندند
دهانش ز یاقوت کردند پُردو دستش ز دینار و دامن ز دُر
به شبرنگ بر نیز دیبای لعلفکندند و زرینش کردند نعل
چو باران درم ریختند از برشگرفتند در مشک سارا سرش
برفتند نزد سپهبد سیاهکشیدند پس اژدها را به راه
ز گردون بهم بیست و از پیل پنجبُد از بار آن اژدها زیر رنج
همه ره ز بس بار آن کوه نیلز گردون همه بیش نالید پیل
بزرگان ابا اثرط سرفرازدرفش و سپه پیش بردند باز
ز کوس و تبیره برآمد خروشجهان شد پر از رامش و نای و نوش
همه شهر و ره بود پُرخواستهبه آذین و گنبد بیاراسته
شده کوی و برزن چو باغ ارمزبر مشک و در پای ریزان درم
پذیره شد از شهر برنا و پیراز آن اژدها خیره وز زخم تیر
به صحرا برون چرمش آکنده کاهنهادند تا دید ضحاک شاه
بدان خرمی بزمی افکند پیکزآن بزم ماه آرزو کرد می
بفرمود کامروز دل شادکامهمه یاد گرشاسب گیرید جام
زره دادش و خود و زرّین سپرکلاه و نگین، اسپ و تیغ و کمر
همان جوشن خویش و خفتان جنگبه خروارها دیبه رنگ رنگ
از آن کاژدها کشت و شیری نموددرفش چنان ساخت کز هردو بود
به زیر درفش اژدها سیاهزّبر شیر زرّین و بر سرش ماه
زمین همه زاول و بوم بُستبدو داد و بنوشت عهدی درست
جهان پهلوانی مرو را سپردوزآنجای لشکر سوی هند بُرد
مرین داستان را سرانجام کارنبشتند هرکس در آن روزگار
به رود و ره جام برداشتندبه ایوان ها نیز بنگاشتند
از آن پس چو ضحاک شد باز جاینشست و، نزد جز به آرام رای
شهی بود در هند مهراج نامبزرگی به هرجای گسترده کام
بهو نام خویشی بدش در سپاهز دستش به شهر سرندیب شاه
به مهراج هرگاه گفتی که بختترا داد تاج بزرگی و تخت
توی شاخ قنوخ و رای برینز هندوستان تا به دریای چین
خدیو در تبت و رای هندتوی و آن قنوج و دریای سند
چرا گم کنی گوهر پاک رادهی هدیه و باژ ضحاک را
نه خُرسندی و بردباری ز مردهمه نیک باشد به درمان درد
بسی بردباریست کز بددلیستبسی نیز خُرسندی از کاهلیست
نترسم ز ضحاک من روز جنگمرا هست ازو گر ترا نیست ننگ
میانشان بدین جنگ و پرخاش خاستسپه نیمه ای بر بهو گشت راست
به مهراج برشد جهان تنگ و تارشکستند لشکرش را چند بار
ازین آگهی نزد ضحاک شدز بس مهر مهراج غمناک شد
بر آشفت و فرمود تابر حریربه اثرط یکی نامه سازد دبیر
چو چشم قلم کرد سرمه ز قارببد دیدنش روشن و دیده تار
شد آن خامه از خطّ گیتی فروزدل شب نگارنده بر روی روز
بسان یکی خرد گریان پسرخروشان و پویان و جویان پدر
به دشتی در از شوره گم کرده راهز گرما زبان کفته و رخ سیاه
سَرِ نامه نام جهانبان نوشتخدایی که او ساخت هر خوب و زشت
سرایی چنین پرنگار آفریدتن و روزی و روزگار آفرید
به یک بند هفت آسمان بسته کردبدین گوهران کار پیوسته کرد
زمین ایستاده به باد سپهرهمی گرد گردان شده ماه و مهر
دگر گفت کز گشت چرخیم شادکه بر ما در شادکامی گشاد
به فرمان ما گشت تاج و نگینهمان شاهی هفت کشور زمین
چُنان کهتری دادمان نیکبختسپر کرده تن پیش هر کار سخت
کنون خاست در هند کاری تباهکه آنجا همی برد باید سپاه
بدین چاره گرشاسب باید همیوگر زود ناید نشاید همی
به گاه فرستش بسیچی مسازکه هست آنچه باید چو آید فراز
ز ما لشکر و ساز و یاری و گنجوزو مردی و کین گزاری و رنج
چنان کن کزین نامه یک نیمه بیشنخوانده به وی کو گِرَد راه پیش
چنان باز پاسخ رسان بی درنگکه آواز بازآید از کوه سنگ
چو نامه به نام آور اثرط رسیدزمانی به اندیشه دَم درکشید
به گرشاسب گفت ای هژبر زمانچه گویی بدین جنگ بندی میان
بترسم که جایی بپیچی ز بختکه هم راه دورست و هم کار سخت
جهان پهلوان گفت کای پرهنربه جز جنگ و کین من چه خواهم دگر
مرا ایزد از بهر جنگ آفریدچه باکم که جنگ آمد اکنون پدید
چنین یال و بازوی و این زور و برزنشاید که آساید از تیغ و گرز
سپاهی که جانش گرامی بودازو ننگ خیزد، نه نامی بود
کس ار دیدمی من سزای شهیازین مارفش کردمی جا تهی
ولیکن چو کس می نیاید به دستبترسم که باشد بتر زین که هست
سرانجام با پادشا به جهاناگر چند بد باشد و بدنهان
ز فرمان شه ننگ و بیغاره نیستبه هر روی کُه را ز مِه چاره نیست
بود پادشا سایه کردگاربی او پادشاهی نیاید به کار
بدو گفت کز بدگمان برگسلبه اندیشه بیدار کن چشم و دل
چو دانش نداری به کاری دروننباشد ترا چاره از رهنمون
تو درگاه شاهان ندیدستی ایچشنو پند پس کار رفتن بسیچ
بر این جهان داد ده پادشاستدگر مردم پاک دانای راست
ز هر درگه آنست بشکوه‌ترکه از نامداران پُر انبوه تر
به درگاه شه نامداران بس‌اندچو تو نه ولیکن سواران بس اند
بدان کز همه چیزها آشکاربگردد سبکتر دل شهریار
دَم پادشاهان امیدست و بیمیکی را سموم و دگر را نسیم
چو چرخست کردارشان گردگردیکی شاد ازیشان یکی پر ز درد
چو رفتی بر شه پرستنده باشکمر بسته فرمانش را بنده باش
چنان‌کن که‌هرکس‌که نزدیک اوستبه رادی شود با تو دلسوزو دوست
اگر چه نداری گنه نزد شاهچنان باش پیشش که مردگناه
به هر کار بر وی دلیری مکنمگو پیش او چون همالان سخن
بپرهیز ازو بر بد آراستنهم از آرزوی کسان خواستن
اگر چند گستاخ داردت پیشچنان ترس ازو‌کز بداندیش خویش
منه پیش او در گه خشم پایچو خشم از تو دارد تو پوزش نمای
زیانش مخواه از پی سود کسبه کارش درون راستی جوی و بس
ز کردار گفتار بر مگذرانمگو آنچه دانش نداری در آن
به نیکی‌اش دار سیصد سپاسهم اندک دهش زو فراوان شناس
به خوبانش بر دیده مگمار هیچوزان ره که فرموده باشد مپیچ
چو چیزش خواهی و ندهد متابمبر بآتش خشمش از رویت آب
همه خوی و کردار او را ستایهمان دشمنش را نکوهش فزای
به دل دوستان ورا دار دوستمخواه ازبن آن را که بدخواه اوست
ز سستی مدان گر بود نیک مردکه داند چونیکی بدی نیزکرد
مبین نرمی پشت شمشیر تیزگذارش نگر گاه خشم و ستیز
تو از بردباران به دل ترس دارکه از تند در کین بتر بردبار
مگردان دروغ آنچه گوید سخنوز آنچت بپرسد نهان زو مکن
گرت چیزی اندر خور شهریارفزونی بود و آید او را به کار
بدو بخش هر چند داریش دوستکه نیز آنچه الفغدی از جاه اوست
نباید شد از خنده شه دلیرنه خندست دندان نمودن ز شیر
چو دریا نمایدت دُرّ خوشابهمی جوی دُرّ و همی ترس از آب
اگر چه پرستی ورا بی شماربرو بر مکن ناز و کشی میار
که گر خواهد او چون تو باید بسیدهد و جای و جاهت به دیگر کسی
مزن فال بد پیشش از هیچ سانبد و نیک رازش مگو با کسان
هر آن گه که کاریت فرموده شاهدر آن وقت هیچ آرزو زو مخواه
چنانش نمای از دل راه جویکه ازوی توگیری همی رنگ وبوی
به نخچیرگاه و صف رزم و کینمگرد از برش دور گامی زمین
گر از چاه باشی سَرِ انجمنتو آن جاه ازو دان، نه از خویشتن
چو فرهنگی آموزی اش نرم باشبه گفتار با شرم و آزرم باش
بدان تا تو با بزم باشی و سورمگرد از پرستیدن شاه دور
چو نزدش بوی بسته‌کن چشم‌وگوشبرو جز به نرمی زبانی مکوش
زکس های او بد مران پیش اویسخن‌ها جزآن کش خوش آمدمگوی
رهی‌و اسپ‌و‌ آرایش‌و فرش‌و سازز هر سان که دارد شه سرفراز
تو زانسان مدار ارز کار آگهیکه با شه برابر نشاید رهی
که چندین رهی را بباید گهرنگر شاه را چند باید دگر
ز کهتر پرستیدن و خوشخوییستز مهمتر نوازیدن و نیکوییست
چنین پند بسیار دارم ز برتو گر دیده ای خود فزایی دگر
سپهبد چو پندش سراسر شنودپذیرفت و ره را پسیچید زود
هزار از یل نیزه‌ زن زابلیگزین کرد با خنجر کابلی
یلانی دلاور هزار از شمار ولیکن گهِ جنگ هر یک هزار
همه چرخ ناورد و اختر سنانهمه حمله را با زمان هم عنان
ره و رایشان رزم و کین ساختنهوا ریزش خون و خوی تاختن
زره جامه‌شان روزوشب جای زینزمین پشت اسپ آسمان گرد کین
بزد نای و لشکر سوی شاه بُردبه راه از شدن گرد بر ماه بُرد
دو منزل پدر بُدش رامش فزایورا کرد بدرود و شد باز جای
به دژ هوخت گنگ آمد از راه شامکه خوانیش بیت‌المقدس به ‌نام
بدان گه که ضحاک بد پادشاهمی خواند آن خانه را ایلیا
چو بشنید کآمد سپهبد ز راهبه‌نوی بیاراست ایوان و گاه
همه لشکر و کوس و بالا و پیلپذیره فرستاد بر چند میل
چو آمد، نشاندش بَرِ تخت شادیکی هفته بُد با می و رود و باد
گهر دادش و چیز چندان ز گنجکه ماند از شمارش مهندس به رنج
سر هفته گفتا سوی هند زودبه یاری مهراج برکش چو دود
سرندیب برگرد و کین ساز کنز کین گوش کشور پر آواز کن
بهو را ببند و همانجا بداربه درگاه مهراج برکن بدار
و گر چین شود یار هندوستانتو مردی کن و کین و زهردوستان
گرت گنج باید به تن رنج برکه در رنج تن یابی از گنج بر
بفرموده‌ام تا به دریا کناربیارند کشتی دوباره هزار
مهان پوشش لشکر و خورد و سازبه هر منزلی پیشت آرند باز
چو سیصد هزار از یلان سترگگزیدم دلاور سپاهی بزرگ
گوِ پهلوان گفت چندین سپاهنباید، که دشخوار و دورست راه
مرا لشکری کازمون کرده‌امهمین بس که از زاول آورده‌ام
سپاهست و سازست و مردان مرددگر کار بختست روز نبرد
کی ِ نامور گفت کای جنگجویبدین لشکر آنجا شدن نیست روی
که دارد بهو گرد ریزنده خوندوباره هزاران هزاران فزون
به لشکر بود نام و نیروی شاهسپهبد چه باشد چه نبود سپاه
ز گنج آنچه باید همه بار کنگران لشکری را به خود یار کن
دل از دیری کار غمگین مدارتو نیکی طلب کن نه زودی ز کار
سپهبد کنارنگ گردان گردده و دو هزار از یلان برشمرد
گزیده همه کار دیده گوانسر هر هزاری یکی پهلوان
به هر صد سواری درفشی دگردگرگونه ساز و سلیح و سپر
وزآن نیزه‌داران زوال گروهبیاراست زیبا سپاهی چو کوه
کمند و کمان دادشان ساز جنگزره زیر و زافراز پرم پلنگ
ز بهر نشان بسته بر نیزه مویبه پولاد یک لخت پوشیده روی
هیون دو کوهه دگر شش‌هزارهمه بارشان آلت کارزار
زره گرد برخاست وز شهر جوشز مهره فغان وز تبیره خروش
برون شد سپاهی که بالاو شیببجنبید و دریا ببست از نهیب
سپاهی چو یکی درفشان سپهرکه باشد مرو را ز پولاد چهر
بروجش همه گونه‌گونه درفشستاره همه تیغ‌های بنفش
جهان گفتی از کرز و ز تیغ شدچو دریا زمین گرد چون میغ شد
سنان‌ها همی کرد در گرد تابچو آتش زبانه زبانه در آب
زبس خشت و جوشن که بُد در سپاهز بس ترگ زرّین چو تابنده ماه
هوا گفتی از عکس شد زرپوشزمین سیم شد پاک و آمد به جوش
چنین هر یکی همچو شیر یلههمی رفت و شد تا به شهر کله
به دریاست این شهر پیوسته بازگذرگاه کشتیست کآید فراز
چنان شد همه کار بد ساختهبه کشتی نشستند پرداخته
به شش ماهه یکساله ره برنوشتبی‌آزار و خّرم به خشکی گذشت
همان هفته کو رفت مهراج شاهز دست بهو جسته بُد با سپاه
یکی شهر بودش دلارام و خوشدرازا و پهناش فرسنگ شش
همی کرد کار دژ و باره راستسپه رابه‌شهر اندرون برد خواست
چو بشنید کآمد یل سرفرازبرون زد سراپرده و خیمه باز
همه لشکر و پیل و بالای خویشبه شادی پذیره فرستاد پیش
پیاده به دهلیز پرده سرایبیامد یکی چتر بر سر به پای
نشاندش بَر ِ خویش بر پیشگاهبپرسیدش از شاه وز رنج راه
نشستنگهش بُد سرا پرده هفتهمه گونه‌گون دبیه زَر بفت
درو شش ستون خیمه نیلگونز سیمش همه میخ و زر ستون
ز گوهر همه روی او چون سپهرستاره نگاریده و ماه و مهر
بگسترده فرشی ز دیبای چین برو پیکر هفت کشور زمین
یکی تخت پیروزه همرنگ نیل ز دو سوی ِ تخت ایستاده دو پیل
تن پیل یاقوت رخشان چو هورزبرجدش خرطوم و دندان بلور
ز درّ و ز بیجاده دو شیر زیرهمان تخت را پایه بر پشت شیر
فرازش یکی نغز طاووس نرطرازیده از گونه‌گونه گهر
به هر ساعتی کز شب و روز کمببودی شدی تخت جنبان ز هم
بجستندی آن نّره شیران به پایبه سر تخت برداشتندی ز جای
نهادی دو سه پیل زی شاه پییکی نقل دادی یکی جام می
گنیزی برون تاختی زیر تختبه باغی درون زیر زرّین درخت
به پای ایستادی و بُردی نماززدی چنگ و رفتی سوی تخت باز
ز بر پّر طاووس بفراختیبه بانگ آمدی، جلوه برساختی
ز دُم ریختی گرد کافور خشکز منقار یاقوت و از پَر مشک
درین بزمگه شادی آراستندمهانرا بخواندند و می خواستند
نمودند مهر و فزودند کامگزیدند باد و گرفتند جام
هوا شد ز بس دود عود آبنوسزمین چون لَب دلبران جای بوس
ز بس بلبله گونه گل گرفتبم و زیر آوای بلبل گرفت
به دست سیاهان می چون چراغهمی تافت چون لاله درچنگ زاغ
به خرمن فروریخت مهراج زربه خروار دینار و درّ و گهر
سراسر به گرشاسب و ایرانیانببخشید و آنکس که ارزانیان
یکی هفته زینسان به بزم شهیهمی کرد هر روز گنجی تهی
بپرسید گرشاسب کای شاه راستسپاه بهو چند و اکنون کجاست
بدو گفت مردان جنگیش پیشدوباره هزاران هزارند بیش
ده و شش هزارند پیل نبردکه برمه ز ماهی برآرند گرد
از آن زنده پیلان ده و دو هزارز من بستدش درگه کارزار
کنون با سپه کینه خواه آمدستبه نزدیک یک هفته راه آمدست
سپهدار گفتا چه سازی درنگبیارای رفتن پذیره به جنگ
نه نیکو بود بددلی شاه رانه بگذاشتن خوار بدخواه را
چو کشور شود پر ز بیداد و کینبود همچو بیماری اندوهگین
نباشد پزشکش کسی جز که شاهکه درمانش سازد به گنج و سپاه
من ایدر به پیکار و رزم آمدمنه از بهر شادی و بزم آمدم
چو بر هوش می‌خواره می چیر شدسران را سر از خرّمی زیر شد
جهان پهلوان مست با کام و نازبه لشکر گه خویشتن رفت باز
بدان سروران گفت مهراج شاهچه سازم که بس اندکست این سپاه
به هر یک ازیشان ز دشمن هزارهمانا بود گر بجویی شمار
بزرگانش گفتند کز بیش و کماگر بخت یاور بود نیست غم
گه رزم پیروزی از اختر استنه از گنج بسیار وز لشکر است
بس اندک سپاها که روز نبردز بسیار لشکر برآورد گرد
چو لشکر بود اندک و یار بختبه از بیکران لشکر و کار سخت
سپاهیست این کاسمان و زمینبترسد ز پیکارشان روز کین
کس این پهلوان را هم‌آورد نیستهمه لشکر او را یکی مرد نیست
به نوک سنان برگرد زنده پیلبه تیغ آتش آرد ز دریای نیل
به یک مرد گردد شکسته سپاههمیدونش یک مرد دارد نگاه
یکی مرد نیک از در کارزاربه جنگ اندرون به‌ز بد دل هزار
به صد لابه ضحاک ازو خواستستکه این مایه لشکر بیاراستست
وگرنه همی او ز گردان خویشفزون از هزاران نیاورد بیش
مر آن اژدها را به گردی و برزشنیدی که‌چون کوفت گردن به‌گرز
ببد شاد و مهراج لشکر بخاستبه یک هفته کار سپه کرد راست
برون برد لشکر چو بایست بردهمیدون برون شد سپهدار گرد
طلایه به پیش اندر ایرانیانبُنه از بس و لشکر اندر میان
سپهبد بَر ِ کوهی آمد فرود که بد مرغزار و نیستان و رود
دژم گشت مهراج کآمد فرازچنین گفت کآی گرد گردن‌فراز
درین بیشه بیش مگذار گامکه ببر بیان دارد آنجا کنام
دژ آگه ددی سهمگین منکرستبه زور و دل ازهر ددان برتراست
رمد شیر ازو هرکجا بگذردبه یک زخم پیل ژیان بشکرد
چنان داستان آمد از گفت شیرکه شاه ددانست ببر دلیر
گو پهلوان گفت شاید رواستکه دیریست تا جنگ ببرم هواست
هم اکنون به پیشت شکار آورمچو با گرز کین کارزار آورم
ندانی که شاه ددان سربه‌سربر شاه مردان ندارد هنر
بگفت این و با گرز و تیر و کمانسوی ببر جستن شد اندر زمان
بگشت آن همه مرغ و گند آب و نیندید از ددان هیچ جز داغی پی
چو روی خور از بیم شب زرد شدز گردون سر روز پر گرد شد
بیآمد سوی خیمه هنگام خوابز نادیدن ببر پُر خشم و تاب
خور از کُه چو بفراخت زرین کلاهشب از سر بینداخت شعر سیاه
سپاه از لب رود برداشتندچو یک نیمه زان بیشه بگذاشتند
غَوِ پیشرو خاست اندر زمانکه آمد به ره چار ببر دمان
سپهبد همی راند بر پیل راستچو دیدارشد اسپ‌و خفتان بخواست
به شبرنگ شولک درآورد پایگرایید با گرز گردی ز جای
بغرّید چون تندر اندر بهاربه کین روی بنهاد بر هر چهار
به پیش اندر آمد یکی تند ببرجهان‌چون‌درخش‌و‌خروشان چوابر
دو چشمش ز کین چشمه خون شدهز دنبال گردش به هامون شده
سر چنگ چون سفت الماس تیزچو سوزن همه موی پشت ازستیز
خمانیده دُم چون کمانی ز قیرهمه نوک دندان چو پیکان تیر
درافکنده بانگش به هامون مغاکزکفکش چوقطران شده روی خاک
ز دندان همی ریخت آتش به جنگز خارا همی کرد سوهان به چنگ
به یک پنجه ران تکاور ببردبزد بر زمین گردنش کرد خُرد
یکی گرز زد پهلوان بر سرشکه زیر زمین برد نیمی برش
به دیگر شد و زدش زخمی درشتچنان کش ز سینه برون برد پشت
سوم ببر تیز اندر آمد به خشم ز بس خشم چون لاله بگشاد چشم
به دستی گرفتش قفا یل فکنبه دستی کشیدش زبان از دهن
به زیر لگد پاک مغزش بریختچهارم دوان سوی بیشه گریخت
بینداخت گرز از پسش پهلوانشکستش دو پای و بر پهلوان
ز مغز ددان چون برآورد دودپیاده سوی بیشه بشتافت زود
دگر نیز بسیار جست و نیافتچو بشنید مهراج زآن‌سو شتافت
ببد خیره زان دست و زان دستبردگرفت آفرین بر سپهدار گرد
کشیدند نزدیک دشمن سپاهرسیدند هردو به یک روز راه
سپهبد بزد خیمه آمد فرودز هر سو طلایه برافکند زود
به نزد بهو نامه‌ای کین گذاربفرمود پرخشم و پر کار زار
دبیر از قلم ابر انقاس کردسخن دُرّ و اندیشه الماس کرد
درخت گل دانش از جوی مشکهمی کاشت بر دشت کافور خشک
نخست از جهان آفرین کرد یادکه دانای رازست و دارای داد
جهان زوست پرپیکر خوب‌و‌زشتروان را تن او داد و تن را سرشت
ز خورشید مر روز را مایه کردشب قیرگون خاک را سایه کرد
زمین بسته بر نقطه کار اوستتک چرخ بر پویه پرگار اوست
ز فرمانش بُد گیتی و هر چه خاستنبود و نباشد هر آنچ او نخواست
دگر گفت کاین نامه پندمندفرستاده شد هم به کین هم به پند
ز گرشاسب گرد جهان پهلوانسپهدار ایران و پشت گوان
به نزدیک آنکش خرد نیست بهربهو کاردار سرندیب شهر
تو ای زاغ چهر بداندیش سستهمی خویشتن را ندانی درست
بزرگی ترا شاه مهراج دادهم‌ اورنگ و هم‌چتر و هم‌تاج داد
کنون سر برآهختی از بند خویشبرون آمدی بر خداوند خویش
رهی تا نباشد بد و بد نژادخداوند را بد نخواهد زیاد
نه بس کت شهی داد و بودی رهیکزو نیز خواهی ربودن شهی
نهنگی تو کاندر نکو داشتنمکافا ندانی جز او باشتن
از و آن سزید از تو این بد که بودکه از مشک بوی آید از کاه دود
دوصد بار اگر مس به آتش درونگذاری ازو زر نیاید برون
کنون من بدان آمدم با سپاهکه آیی به درگاه مهراج شاه
به پوزش کنی بی‌گناهی درستهمان بنده باشی که بودی نخست
بیندازی این تیغ تندی ز دستبپیچی عنان از بلندی به پست
وگر نایی و کینه خواهی کنینباشی رهی طمع شاهی کنی
یکی شاه گردانمت تیره‌بختکه کرکس بود تاجت و دار تخت
ز بر سایت از سنگ باران کنمنثارت خدنگ سواران کنم
یکی جامه پوشمت بی‌پود و تارکه گردش بود پیکر و خون نگار
سپهر ار کند خویشتن مغفرتهمو نرهد از تیغ من هم سرت
یلانند با من که گاه ستیزبود نزدشان مرگ به از گریز
به شمشیر از پیشه شیر آورندبه پیکان مه از چرخ زیر آورند
نتابند روی از نبرد اندکیهزار از شما گرد و زیشان یکی
به جنگ شما خود نباید کسمکه من با شما پاک تنها بسم
زمانه بگردد ز من در نبرداز آن پیش کش گویم از راه گرد
کنون زین دو بگزین یکی ناگزیراگر بندگی کردن از دار و گیر
فرستاده و نامه هم در زمانفرستاد با هندوی ترجمان زبان
بهو نامه چون دید شد پر ستیززبان را به دشنام بگشاد تیز
سر ترجمان کند و بردار کردبه سیلی فرستاده را خوار کرد
بدو گفت مهراج را شو بگویدگر باره بازآمدی جنگجوی
به خورشید و دین بتان نخستبه گور و پی آدم و بوم رست
که بر خون برانم کت و افسرتبرم زی سرندیب بی‌تن سرت
همی لشکرانگیز از ایران کنیبه روبه همی جنگ شیران کنی
ببین بر سنان کرده سرشان کنونتن افکنده در پای پیلان نگون
ز گرشاسب گفتار دارم دریغزمن پاسخش نیست جز گرز و تیغ
فرسته شد و هرچه دید و شنیدنمود و بگفت آنچه بر وی رسید
سپهبد برآشفت و زد کوس جنگسپه راند تا نزد بدخواه تنگ
بدو گفت مهراج کآی سرفرازبمان تا سپه یکسر آرام فراز
یل نیو گفتا نباید سپاهتو بر تیغ کُه رو همی کن نگاه
دل و گرز و بازو مرا یار بسنخواهم جز ایزد نگهدار کس
به گردانش گفتا چه شد رزم تنگبدین گاو تازان نمایند جنگ
که ترسیدگانند گاه ستیزهمیشه ز خیل بهو در گریز
زنانند در پیش مردان مردبود اسپشان گاو روز نبرد
هم اندر بَر کُه رده برکشیدسزا جای ده پهلوان برگزید
سوی راست آذرشن و برزهمسوی چپ چو بهپور وارفش بهم
پس صف به مهیار و سنبان سپردکمینگه به گشواد و گرداب گرد
هژیر و گراهون ز زاول گروهستاند در قلب هریک چو کوه
بهو چون سپه دید کاشوفتندبفرمود تا کوس کین کوفتند
بُدش چار سالار چون چار دیوچو اجرا و میتر چو توپال و تیو
ز پیلان هزار از یلان صدهزاربه هریک سپرد از پی کارزار
کشیده شد از صف پیلان مستیکی باره ده میل پولاد بست
بجوشید هندو پس صفّ پیلچو دریای قیر از پس کوه نیل
هما همچو دیوان دوزخ سپاهبه دست آتش و تن چو دود سیاه
چهره چو انگشت هر یک به رنگ ولیکن به تیزی چو آتش به جنگ
ز بس هندو انبوه چون خیل زاغزبس‌ خشت‌ و خنجر چو رخشان‌ چراغ
یکی بیشه بُد گفتی از آبنوسهمه شاخش الماس و بر سندروس
دلیران ایران برون تاختندجدا هر یکی جنگ برخاستند
ز یک دست بهپور و اجرا به همز دست دگر میتر و برزهم
میان اندرون ارفش شیرفشسوی تیو و توپال شد کینه کش
برآمد ده و افکن و گیر و روغریویدن کوس پیکار و غو 
تف نعل اسپان زمین برفروختبه دریا سنان چشم ماهی بسوخت
هوا پرّ طاووس گشت از درفششد از ترگ و از تیغ هامون بنفش
دم نای برخاست چون رستخیزسنان مرگ اسوده را گفت خیز
قضا با سر نیزه انباز گشتنهنگ بلا را دهن بازگشت
شل و خشت پرواز شاهین گرفتزباران خون کوه و در هین گرفت
زمین همچو دریا شد از جوش مردکه موجش همه خون بُد و میغ گرد
درو مرگ همچون نهنگ دژمهمی جان کشید از دلیران به دم
زصندوق پیل ازبس آتش که ریختتو گفتی همی ابر بیجاده بیخت
ز هرسو به گرداب خون شد همیندانست گردون که چون شد همی
سپهبد همان چرخ و تیرش بخواستکه پیش از پی اژدها کرد راست
بیفکند ده تیر از آن هم به جایبه هر تیر پیلی فکند او ز پای
برانگیخت پس چرمه گرم خیزبیفکند در هندوان رستخیز
به خنجر ز سرها همی ریخت ترگچو باد خزان ریزد از شاخ برگ
ز تیغش همی لعل شد باد و گردزگرزش همی پخش شد اسپ‌ومرد
کمندش چو کشتی به کین خم شمرشدی هر خمش گرد ده تن کمر
کجا گرزش از دست رسته شدیسه تن کشته و چار خسته شدی
به زخمی کجا نیزه برگاشتیزدی بر یکی بر سه بگذاشتی
چهل اسپ برگستوان دار بودکه بر هر یکش رزم و پیکار بود
بر آن هر چهل نعل فرسوده شدنه سیر او ز کوشش نه آسوده شد
سرانجام در رزم آن رزم جویهمه مانده بودند و آسوده اوی
به هر هندوی کو ربودی ز زینبه هر پیل کافکندی از خشم و کین
غو لشکر و کوس مهراج شاهرسیدی از آن کوه بر چرخ ماه
درآمد دمان زنده پیلی دژمچو تند اژدها داده خرطوم خم
برآویخت با پهلوان دلیردرآورد خرطوم در گرد شیر
بکوشید کش بررباید ز زیننجنبید بر زین سوار گزین
برآهیخت خرطوم پیل از زرهبپیچید چون رشته برزد گره
به‌گرزش چنان‌کوفت زخمی‌درشتکش اندر شکم ریخت مهره زپشت
بر آن لشکر از کین ببارید مرگهمی کوفت گرزوهمی کافت ترگ
گهی ریخت خون وگه انگیخت گردگهی خست پیل و گهی کشت مرد
ربود آن سپه را ز بالا و پستبه پرده‌سرای بهو برشکست
به یک حمله صد پیل برهم فکندبه نیزه چهل خیمه از بُن بکند
ز گرشاسب نزد بهو شد خبرکه تنها سپه کرد زیر و زبر
برون شد بهو دید هر سو گریزچپ و راست برخاسته رستخیز
هوا جای خاک و زمین جای خونرمان زنده پیلان و گردان نگون
چه مردست گفت این هنرمند گردهنرهاش گفتند نتوان شمرد
یکی کودک نو رسیدست زوشهنوزش نگشتست گل مشک پوش
تن پیل دارد، میان پلنگدل و زَهره شیر و سهم نهنگ
به هر تیر پیلی همی بفکندبه هر حمله‌ای لشکری بشکند
بیامد کنون تا سراپرده تفتیلان را همه کشت و افکند و رفت
ز تیرش یکی پیش او تاختندز خشتی گران باز نشناختند
بسی گرد خشت افکن آمد به پیشکش آن را ز ده گام نفکند بیش
بهو گشت ترسان و پیدا نکردچنین گفت کامروز بُد باد و گرد
از ایرانیان کس نشد چیر دستکه بر ما ز پیلان ما بُد شکست
ره رزم فردا دگرگون کنیمسپه پیش پیلان به بیرون کنیم
عروس سپهری چو کرد آشکاررخ از کله سبز گوهر نگار
پدید آمدش تاج سیمین ز خمشبش ریخت بر تاج مشک و درم
ز جنگ آرمیدند هر دو گروهطلایه همی گشت بر دشت و کوه
چو گرشاسب شد نزد مهراج شاهنشاندش به بزم از بر پیشگاه
به هر حمله کانگیخته بُد ز جوشبه شادیش جامی همی کرد نوش
بسی فرش‌ها دادش از رنگ رنگسراپرده و خیمهای پلنگ
به برگستوان زنده پیلی سپیدبرو تختی از زر چو تابنده شید
سه مغفر ز زر چون مه از روشنیبه زر صد پرند آورد روهنی
هم از گرز و خفتان و خود و زرهدوصد جوشن ناگشاده گره
به ایرانیان هر که بودند نیزبسی داد دینار و دیبا و چیز
رسید آن شبش لشکری بی‌شمارابازنده پیلان همی شش هزار
بدو پهلوان گفت چندین سپاهچو باید که بر دشت و کُه نیز راه
چنین گفت مهراج کای سرفرازهنوز این سپه چیست کآمد فراز
هزاران هزار از دلیران جنگهمی لشکرم یاور آید ز زنگ
سپهدار گفتش بدین تاختنچا باید سپاس سپه ساختن
شود کشورت پاک زیر و زبرنه گنجت بماند نه بوم و نه بر
چو کاری برآید بی‌اندوه و رنجچه باید ترا رنج و پرداخت گنج
به مژده نوندی برافکن به راهکه ما چیره گشتیم بر کینه‌خواه
وزین زنده پیلان و چندین گروهیکی لشکر از بهر نام و شکوه
گزین کن دلیران رزم‌آزمایفرست آن سپاه دگر باز جای
که من هرچه تو کام و رای آوریبرآرم نخواهم ز کس یاوری
چنان کرد مهراج کاو رای دیدکه رایش سپهر دل‌آرای دید
چو پنجه هزار آزموده سوارگزید و دو سالار و پیلی هزار
گُسی کرد دیگر سپه هر چه داشتهمه زنگیان را ز ره بازگاشت
وزآن سو شد آگه بهو از نهانکز انبوه زنگی سیه شد جهان
برادرش را با پسر همچو دودفرستاد سوی سرندیب زود
بدان تا علف و آنچه آید به کارهم از کنده و ساز جنگ و حصار
بسازند تا گر در آن رزمگاهشکسته شود شهر گیرد پناه
سه روز اندرین کارها شد درنگکس از هر دولشکر نزد رای جنگ
چهارم چو برزد خور از کُه درفشزمین گشت ازو زرد و گردون بنفش
بهو چهل‌هزار از دلیران گردبه سالار تیو سپه کش سپرد
هم از زنده پیلان هزار و دویستبدو گفت برکش صف کین بایست
هزار دگر پیل پولاد پوشابا چل‌هزار از یل رزم کوش
به تو پال بسپرد گرد سترگبفرمود تا کوفت کوس بزرگ
دو سالار ازینگونه برخاستندچپ و راست لشکر بیاراستند
خروش یلان و دم کره نایچنان شد که چرخ اندر آمد ز جای
سپهبد چو دید آن خروش سپاهسبک خواست خفتان و رومی کلاه
به مهراج گفت از سپاه تو کسمیار از سر کُه تومی و بس
بهر تیغ کُه دیده‌بان برگماشتبه هامون سپه صف کشیده بداشت
سوی راست لشکر به مهیار دادسوی چپ به بهپور سالار داد
بفرمود کاذرشن و بُرزَهمبسازند جنگ و طلایه به هم
کمین داد سنبان و گرداب راکه کردندی از کینه گرداب را
نگهبان سه لشکر سه گرد دلیرهژیر و گراهون و نشواد شیر
به قلب اندرون هر که بُد زاولیپس پشتشان ارفش کاولی
به هر سو که دو گرد کین ساز بودمیانشان یکی آتش انداز بود
چنان بر صف پیل بگشاد جایکه گر کس گریزد بکوبد بپای
جدا هر صفی هم بر بدگمانصفی همچو تیر و صفی چون کمان
کمند افکنان از پس خیل خویشبه تیغ‌و‌زره نیزه‌داران زپیش‌
پیاده سپر در سپر آخته خدنگ‌ افکن ‌از پس کمین‌ ساخته
به هر سو نگهبانی از بهر کینبه هر گوشه‌ای جنگیی در کمین
سوار اندر آمد شدن کین گزارپیاده به قلب اندرون پایدار
چو شیر زیان پهلوان پیش صفدرفش از پس پشت و خنجر به‌کف
تو گفتی سمندش کُه آهنستو گر گرد پاش ابر هامون کنست
همان اژدها فش درفش سیاههمی درکشد گفتی از چرخ ماه
ستاده به پیش گو شیر دلبه بر گستوان اسپ جنگی چهل
دلیران به جنگ اندر آویختندبه هر گوشه گردی برانگیختند
غو های‌وهوی از دو لشکر بخاستجهان پردها ده شد از چپ‌وراست
بغرید بر کوس چرم هژبردم نای رویین برآمد به ابر
پُر از اژدها گشت گردون ز گردپُر از شیر هامون ز مردان مرد
کمند سواران سرآویز شدپرند آوران ابر خونریز شد
چنان تف خنجر جهان برفروختکه برچرخ ازو گاو و ماهی بسوخت
به دریا رسید از تف تیغ تاب به کُه سنگ آتش شد و آهن آب
 جهان آینه جوش جوشن گرفتزمین گونه روی روشن گرفت
چکاکاک خنجر به گردون رسیدز هندوستان خون به جیحون رسید
هر ایرانیی در کمند و کمینکشیدی همی هندوی بر زمین
تو گفتی که شیرند در کارزارهمی دیو گیرند هر یک به مار
چو پیکار ایرانیان شد درشتیل پهلوان اندر آمد به پشت
به تو پال و پیلان و هندو گروهنهاد از کمین سر چو یکپاره کوه
به‌تیر و به‌خشت و به‌گرز و به‌تیغهمی ریخت پولاد چون ژاله میغ
کجا گرز کین کوفت کُه غار شدکجا نیزه زد عیبه گلنار شد
زتیغش همی دشت و گردون به‌تفتز بانگش همی کوه‌ و هامون به کف
چوشد یک زمان دشت‌ و‌ پست‌ و‌ بلندهمه دست و پای و تن و سر فکند
به نوک سنان پیل برداشتیسپاهی به یک حمله برگاشتی
صف زنده پیلان همه کرد پستسوار و پیاده به هم در شکست
همی پیل بر پیل جنگی فتادچو کشتی که بر کشتی افتد
چو توپال دید آن دم رستخیزز باد ز یک تن جهانی سپه در گریز
برانگیخت گلرنگ رزم از میانبزد نیزه بر پهلوی پهلوان
سنان زخم ناورد و شد نیزه خُردبه تیغ اندر آمد سپهدار گرد
چنان زدش بر سر که شد سرنشیبسر و ترگ بگذاشتن تا رکیب
به زخمی دونیمه شد از خشم‌ و‌ زورز بالا سوار و ز پهنا ستور
به دیگر سپه خنجر اندر نهادز هر سو سپاهی به خون در نهاد
همی میمنه کوفت بر میسرهدر افکند پیش آن سپه یکسره
نگه کرد از دور سالار تیوگریزان سپه دید بی‌هوش و تیو
سواران به زیر پی پیل خوارپیاده نگون زیر نعل سوار
نهاد از کمین سر که سالار بودعمودش ز پولاد بالار بود
همی تاخت هر سو ز پیش سپاهگزیدندگان را همی بست راه
سپه را چنین پنج ره باز گاشتبه صد چاره بر جایگهشان بداشت
همی گفت ازینسان سپاهی به جنگز یک تن گریزان ندارید ننگ
ز ضحاک جز جادوی پیشه چیستهمین رزم ایرانیان جادویست
ز سر گرد کین‌شان برآید پاکوزین جادوی‌ها مدارید باک
گرفتند پاسخ همه تن به تنکزین یک سوارست بر ما شکن
نبینی کزو کشته را جای نیستبَر زخم او پیل را پای نیست
ز خنجر به زخم آتش آرد همیز گرز گران کوه بارد همی
همان گرد گردنکش اجرا به نامکه از شیر جستی به شمشیر کام
ببد تند و گفت این چه آشفتنستز یک تن چه چندین سخن گفتنست
من اکنون روم سوی آورد اوهم از خونش بنشانم این گرد او
سبک باره با باد انباز کردبه ایرانیان آمد آواز کرد
که این زاولی پیشروتان کجاستسپهبد چو بشنید زود اسپ خواست
ز دریای کوشش چو موج دمانبرانگیخت شبرنگ را در زمان
هم ازرهش گرزی چنان زد‌به زورکه گم شد سرش در سرین ستور
دگر ره ز کین رای آویز کردسبک خیز شبدیز را تیز کرد
برافکند بر هندوان تن ز کینبه یک حمله سی گرد زد بر زمین
همی گفت آگه نه ‌اید ای سپاهکه چون رویتان روزتان شد سیاه
نهاد از کمینگه سر آن اژدهاکزو پیل جنگی نباید رها
برآمد ز دریای کین آن نهنگکه برباید از شیر دندان و چنگ
گرفت آن دمان آتش افروختنکه گیتی به رنج آمد از سوختن
ز ریگ از فزون مرشما را شمارز خونتان برم تا بخارا بخار
همی گفت ازینسان و از خشم‌ و کیننهاده یکی پای بر پشت زین
همه هندوان دل شکسته شدندبه جان و دل از بیم خسته شدند
نیارست با او کس آویختننه از پشتش از ننگ بگریختن
بود تن قوی تا بود دل بجایچو ترسید دل سست شد دست‌وپای
گوی بُد ورا نام بیکاو بودسنانش اژدها را جگر کاو بود
بدو گفت تیو این هنر کار تستترا شاید این نام و این رزم جست
به هندوستان نیست همتای تونگیرد به مردی کسی جای تو
بخندید بیکاو گفت این مبادکز آغالش تو دهم سر به باد
ز پیکار بد دل هراسان بودبه نظاره بر جنگ آسان بود
ز بهر تو جان من این بیش نیستکس اندر جهان دشمن خویش نیست
شدن سوی جنگ کسی کز تو بیشبود مرگ را باز رفتن ز پیش
نگه داشتن سر گه نام و لافاز آن به که دادن به باد از گزاف
چون دشمن کشم نام و کام آیدمچو سر خیره بدهم چه نام آیدم
شد آشفته دل تیو گفت ار به جنگدلت نیست خنجر چه داری به چنگ
ز مرگ ار بترسی بنه تیغ و ترگکه جنگ او کند کو نترسد ز مرگ
ازین زاولی غم چه آید مراکه او گاه کین بنده شاید مرا
چو اسپ اندر افراز و شیب افکنمچو او من به زخم رکیب افکنم
تو رو چون زنان پنبه و دوک گیرچه داری به کف خنجر و گرز و تیر
بگفت این و پس پور کین باد کردسبک دست زی گرز پولاد کرد
به ناورد گِرد سپهبد بگشتسپهبد به حمله بدرید دشت
برانگیخت آن باره آتشیبه کف آهنین نیزه سی رشی
زدش بر کمربند و خفتان و گبربر آوردش از کوهه زین به ابر
بسان درفشی بر افراختشبه پیش صفِ هندوان تاختش
پس از نوک نیزه به زخمی درشتزدش بر دو تن هر سه تن را بکشت
دگر ره میانشان تن اندر فکندبه هر گوشه خیلی به هم بر فکند
ز خنجر چو آتش بر انگیخت جوشز خون دشت کُه کرد مصقول پوش
به گرز و سنان زاسپ وز مرد و پیلهمی کشته افکند بیش از دو میل
چنین تا به نزد بهوشان ز جایهمی برد و بر زد به پرده سرای
بیامد بهو دید هر سو شکستکز ایران سپه خیمها گشته پست
چنین گفت کاین رستخیز از کجاستچنین بیم از اندک سپه تان چراست
نشان داد هر کس که ما را شکوهازین یک سوارست کاید چو کوه
به نیزه رباید همی زاسپ مردبرآرد ز گرز از سر پیل گرد
بهو گفت کز دوزخ اهریمنستشما صد هزارید و او یک تنست
جدا هر یکی گر یکی مشت خاکبرو برفشانید گردد هلاک
ندارید شرم و نه ننگ اندکیگریزید چندین هزار از یکی
از آسوده گردان خنجر گزاربه هم حمله کردند چون سی هزار
سپهبد خروشی چو شیر ژیانبرآورد و زد اسپ کین در میان
بدان ترگ ها بر همی کوفت گرزچو سنگ گران آید از کوه برز
ز گرزش دل خاره خون شد همیسران از سنانش نگون شد همی
کجا خنجر از زخم بفراختیبر الماس آب بقم تاختی
ز ناگاه بیکاو گرد دلیردرآمد یکی تند شولک به زیر
زدش خشتی از گرد چون برق تیزنبد کارگر جست راه گریز
سپهبد برانگیخت شبرنگ زودگرفتش کمربند و از زین ربود
برافکندش از بر به بالای میغچو برگشت دو نیمه کردش به تیغ
پس از کین برافکند تن بر همهرمان کردشان هر سویی چون رمه
پلنگینه پوشان زاول به کینپسش برگشادند ناگه کمین
به یکبار بر قلب لشکر زدندربودندشان بر بهو برزدند
فکندند چندان سران سرنگونکه هر شیب چون فرغری شد ز خون
ز بس کشته هندو زمین شد سیاهچو زاغان فکنده به بیراه و راه
درخشان ز تن خشت افروختهچنان کآتش از هیزم سوخته
چنین جنگ بد تا شب آمد فرازچو شب تنگ شد جنگ چیدند باز 
شده شاد مهراج بر تیغ کوههمی هر زمان نعره زد با گروه
فرستاد نزد سپهدار کسکه آمد شب از جنگ و پیکار بس
جهان گرم و دشمن چنین بیکرانتو در رزم سخت و سلیحت گران
زمانی برآسای از آویختنکه گیتی سرآمد ز خون ریختن
به هر جنگ بخت تو پیروز بادشب دشمنان تو بی روز باد
به خواهش مهان نیز بشتافتندعنانش از ره رزم برتافتند
چو خورشید در قار زد شعر زردگهربفت شد بیرم لاجورد
ستاره چو گل گشت و گردون چو باغچو پروانه پروین و مه چون چراغ
از آن لشکر هندوان هر که زیستهمی خسته و کشته را خون گریست
به هر خیمه شیون بد آراستههمه ناله خستگان خاسته
همه شب تن خسته را دوختندبر آتش همی کشته را سوختند
کشیدند در پیش باره ز پیلطلایه پراکنده شد بر دو میل
بهو خیره دل ماند از بس شگفتگه انگشت و گه لب به دندان گرفت
همی گفت از ینسان برو بوم و گاهبه دست آمده گنج و چندین سپاه
بر و پُشت باید همی گاشتنبه بدخواه ناکام بگذاشتن
به دینار هر چیز و تیمار سختتوان یافت جز زندگانی و بخت
دریغ این همه گنج و رنج و نهادکه گنجم همه خاک شد رنج باد
ز کردار این کودک نو رسیدندانم دگر تا چه خواهم کشید
همان به که با او درنگ آورمبه شیرین سخن بند و رنگ آورم
به گنج و به دختر نویدش دهمبه شاهی و کشور امیدش دهم
مگر سر بدین چاره از چنبرشکنم دور و در چنبر آرم سرش
جوان هم سبکسر بود خویش کامسبکسر سبکتر درافتد به دام
به چیزی فریبد دل آویزترکه باشد نیازش بدان بیشتر
نباشد سوی چینه آهنگ بازنه تیهو سوی گوشت آید فراز
جوان را ره و رای گردان بوددلش بردن از راه آسان بود
ز بدخواه وز دشمن کینه کشتوان دوست کردن به گفتار خوش
بسا کس که یکدانگ ندهد به تیغچه خوش گوییش جان ندارد دریغ
به گفتار شیرین فریبنده مردکند آنچه نتوان به شمشیر کرد
همه شب چنین جفتِ اندوه بوداز اندیشه بر جانش انبوه بود
چو برگشت گرشاسب از آوردگاهپذیره شدش زود مهراج شاه
جهان دید کوبان سمندش به نعلبر و بازوی و تیغ و خفتانش لعل
ز خون جگر بسته بر دیده چونگشاده چو اکحل رگ از نیزه خون
بسی آفرین خواند از ایزد برویگهش دست بوسید و گه چشم و روی
به خوان یکسر ایرانیان را نشاندبر ایشان بسی زر و گوهر فشاند
همی گفت در کوشش و دار و بردجز ایرانیان را نزیبد نبرد
باستاد و مر پهلوان را شناختچونان خورده شد بزم شادی بساخت
سپهدار و مهراج فرخنده پیگرفتند با سروران جام می
نخست از شهنشاه کردند یادپس آنگه نشستند در بزم شاد
سپهبد بر اورنگ و دل شادکامبه پیش اندرون گرز و بر دست جام
تو با تیغ گفتی به رزم اندرستبه با جام شادی به بزم اندرست
چو آسود با می به مهراج گفتکه با دل زدم رای اندر نهفت
ز دشمن سپه بیشمارند پیشز ما هر یک ایشان هزارند بیش
چنانیم ما پیششان روز کینچنان چشمه در پیش دریای چین
اگر دست کشتن برم روز کاربسی بایدم رنج و هم روزگار
دگر ره ز چرخ ار بود یار بختبر آراست خواهم یکی رزم سخت
میان بهو تا به خم کمندنیارم نپیچم عنان سمند
پناه سپه شاه نیک اخترستچو شه شد سپه چو تن بی سرست
گرامی همیشه به بویست مشکچو شد بوی چه مشک و چه خاک خشک
چنین گفت مهراج کز سرورانبه نزد بهو زین سپاه گران
همین چار سالار بودند گردکه بنمودی از تیغشان دستبرد
ز خویشانش ماندست گردی گزینخداوند کوس و درفش و نگین
دلیری کجا نام او مبترستبه رزم از گشن لشکری بهترست
به تو دیده امروز بنهاده بودبه کین در کمین گاهت استاده بود
همی خواستم کت بود پیش بازنبد کش زمانه نیامد فراز
سوی اوست پاک آن سپه را پناهگرو کم شود ، شد شکسته سپاه
سپهدار گفتا دگر ره ز کوههمی جویش اندر میان گروه
نمایش به من در کمینگاه توسرش بی تن آن گه ز من خواه تو
چنان شادی افزود مهراج راکه بگذاشت از اوج مه تاج را
همان شب ز شادی که افکنده پیهمی جز به یادش ننوشید می
یکی باغ زرّین بُدش پیش تختز گوهرش بار از زبرجد درخت
در آن نغز باغ آبگیری گلابز دُر سنگ و ریگش همه مشک ناب
مر آنرا به گرد سپهدار دادجز آن چیزش از گنج بسیار داد
چه مخمل چه شاره چه خز و حریرچه دینار و دیبا چه مشک و عبیر
هزارش سراپردهء گونه گونهمی دادش از بهر نام و شگون
هزارش سپر داد مدهون کرگچهل اسپ جنگی و صد درع و ترگ
سراپرده چینی از زرّ بفتز دیبا شراعی نود خیمه هفت
یکی خسروی شاروان گونه گوندرازاش میدان اسپی فزون
دو خرگه نمد خزّ و چوبش ز زرهمه بندشان شوشهای گهر
ز بیجاده تاجی چو رخشنده هورپر از درّ و گوهر سه جام بلور
همیدون به ایرانیان هر کسیببخشید دینار و گوهر بسی
چنین تا دو پاس از شب اندر گذشتببودند دلشاد و خرّم به دشت
چو زی خوابگه شد یل نامداربیامد همان گه نگهبان بار
که آمد فرستاده ای گاه شامز نزد بهو زی تو دارد پیام
بسی پند و رازست گوید نهفتکه با پهلوان باید امشب بگفت
بخواندش سپهدار پیروز بختفرستاده آمد سبک پیش تخت
کمان کرد بالا و گفتار تیربخواند آفرین بر یل گردگیر
که تا جاودان پهلوان زنده بادزمانه رهی اخترش بنده باد
ز شاه بهو هست پیغام چنداز امید و سوگند و پیوند و پند
گزارم چو فرمان دهد پهلواندگر کس نداند جز از ترجمان
سپهبد ز مردم تهی ماند جایفرستاده بر جست خندان بپای
چنین گفت کای افسر انجمندبیر شهم منکوا نام من
بهو شاه قنوّج و رای بریندرودت فرستاد و چند آفرین
همی گوید از فرّ و فرهنگ تونزیبد به جنگ من آهنگ تو
نه هرگز به جایت بدی کرده امنه شاه جهان را بیازرده ام
ترا با من این شورش کار چیستز بهر کسان جنگ و پیکار چیست
کسی کز بدش بر تو نامد گزندچو با او کنی بد نباشد پسند
نه هر کش بود چنگ بر جنگ تیزبود با همه کس به جنگ و ستیز
به هر باد خرمن نشاید فشاندنه کشتی توان نیز بر خشک راند
اگر از پیِ باژ شاه آمدیبه فرمان او کینه خواه آمدی
ببین هدیه و باژ کز گنج خویشچه دادست مهراج هر سال پیش
سه چندان دهم من به فرمانبریدگر خلعت و هدیه ها بر سری
وگر طمع داری به شاهی و گنجز من یابی این هر دو بی بیم و رنج
گر آیی برم با سپاه از نخستبه پیمان و سوگندهای درست
سپارم به تو گنج و هم دخترمبر اورنگ بنشانمت همبرم
گِرم تخت مهراج و بُرّم سرشببخشم به تو گنج و هم افسرش
از آن پس سپه سوی ایران برمبه کین تاختن های شیران برم
کنم جایِ ضحاکِ جادو تهیگرم هفت کشور به شاهنشهی
ازین هرچه گفتم ز گنج و سپاهز فرمان و از کشور و تاج و گاه
همه مر ترا باشد از چیز و کسمرا نام شاهنشهی بهره بس
به سوگند و پیمان ابا منکوافرستادم اینک خط من گوا
چو یابد خردمند خوبی و گنجبیندازد از دست و نارد به رنج
چو آهو و خرگوش یابد عقابنیارد به درّاج و تیهو شتاب
همی تا سمورست و سنجاب چیننپوشد ز ریکاشه کس پوستین
بگفت این و آن خطّ و پیمان بدادببوسید پیش سپهبد نهاد
سپهبد ز خشم دل آشفت و گفتکه هوش و خرد با بهو نیست جفت
بگویش سخن پیش ازین در ستیزنگفتی همی جز به شمشیر تیز
کنون کت ز گرز من آمد نهیبگرفتی ز سوگند راه فریب
کسی کو نترسد ز یزدان پاکمر او را ز سوگند و پیمان چه باک
ندانی که در دام آن اژدهابماندی که هرگز نیابی رها
به گرداب ژرف اندر از ناگهانفتادی و آبت گذشت از دهان
نگونسار گشتی به چاهی درازکه هرگز نیایی ازو بر فراز
تنت یافت آماس و تو ز ابلهیهمی گیری آماس را فربهی
همی چاره سازی که من هند و چینسپارم به چنگت نخواهد بُد این
کفی خاک ندهم که بر سر کنینه نیز آب چندانکه لب تر کنی
زمین چون گِری هفت کشور به زورکه چندان نیابی که با شدت گور
دهم گنج و جاهت به دیگر کسانبرد گرگ دل دیده ات کرکسان
بدین خیره گفتارهای تباهنگیری مرا دام برچین ز راه
به من تاج و تخت شهی چون دهیکه هست از تو خود تخت شاهی تهی
یکی را به دِه در ندادند جایهمی گفت بر ده منم کد خدای
بمرد اشتر ابلهی در رمهبه درویش دادمش گفتا همه
به دامادی چون تو دارم امیدکجا ساخت هرگز سیه با سپید
به هم چون بود مهر و کین گاه جنگابا آبگینه کجا ساخت سنگ
که جوید به نیکی ز بدخواه راهبه دیوار ویران که گیرد پناه
نباشد دل هندو از حیله پاکنه نیز از سیه رویی آیدش باک
ز کژران رَهِ راست هرگز نخاستنه کس دُم روباه دیدست راست
بپوسیده وز هم گسسته رسنهمی زیر چاهم فرستی به فن
همانا گمانی که من کودکمبه دانش چنان چون به سال اندکم
همی بازگیری به دام چکاوببینی کنون خنجر مغز کاو
تو شاه جهان را بیاشفته ایفراوان مرو را بدی گفته ای
مرا گفت رو با تو پیکار منبگیرش نگون زنده بر دار کن
تو ایدون فرستی بَرِ من پیامفریبنده گشتی به نیرنگ خام
گمانی که من چون توام ناسپاسچو گرگ دژآگاه ناحق شناس
که بر مهتر خویش بدساختیهمه گنج و گاهش برانداختی
به زنهار شه گر بیایی کنونبه خواهش بخواهم ترا زو به خون
و گر جز بر این رای رانی سخنبدان کآمدت روز و روزی به بن
ترا زین همه شاهی و گیر و دارنخواهد بُدن بهره جز تیر و دار
فرستاده بشنید پیغام و رفتسپهبد بشد نزد مهراج تفت
بگفتش هر آنچ از فرسته شنودهمان راز نامه مرو را نمود
چو بشنید مهراج دلتنگ شداز اندیشه رویش پر از رنگ شد
به دل گفتم ترسم که از بهر چیزبگردد به دشمن سپاردم نیز
شبان سیر باید وگرنه به کینمهین گوسفندی زند بر زمین
خوی هر کسی در نهان آشکاربگردد چو گردد همی روزگار
بَرد خواسته هر کسی را ز راهکند دوست را دشمن کینه خواه
چنین گفت کای گرد بیدار دلبگفتِ بهو خیره مسپار دل
پذیرد به گفتار صد چیز مردکه نتوان یکی ز آن به کردار کرد
دو صد گنج شاید به گفتار دادکه نتوان یکی زان به کردار داد
بپذرفتن چیز و گفتار خوشمباش ایمن از دشمن کینه کش
به گفتار غول آدمی را ز راهبه خوشی فریبد کند پس تباه
نیاید ز دشمن به دل دوستیاگر چند با او ز هم پوستی
اگر کشور و گنج بایدت جستهمه کشور و کنج من ز آنِ تست
هم از کان یاقوت و دریای دُرهمی گنج من هست آکنده پُر
هر آنچ از بهو کام داری و رایسه چندانت پیش من آید به جای
زدن چوب سخت از یکی دوستداربه از بوسه دشمن زشت کار
کشیدی غم و یافتی کام خویشمکن زشت نام شه و نام خویش
سپهبد لب از خنده بگشاد و گفتکزین غم مکن با دل اندیشه جفت
من از بیشه با شیر کوشم همیبر آتش بوم خار پوشم همی
نهم دیده در پای پیل ژیاننپیچم سر از رای شاه جهان
بَرِ ما چه برگشتن از شاهِ خویشچه برگشتن از راه یزدان و کیش
به سر مر مرا تاج فرمان تستبه گردن دَرم طوق پیمان تست
سپاس ترا چاکرم تا زیمبه دیده روم هر کجا تازیم
غم آن کسی خوردن آیین بودکه او بر غمت نیز غمگین بود
ز چاهی که خوردی از و آب پاکنشاید فکندن در و سنگ و خاک
دلش را به هر خوبی آرام دادشد و بود با کام تا بامداد
همان شب گراهون گردن فرازز تاراج با خیلی آمد فراز
تنی هفتصد بیش برنا و پیربه هم کرده از هندوان دستگیر
به چنگال هر یک سری پر ز خونسری دیگر از گردن اندر نگون
ازین تازش آگه نبد پهلوانچو گشت آگه آشفته شد برگوان
که چندین سپه پیش و کین آختنشما را چه کارست بر تاختن
پس از ناگهان دشمن آید به جنگهمه نامها بازگردد به ننگ
ز بیرون لشکرگه ار نیز پاینهد کس نبیند جز از دار جای
پس آن بستگان را هم از گرد راهفرستاد نزدیک مهراج شاه
و ز آن سو بهو چون فرسته رسیدغمی گشت کآن زشت پاسخ شنید
بی اندازه کرد از سران انجمنچنین گفت با هر که بُد رای زن
که از دوزخ اهریمن آهنگ ماگرفت و سپه ساخت بر جنگ ما
بماندیم در کام شیر نژندفتادیم با دیو در دست بند
اگر چند با ما بسی لشکرستازین زاولی رنج ما بی مرست
پذیرفتمش دخت و بسیار چیزهمان کشور و گنج و دینار نیز
به دل طمع دینار نارد همیهمه تخم پیکار کارد همی
کنون از شما هر که از بهر ناممرین زاولی را سرآرد به دام
بود او سپهدار و داماد منننازد مگر زو دل شاد من
سبک زان میان مبتر بد نژادبرآمد به پای و زمین بوسه داد
به آواز گفت ای شه نامجویز یکتن چه چندین بود گفت و گوی
چو خور برکشد تیغ زرّین به گاهبه خم در شود تاج سیمین ماه
من و دشت ناورد و این زاولیبه کف تیغ و زی را برش کاولی
نپیچم عنان زو نه از لشکرش مگر بر سنان پیشت آرم سرش
همی گفت و مرگ از نهان در ستیزهمی کرد بر جانش چنگال تیز
همه شب برین روی راندند رایگه روز شد هر کسی باز جای
ز شبدیز چون شب بیفتاد پستبرون شدش چوگان سیمین ز دست
بزد روز بر چرمه تیز پویبه میدان پیروزه زرّینه گوی
بشد مبتر از کینه تیغ آختهبه پیش بهو رزم را ساخته
چنین گفت کامروز روز منستکه بخت تو شه دلفروز منست
کنون آن گه آرم ز زین باز پایکز ایرانیان کس نماند به جای
زره پوش و بر گستوان دار گرددو ره صد هزار از یلان بر شمرد
دگر شش هزار از سیه زنده پیلگزین کرد و صف ساخت بر چند میل
برآمد دم مهره گاو دمشد از گرد گردان خور و ماه گم
بر پهلوان شاه مهراج زودفرستاد کس مبتر او را نمود
که آن که به قلب ایستاده چو شیربه کف تیغ تیزا ، برش تند زیر
زده هم برش گاو پیکر درفشسپر زرد و بر گستوانش بنفش
زره زیر و خفتانش از بر کبودز پولاد ساعدش و از زرّ خود
ز بر گستوانش همه قلبگاهز بس آینه چون درفشنده ماه
به گردش ز گردان گروهی گزینزره بر تن و خود در پیش زین
سپرها در آورده ز آهن به رویچو ترگ از بر سر گره کرده موی
سپهبد همی ساخت کار سپاهنهانی همی داشت او را نگاه
دو دیده برو زان سپه یکسرهنهاده چو گرگ از کمین بر بره
از ایرانیان بر دل نامدارنبد غم که بُد جای جنگ استوار
سوی چپشان بیشه انبوه بودسوی راست رود و ز پس کوه بود
بفرمود تا هندوان کس ز جایز پایان کُه پیش ننهند پای
لب بیشه و رود هر سو ز کینبه پیلان برآورده راه کمین
همان دیده بان ساخت بر کوهساردو دیده سوی بیشه و رودبار
بدان تا گر از پس کس آید به جنگجرس برکشد زود آوای زنگ
درفش از سر کوه مهراج شاهزده پیش تخت و ز گردش سپاه
همی بود با سروران از فرازکه تا پهلوان چون کند جنگ ساز
فرستاد مبتر به بازو کمنددلیری که آواز بودش بلند
که تا شد به نزدیک آن برز کوهکه مهراج بود از برش با گروه
خروشید و گفت ای شه نو عروسز بیغاره ننگت نبد وز فسوس
شدی چون زنان شرم بنداختیاز ایران یکی شوی نو ساختی
کنون در پس پرده با بوی و رنگنشستی تو با ناز و شویت به جنگ
گواژه همی زد چنین وز فسوسهمی خواند مهراج را نو عروس
خدنگ افکن ایرانیی در زمانخدنگی نهاد از کمین در کمان
زدش سخت زخمی که جانش بسوختگذرگاه آواز و کامش بدوخت
ز مهراج و خیلش چنان یک خروشبرآمد ز شادی که کر گشت گوش
شه و هر که ز آن کار بد گشته شادبدان مرد کان تیر زد چیز داد
چو صف سپاه از دو سو گشت راستغَو کوس و نای نبردی بخاست
گوی بُد سپهدار و پشت گوانگرامی و عم زاده پهلوان
خردمند را نام زر داده بودبه صد رزم داد هنر داده بود
بشد تا بر مبتر از قلب راستبگشت و ز گردان هم آورد خواست
زره دار گردی همان گه ز گردبرون تاخت و آمد برش هم نبرد
بگشتند با هم دو گرد سترگبه خون چنگ شسته چو ارغنده گرگ
به شمشیر و گرز و کمان و کمندنمودند هر گونه بسیار بند
سرانجام زر داده تند از کمینبر افکند بر هندو ابلق ز کین
کشید آبگون آتش زهر بیززدش بر سر و ترگ و بال از ستیز
سپر نیمی و سرش با کتف و دستبه زخمی بیفکند هر چار پست
ز مهراج و لشکرش و ایران گروهخروشی برآمد که خور شد ستوه
دگر رزم سازی برون شد دلیربگردید زر داده گردش چو شیر
چنان زدش تیری که دیگر نخاستشد از ترک تا زین به دم نیمه راست
ده و دو دلاور به خم کمندهمیدون پس یکدگر درفکند
پسر داشت مبتر یکی شیر مردکش از جنگیان کس نبد هم نبرد
به مردی گسستی سر زنده پیلبه خنجر براندی ز خون رود نیل
به پیکار زر داده شیر دلبرون تاخت در کف ز پولاد شِل
بینداخت سوی گو سرفراززمان جوان بد رسیده فراز
به پشتش درآمد برون شد ز نافدلیری چنان کشته شد بر گزاف
از ایرانیان گریه برخاست پاکدویدند و برداشتندش ز خاک
شد از کشتنش پهلوان دل دژمز خون دو دیده بسی راند نم
به چرخ و زمین کرد سوگند یادکه امروز بدهم درین جنگ داد
کنم زین سیاهان درین دشت خونبه هر موی زر داده گردی نگون
چمان چرمه زاولی بر نشستهمان سی رسی نیزه ز آهن به دست
سوی پور مبتر به کین داد رویدرآمد سنان راست کرده به روی
به کم زان که مرغی زند سر در آبز زین کوهه بربودش اندر شتاب
چنان از سنانش نگونسار کردکش از نیزه بر آهنین دار کرد
زمانی چپ و راست هر سوش بردبیفکند و پشت و سرش کرد خرد
همی گفت کاین را بخوابید پستکه مهمان بد از باده گشتست مست
پس از خشم تن بر سپه برفکندهمه دشت دست و تن و سرفکند
بدان چرمه پوشیده چرم هژبرچو دیوی دمان بر یکی پاره ابر
به زخم پرند آور از پشت پیلهمی معصفر تاخت بر تلّ نیل
سر خنجرش ابر خونبار بودسنانش نهنگ یل اوبار بود
چنان چون به رشته کند مهره مردیلان را به نیزه همی پاره کرد
چهل پیل جنگی و سیصد سواربه یک حمله بفکند بر خاک خوار
ز تن کرد چندان سر از کینه پخشکه شد زیر او درز خون چرمه رخش
همه دشت هندو بُد از زیر نعلتن قیرگونشان ز خون گشته لعل
غریونده مبتر ز درد پسرز غم دیده پر خون و پر خاک سر
بیآمد به خون پسر کینه خواهبرآویخت با پهلوان سپاه
سپهبد برانگیخت رزمی عقابدرآمد بدو چون درخش از شتاب
زدش بر میان راست تیغ نبردچنان کز کمربند یکی را دو کرد
بماندش یکی نیمه بر زین نگوندگر نیمه بر خاک غلتان به خون
بزد نعره مهراج و بر پای خاستز شادی تن از کُه بیفکند خواست
ز درد جگر سر به سر هندوانبه کین سر نهادند بر پهلوان
دلاور درآمد چو غرنده میغدو دستی همی زد چپ و راست تیغ
دلیران ایران و زاول به همبکردند حمله چو شیر دژم
بپیوست رزمی گران کز سپهرمه از بیم گم گشت و بگریخت مهر
برآمد دِه و گیر هر دو سپاهبرآمیخت با هم سپید و سیاه
پر از خشم شد مغز و پر کینه دلز دل خاست خون و ز خون خاست گل
سر تیغ چون خون فشان میغ شددل میغ پرتابش تیغ شد
بپرّید هوش زمانه ز جوشبدرّید گوش سپهر از خروش
ز بس گرد چشم جهان تم گرفتز بس کشته پشت زمین خم گرفت
نبد رفته از روز نیمی فزونکه بد ز آن سیاهان دو بهره نگون
به خاک اندرون خستگان همچو مارکشیده زبان از پی زینهار
ز بس زخم خشت و خدنگ درشتشده پیل ماننده خارپشت
به هر سو نگون هندوی بود پستچه افکنده بی سر چه بی پای و دست
ز تن رفته خون با گل آمیختهچو خیک سیه باده زو ریخته
یکی باد برخاست و تاریک کردکه آسان همی در ربود اسپ و مرد
بزد بر رخ هندوان ریگ و سنگنگون شد درفش دلیران ز چنگ
نهادند سر سوی بالا و شیبگریزان و بر هم فتان از نهیب
بهو پیش شد باز خنجر به دستهمی گفت تا کی بود این شکست
هنرتان همه روز آویختننبینم همی جز که بگریختن
به خوان همچو شیران شتابید تیزچو جنگ آید آهو شوید از گریز
ز گردان لشکرش هر کس که یافتعنانش به تندی همی باز تافت
فکند از سران مر سه تن را ز پایفرو داشت پیلان و لشکر به جای
چنین تا به شب رزم و پیکار بودنبد دست کز زخم بیکار بود
چو بنوشت شب فرش زربفت راغهمه گنبد سبز شد پر چراغ
سپاه آرمیدند بر جای خویشهمان شب مهان را بهو خواند پیش
چنین گفت کاین بار رزمی گرانبسازید هم پشت یکدیگران
سپه پاک و پیلان همه بیش و کمبه جنگ اندر آرید فردا به هم
همینست یک رزم ماندست سختبکوشیم تا چیست فرجام و بخت
همه جان به یک ره به کف برنهیماگر کام یابیم اگر سر نهیم
مهان هم برین رای گشتند بازهمه شب همی رزم کردند ساز
چو ز ایوان مینای پیروزه هوربکند آن همه مهره های بلور
ز دریای آب آتش سند روسدر افتاد در خانه آبنوس
ز هندو جهان پیل و لشکر گرفتغو کوس کوه و زمین بر گرفت
هزاران هزار از سپه بد سوارز پیلان جنگی ده و شش هزار
به برگستوان پیل پوشیده تنپر از ناوک انداز و آتش فکن
ز بس قیر چهران زده صف چو مورببد روز تا رو سیه گشت هور
همان شب که شد گفتی از روزگارازو هندوی کرده بُد کردگار
ز کوس و ز زنگ و درای و خروشز شیپور و ز ناله نای و جوش
تو گفتی زمانه سرآید همیبه هم کوه و دشت اندر آید همی
ز هندو سپه بود ده میل بیشز پس صفّ پیلان سواران ز پیش
به دیبا بیاراسته پیل چارز زرّ طوقشان وز گهر گوشوار
ابر کوهه پیل در قلبگاهبلورین یکی تخت چون چرخ ماه
بهو از بر تخت بنشسته پستبه سر بر یکی تاج و گرزی به دست
درفشی سر از شیر زرّینه سازپرندش ز سیمرغ پر کرده باز
ز بر چتری از دمّ طاووس نرفروهشته زو رشته های گهر
وز اینروی مهراج بر تیغ کوهبه دیدار ایرانیان با گروه
زده پیل پیکر درفش از برشز یاقوت تخت از گهر افسرش
فرازش یکی نیلگون سایبانز گوهر چو شب ز اختران آسمان
بدینسان نظاره دو شاه از دو رویمیان در دو لشکر بهم کینه جوی
سپهبد سبک رزم آغاز کردبزد کوس کین جنگ را ساز کرد
از آن ده دلاور یل نامدارکه سالار بُد هر یکی بر هزار
به هر سو یکی به سپه برگماشتبر قلب زاول گره باز داشت
بگردنکشان گفت یکسر به تیرکنید آسمان تیره بر ماه و تیر
همه جنگ با پیل داران کنیدبریشان چنان تیر باران کنید
که در چشم هر پیلبانی به جنگفزون از مژه تیر باشد خدنگ
بگیرید ره بر بهو هم گروهمدارید از آن تخت و پیلان شکوه
که من هم کنون تخت و آن تاج رادهم با بهو هدیه مهراج را
ز شست خدنگ افکنان خاست جوشکمان کوش ها گشت همراز گوش
هوا پر ز زنبور شد تیز پرخدنگین تن و آهنین نیشتر
کشیدند شمشیر شیران هندگرفتند کوشش دلیران سند
زمین همچو دریا شد از گرز و تیغوزو گرد برخاست مانند میغ
همه دشت از خشت شد کشت زارهمه کشته پر هندوان کُشته زار
بگردید گردون کوشش ز گردبرون تافت از میغ ماه نبرد
ز خون هفت دریا بر آمد به همزمین از دگر سو برون داد نم
به هر گام بی تن سری ترگ داربُد افکنده چون مجمری پر بخار
شده گرد چون چرخی و خشت و شلستاره شده برج او مغز و دل
جهان ز آتش تیغ ها تافتهدل کُه ز بانگ یلان کافته
ز چرخ اختران برگرفته غریوز کوه و بیابان رمان غول و دیو
به دریا درون خسته درندگانز پرواز بر مانده پرندگان
بخار و دم خون ز گرز و ز تیغچو قوس قزح بُد که تابد ز میغ
به هر جای جویی بد از خون روانبکشتند چندان از آن هندوان
که صندوق پیلان شد از زیر پیز بس کشته هندو چو چرخشت می
همان ده سر گرد از ایران سپاهگرفتند هر سو یکی رزمگاه
سم اسپ سنبان زمین کرد پستگروها گره را گراهون شکست
سرافشان همی کرد در صف هژبرکمینگاه بگرفت بهپور ببر
همی ریخت آذر شن و برز همبه خنجر یلان را سر و برز هم
به هر سو کجا گرد گرداب شدز خون گرد آن دشت گرداب شد
کجا گرز نشواد و ارفش گرفتجهان زخم پولاد و آتش گرفت
سپهدار در قلب از آن سو به جنگگهش نیزه و گاه خنجر به چنگ
یلان هر سو از بیمش اندر گریزگرفته ز تیغش جهان رستخیز
کمندش بگسترده از خم خامهمه دشتِ رزم اژدها وار دام
پی پیل پی خسته در دام اوسواران خبه در خم خام او
از آوای گرزش همی ریخت کوهشده چرخ گردان ز گردش ستوه
سنانش همی مرگ را جنگ دادخدنگش همی ریگ را رنگ داد
کجا خنجرش رزمسازی گرفتهمی در کفش مهره بازی گرفت
مرآن مهره کاندر هوا باختیسَر سروران بود کانداختی
به یک ره فزون از هزاران سوارسنان کرده بُد در کمرش استوار
نه بر زین بجنبید گرد دلیرنه از زخم شد مانده نز جنگ سیر
تو گفتی تنش کوه آهن کشستهمان اسپش از باد و از آتشست
ز بس کشته کافکنده از پیش و پسخروش سروش آمد از برکه بس
همان شاه مهراج بر جنگجوینهاده ز کُه دیده بر ترگ اوی 
اگر گردی از زین ربودی ز جایوگر زنده پیلی فکندی ز پای
ز کُه با سپه نعره برداشتیغو کوس از چرخ بگذاشتی
مه پیلبانان شد آگه که بختربود از بهو تخت و شد کار سخت
نه با چرخ شاید به نزد آزمودنه چون بخت بد شد بود چاره سود
بیامد بَر ِ پهلوان سواربه زنهار با پیل بیش از هزار
سپهبد نوازیدش و داد چیزهمیدون بزرگان و مهراج نیز
سیه دیده گیتی بهو پیش چشمبر آشفت با پیلبانان به خشم
به بیغاره گفتا ندارید باکسپارید پیلان به مهراج پاک
سران این سخن راست پنداشتندز هر سو همین بانگ برداشتند
همه پیلبانان از آن گفت و گویبه زنهار مهراج دادند روی
براندند از آن روی پیلان رمهبه نرد بهو صد نماند از همه
پشیمان شد از گفته خود بهوندید اندر آن چاره از هیچ سو
به زیر آمد از پیل و بالای خواستبه ناکام رزمی گران کرد راست
یلان را به پیکار و کین برگماشتبه صد چاره آن رزم تا شب بداشت
چو برزد سر از کُه درفش بنفشمه نو شدش ماه روی درفش
غَوِ طبل برگشتن از رزمگاهبرآمد شب از جنگ بربست راه
بهو ماند بیچاره و خیره سردلش تیره ، گیتی ز دل تیره تر
همی گفت ترسم که از بهر سودسپاهم به دشمن سپارند زود
نه راهست نه روی بگریختننه سودی ز پیکار و آویختن
بُدش زنگیی همچو دیو سیاهز گرد رکیبش دوان سال و ماه
به زور از زمین کوه برداشتیتک از تازی اسپان فزون داشتی
شدی شصت فرسنگ در نیم روزبه آهو رسیدی سبک تر ز یوز
به بالا بُدی با بهو راست یارچو زنگی پیاده بدی او سوار
بدو گفت من چاره ای دانمتکزین زاولی مرد برهانمت
به لابه یکی نامه کن نزد اویبه جان ایمنی خواه و زنهار جوی
که تا من برم نامه نزدش دلیریکی دشنه زهر خورده به زیر
به شیرین سخن گوش بگشایمشهمان جای پردخت فرمایمش
پس اندر گه راز گفتن نهانزنم بر برش دشنه ای ناگهان
سر آرم برو کار گیرم گریزاز آن پس به من کی رسد باد نیز
من این کرده وز شب جهان تیره فامکه داند که من کِه ورا هم کدام
بهو شاد شد گفت اگر ز آنکه بختبرآرد به دست تو این کار سخت
تو را بر سرندیب شاهی دهمبه هند اندرت پیشگاهی دهم
یکی نامه ز آنگونه کو دید رایبفرمود و شد زنگی تیزپای
طلایه بُد آن شب گراهون گردگرفتش سبک زی سپهدار بُرد
یل پهلوان دید دیوی نژندسیاهی چو شاخین درختی بلند
زمین را ببوسید زنگی و گفتز نزد بهو نامه دارم نهفت
پیامست دیگر چو فرمان دهیگزارم اگر جای داری تهی
جهان پهلوان جای پردخته ماندسیه نامه بسپرد و بُد تا بخواند
شد آن گه برش راز گوینده تنگنهان دشنه زهر خورده به چنگ
بدان تا زند بر بَرِ پهلوان بدان زخم بروی سر آرد جهان
سپهبد بدید آن هم اندر شتابچو شیر دمان جست با خشم و تاب
بیفشرد با دشنه چنگش به دستبه یک مشتش از پای بفکند پست
سیه زد خروشی و زو رفت هوششنیدند هر کس ز بیرون خروش
دویدند و دیدند دیوی نگونروان از دهان و بناگوش خون
ز نزدش نجنبید گرشاسب هیچنفرمود کس را به خونش پسیچ
چو هُش یافت لرزنده بر پای خاستبغلتید در خاک و زنهار خواست
به رخ بر ز خون مژه سندروسهمی راند بر تخته آبنوس
جهان پهلوان گفت از تیغ منتو آن گه رهانی سَرِ خویشتن
که با من بیایی به پرده سرایبه نزد بهو باشی ام رهنمای
گر او را سر امشب به چنبر کشمترا از سران سپه برکشم
سیه گفت کز دست نگذارمشهم امشب به تو خفته بسپارمش
دلاور پرند آوری زهر خوردکشید و بپوشید درع نبرد
هم آنگاه با او ره اندر گرفتسیه بد کردار تک برگرفت
ز بس تیزی زنگی تیز روبدو پهلوان گفت چندین مدو
همانا کت از پر مرغ است پایکه پای ترا بر زمین نیست جای
سیه گفت در راه گاه شتابچنانم کم اندر نیابد عقاب
به تیزی به از اسپ تازی دومسه منزل به یک تک به بازی دَوم
بخندید گرشاسب گفتا رواستبدو تیز چندان کت اکنون هواست
اگر من به چندین سلیح نبردنگیرم ترا کم ز من نیست مرد
سیه همچو آهو سبک خیز شدسپهبد چو یوز از پسش تیز شد
به یک تازش از باد تک برگذاشتدو گوشش گرفت و معلق بداشت
چو رفتند نزد سراپرده تنگبه چاره شدند اندرو بی درنگ
رسیدند ناگه بد آن خیمه زودکه بر تخت تنها بهو خفته بود
سپاهش همه بُد ستوه از ستیزبرون رفته هر یک به راه گریز
تهی دید گرشاسب پرده سراینگهبان نه از گرد او کس به جای
برآورده شورش ز هر سو بسیبه ساز گریز اندرون هر کسی
چو شیر ژیان جست از افراز تختگرفتنش گلوبند و بفشارد سخت
بدرید چاردش و بفکند پستدهانش بیاکند و دستش ببست
همیدونش بر دوش زنگی نهادنهانی برفتند هر دو چو باد
به راه و به خواب و به بزم و شکارنباید که تنها بود شهریار
به زودی کشد بخت از آن خفته کینچو بیداری او را بود در کمین
ز هندو طلایه دو صد سرفرازبدین هر دو در راه خوردند باز
دلاور بغرّید و بر گفت نامسوی پیشرو زود بگذارد گام
سر و ترگش انداخت از تن به تیغگرفتند ازو خیل دیگر گریغ
بهو را به لشکر گهش زین نشانبیاورد بر دوش زنگی کشان
سپردش به نشواد زرّین کلاهبه مژده بشد نزد مهراج شاه
ز کار بهو و آن زنگی نهفتهمه هر چه بُد رفته آن شب بگفت
یکی نعره زد شاه مهراج سختبینداخت مر خویشتن را ز تخت
شد آن شب در آرایش بزم و سازچو این آگهی یافت آن سرفراز
بدو گفت خواهم کز آنسان نژندبهو را ببینم به خواری و بند
بیا بزم شادی بَرِ او بریمبداریمش از پیش و ما می خوریم
سپهدار گفتا تو آرام گیرچو دشمن گرفتی به کف جام گیر
تو بنشین به جای بد اندیش توکه او را خود آرم کنون پیش تو
گرفتند هر دو به هم باده یادمهان را بخواندند و بودند شاد
سپهبد ز کار بهو با سپاهبگفت و بفرمود تا شد سیاه
کشانش بیاورد خوار و نژندرسن در گلو دست کرده به بند
خروشی برآمد به چرخ برینگرفتند بر پهلوان آفرین
سبک شاه مهراج دل شادکامبه زیر آمد از تخت بر دست جام
یکی خورد بر یاد شاه بزرگدگر شادی پهلوان سترگ
نشست آنگهی شاد با انجمنگرفت آفرین بر یل رزمزن
که نام تو تا جاودان یاد باددل شاه گیتی به تو شاه باد
همه ساله آباد زابلستانکزو خاست یل چون تو کشورستان
هر آنکش غم و رنج تو آرزوستچنان باد بیچاره کاکنون بهوست
زد از خشم و کینه گره بر بروشد آشفته از کین دل بر بهو
چنین گفت کای گشته از جان نُمیدتهی از هنر همچو از بار بید
چه کردم به جای تو از بد بگویکه بایست شد با منت جنگجوی
به گیتی همی مانی ای بدگهرکه هر چند به پروری زشت تر
به اندرز چندم پدر داد پندکه هرگز مگر دان ورا ارجمند
من از پند او روی برگاشتمترا سر ز خورشید بگذاشتم
شناسند یکسر همه هند و سندکه هستی تو در گوهر خویش سند
یکی تنگ توشه بُدی شوربختشهی دادمت افسر و تاج و تخت
به پاداش این بود زیبای منکه امروز جویی همی جای من
رهی چون به اندازه ندهی مهیچو مه شد نگیرد ترا جز رهی
سر دشمن آنکو برآرد به ماهفرو د افکند خویشتن را به چاه
سزاوار جان بداندیش توببینی چه آرم کنون پیش تو
بهو گفت با بسته دشمن به پیشسخن گفتن آسان بود کم و بیش
توان گفت بد با زبونان دلیرزبان چیره گردد چو شد دست چیر
بنه نام دیوانه بر هوشیارپس آن گاه بر کودکانست کار
ترا پادشاهی به من گشت راستولیک از خوی بد ترا کس نخواست
گهر گر نبودم هنر بُد بسیازین روی را خواستم هر کسی
به زور و هنر پادشاهی و تختنیابد کسی جز به فرخنده بخت
هنر بُد مرا بخت فرخ نبودچو باشد هنر بخت نبود چه سود
هنرها ز بخت بد آهو بودز بخت آوران زشت نیکو بود
پدر نیز پندت هم از بیم گفتکه با من هنر بیشتر دید جفت
به من بود شاهی سزاوارترکه دارم هنر از تو بسیار تر
تو دادی سرندیب از آن پس به منفکندیم دور از بر خویشتن
پس اندر نهان خون من خواستینبد سود هر چاره کآراستی
من از بیم بر تو سپه ساختمهمه گنج و گاهت بر انداختم
چو شاهیت یکسر مرا خواست شدازین زابلی کار تو راست شد
اگر نامدی او به فریاد توبُدی کم کنون بیخ و بنیاد تو
تو بودی به پیشم سرافکنده پستچنان چون منم پیش تو بسته دست
بشد تند مهراج و گفتا دروغبَرِ راست هرگز نگیرد فروغ
پدرت آنکه زو نازش و نام توست نیای مرا پیلبان بُد نخست
گهی چند سرهنگ درگاه شدپس آن گه سرندیب را شاه شد
تو در پای پیلان بُدی خاشه روبکواره کشی پیشه با رنج و کوب
چو رفت او بجایش ترا خواستمشهی دادمت کارت آراستم
کنون کت نشاندم بجای شهیهمی جای من خواهی از من تهی
کسی کش بود دیده از شرم پاکز هر زشت گفتن نیایدش باک
بتر هر زمان مردم بدگهرکه گوساله هر چند مِه گاو تر
برآشفت گرشاسب از کین و خشمبزد بر بهو بانگ و بر تافت چشم
بفرمود تا هر که بدخواه و دوست ز سیلی به گردنش بردند پوست
درآکند خاکش به کام و دهنببردند بر دست و گردن رسن
همیدون به بندش همی داشتندبرو چند دارنده بگماشتند
همان گاه زنگی زمین بوسه دادبه گرشاسب بر آفرین کرد یاد
بدو گفت دانی که از روی بختز من بُد که شد بر بهو کار سخت
بدو رهنمونی منت ساختمچو بستیش بر دوش من تاختم
دگر کم همه خرد کردی دهنبه سیصد منی مشت دندان شکن
مرا تا بوم زنده و هوشمستتف مشت تو در بنا گوشمست
کنون گر بدین بنده رای آوریسزد کانچه گفتی به جای آوری
سپهبد بخندید و بنواختشسزا خلعت و بارگی ساختش
میان بزرگانش سالار کرددرفش و سپاهش پدیدار کرد
چنین بود گیتی و چونین بودگهش مهربانی و گه کین بود
یکی را دهد رنج و بُرّد ز گنجیکی را دهد گنج نابرده رنج
همه کارش آشوب و پنداشتیستازو آشتی جنگ و جنگ آشتیست
کرا بیش بخشد بزرگی و نازفزونتر دهد رنج و گرم و گداز
درو هر که گویی تن آسان ترستهمو بیش با رنج و دردسرست
توان خو ازو دست برداشتنوزین خو نشایدش برگاشتن
از آن پس بهو چون به بند اوفتادسپهدار و مهراج گشتند شاد
همه شب به رود و می دلفروزببودند تا بر زد از خاک روز
چو گردون پیروزه از جوشنشبکند آن همه کوکب روشنش
سپاه بهو رزم را کرد رایکشیدند صف پیش پرده سرای
ندیدندش و جست هر کس بسیفتادند ازو در گمان هر کسی
گه بگریخت در شب نهان از سپاهوگر شد به زنهار مهراج شاه
ز جان یکسر امّید برداشتندسلیح و بُنه پاک بگذاشتند 
گریزان سوی بیشه و دشت و کوهنهادند سرها گروه ها گروه
دلیران ایران هر آنکس که بودپی گردشان برگرفتند زود
نهادند جنگی ستیزندگانسنان در قفای گریزندگان
فکندند چندان ازیشان نگونکه بُد کشته هر سو سه منزل فزون
جهان بود پر خیمه و چارپایسلیح و بنه پاک مانده به جای
ز خرگاه وز فرش وز سیم و زرز درع و ز خفتان ز خود و سپر 
همه هر چه بُد برکه و دشت و غارسلیح نبردی هزاران هزار
همی گرد کردند بیش از دو ماهیکی کوه بُد سرکشیده به ماه
که پیلی به گردش به روز درازنگشتی نرفتیش مرغ از فراز
سپهبد بهین بر گزید از میانببخشید دیگر بر ایرانیان
همانجا یکی هفته دل شادکامبرآسود با بخشش و رود و جام
چو هفته سرآمد به مهراج گفت که این کار با کام دل گشت جفت
بفرمایید ار نیز کاریست شاهوگر نیست دستور باشد به راه
بدو گفت مهراج کز فرّ بختز تو یافتم پادشاهی و تخت
نماند ست کاری فزاینده نامکنون چون بهو را فکندی به دام
پسر با برادرش هر دو به همسرندیب دارند با باد و دم
رویم اندرین چاره افسون کنیمز چنگالشان شهر بیرون کنیم
جهان پهلوان گرد گردنفراز چو بشنید گفتار مهراج باز
اسیران هر آنکس که آمد به مشتکرا کشت بایست یکسر بکشت
بهو را به خواری و بند گرانبه دژها فرستاد با دیگران 
وز آنجا سپه برد زی زنگباربشد تا جزیری به دریا کنار 
پر از کوه و بیشه جزیری فراخدرختش همه عود گسترده شاخ
کُهش کان ارزیر و الماس بودهمه بیشه اش جای نسناس بود
ز گِردش صدف بیکران ریختهبه گل موج دریا برآمیخته
سپاه آن صدف ها همی کافتندبه خروار دُر هر کسی یافتند
چنان بود ازو هر دُر شاهوار کجا ژاله گردد سرشک بهار
چو سیصد هزار از دَرِ تاج بودکه در پنج یک بهر مهراج بود
به گرشاسب بخشید پاک آنچه یافتوز آنجا سوی راه دریا شتافت
به یک کوهشان جای آرام بودکجا نام او ذات اوهام بود
به نزد سرندیب کوهی بلندپر از بیشه و مردم کشتمند
ز غواص دیدند مردی هزاررده ساخته گرد دریا کنار
گروهی شده زآب جویان صدفگروهی صدف کاف خنجر به کف
سپهدار مهراج و چندین گروهستادند نظاره شان گرد کوه
ز دُر آنچه نیکوتر آمد به دستگزیدند بیش از دو صد بار شست
به مهراج دادند و مهراج شاهبه گرشاسب بخشید و ایران سپاه
همان گه غریوی ز لشکر بخاستکزاین بیشه ناگاه بر دست راست
دویدند دو دیو و از ما دو مردربودند و بردند و کشتند و خورد
سپهبد سبک جست با گرز جنگبپوشید درع و میان بست تنگ
یکی گفت تندی مکن با غریودرین بیشه نسناس باشد نه دیو
به بالا یکایک چو سرو بلندبه اندام پر موی چو ن گوسپند
همه سرخ موی و همه سبز مویدو سوی قفا چشم و دو سوی روی
به اندام هم ماده هم نیز نرهمی بچه زایند چون یکدگر
دو زیشان در آرند پیلی به زیرکشند و خورند و نگردند سیر
یکی به ز ما صد به جنگ و ستیزفزونشان تک از تازی اسپان تیز
سپهبد به دادار سوگند خوردکه امروز تنها نمایم نبرد
کُشم هر چه نسناس آیدم پیشاگر صد هزارند و زین نیز بیش
بگفت این و شد سوی بیشه دمانهمی گشت با گرز و تیر و کمان
ز نسناس شش دید جایی به همیکی پیل کشته دریده شکم
چو دیدندش از جایگه تاختندز پیرامنش جنگ برساختند
به خنجر دو را پای بفکند و دستدو را زیر گرز گران کرد پست
دو با خشم و کین زو در آویختندبه دندان از آن خون همی ریختند
بزد هر دو را خنجر دل شکافبدریدشان از گلو تا به ناف
سرانشان به لشکر گه آورد شادبه بزم اندرون پیش گردان نهاد
بماندند ازو خیره دل هر کسیبُد از هر زبان آفرینش بسی
بفرمود تا پوستهاشان به درگاهبه کشتی کشند اندر آکنده کاه
دگر روز مهراج گردنفرازبسی کشتی آورد هر سو فراز
به ایرانیان داد کشتی چو شستدگر کشتی او با سپه بر نشست
ز کشتی شد آن آب ژرف از نهادچو دشتی در آن کوه تازان ز باد
تو گفتی که کیمخت هامون چو نیلبه حمله بدرّد همی زنده پیل
چو پیلی به میدان تک زودیابورا پیلبان با دو میدانش آب
تکش تیز و رفتنش بی دست و پاینه خوردنش کام و نه خفتنش رای
فزون خم خرطومش از سی کمندز دندانش بر پشت ماهی گزند
به رفتن برآورده پر مرغ وارهمی ره به سینه خزیده چو مار
گهی حلقه خرطومش اندر شکمگهی بسته با گاو و ماهی به هم
یکی دشتش از پیش سیماب رنگسراسر چو پولاد بزدوده زنگ
زمینی بمانند گردان سپهردرو چون در آیینه دیدار چهر
بیابانی آشفته بی سنگ و خاکمغاکش گهی کوه و گه کُه مغاک
یکی دشت سیمین بی آتش به جوشگه آسوده از نعره گه با خروش
بدیدن چنان کابگینه درنگز شورش چو کوبند بر سنگ سنگ
دوان او در آن دشت و راه درازگهی شیب تازنده گاهی فراز
گهی چون یکی خانه در ژرف غارگهی چون دژی از بر کوهسار
وز آنسو چو پور بهو رفت پیشبه شهر سرندیب با عم خویش
همی ساخت بر کشتن عم کمیننهان عم به خون جستنش همچنین
سرانجام کار آن پسر یافت دستعمش را کشت و به شاهی نشست
پس آگاهی آمد ز مهراج شاهز درد پدر گشت روزش سیاه
یکی هفته بنشست با سوک و دردسر هفته لشکر همه گرد کرد
بسی گنج زر و درم برفشاندصد و بیست کشتی سپه در نشاند
سپهدار جنگ آور رزم سازفرستادش از پیش مهراج باز
چو رفتند نیمی ره از بیش و کمسپه باز خوردند هر دو به هم
سبک بست گرشاسب کین را میانهمان شست کشتی از ایرانیان 
همه خنجر و نیزه برداشتندز کیوان غو کوس بگذاشتند
چنان گشت کشتی که در کارزاربه زخم سوار اندر آمد سوار 
به هر سو دژی خاست تا زان به جنگ ازو خشت بارنده و تیر و سنگ
ز تف سر تیغ وز عکس آبهمی در هوا گشت کرکس کباب
چنان تیر بارید هر گرد گیرکه هر ماهیی ترکشی شد ز تیر
همی موج بر اوج مه راه زدز ماهی تن کشته بر ماه زد
از آتش همه روی دریا به چهرچنان شد که شب از ستاره سپهر
شد از خون تن ماهیان لعل پوشدل میغ زد ز آب شنگرف جوش
چنان بود موج از سر بیشمارکه گرد چمن میوه بارد ز بار 
همی رفت هر کشتیی سرنگوندرآویخته بادبان پُر ز خون 
چو اسپان جنگی دوان خیل خیلبرافکنده از لعل دیبا جلیل
سپهدار با خیل زاول گروهبه پیش اندر آورده کشتی چو کوه
چپ و راست تیغ ارغوان بار کردبه هر کشتی از کشته انبار کرد
به یک ساعت از گرز یکماهه بیش همی ماهیان را خورش داد پیش
ز کشتی به کشتی همی شد چو گردهمی کوفت گرز و همی کشت مرد
چنین تا به جنگاوه جنگجویرسید از کمین کرد آهنگ اوی
سرش را به گرز گران کوفت خردتنش را به کام نهنگان سپرد
یلان ز آتش رزم و از بیم تابهمی تن فکندند هر سو در آب
چهل کشتی از موج باد شگرفز دشمن نگون شد به دریای ژرف
دگر در گریز آن کجا مانده بودنهادند سر زی سرندیب زود
گرفتند سی کشتی ایران سپاهبکشتند هر کس که بد کینه خواه
همه بادبان ها برافراشتندبه دمّ گریزنده برداشتند
ز صد مرد پنجه گرفته شدنددگر کشته و زار و کفته شدند
سرندیب شد زین شکن پرخروشز شیون به هر بر زنی خاست جوش 
ز خویشانش پور بهو هر که بودببرد و ز دریا گذر کرد زود 
ز هر سو چو بر وی جهان تنگ شدبه زنهار نزد شه زنگ شد
دو میزر بود جامه زنگیانیکی گرد گوش و دگر بر میان
ندارند اسپ اندر آن بوم هیچنه کس داند اندر سواری پسیچ
بود سازشان تیغ کین روز جنگدگر استخوان ماهی و تیر و سنگ 
چو باشد شهی یا مهی ارجمندنشانند از افراز تختی بلند
مر آن تخت را چار تن ساختهبرندش همی بر سر افراخته
بود نیز نو مطرفی شاهوارببسته ز دو سو به چوب استوار
نشستنگه ناز دانند و کامبدان بومش اندول خوانند نام
کرا شاه خواهد به زنهار خویشنشان باشدش مهر و سربند پیش
فروهشته باشد به رخ روی بندنبیندش کس جز مهی ارجمند
ز پور بهو چون شنید آگهیفرستاد سربند و مهر شهی
همان تخت فرمود تا تاختندهمه ره نثارش گهر ساختند
چو آمد برش تنگ برخاست زودفراوان بپرسید و گرمی نمود
نشاند و نوازیدش و داد جاههمی بود از آنگونه نزدیک شاه
مرو را سپهدار و داماد گشتنشست ایمن از اندُه آزاد گشت
سپاهش هم از زنگیان هر کسی زن آورد و پیوندشان شد بسی 
چو گرشاسب و مهراج از جای جنگرسیدند نزد سرندیب تنگ
به شهر از مهان هر که بُد سرفرازهمه هدیه و نزل کردند ساز
به ره پیش مهراج باز آمدندبه پوزش همه لابه ساز آمدند
که گر شد بهو دشمن شهریارز ما کس نبد با وی از شهر یار
ز بهر تواش بنده بودیم و دوستکنون ما که ایم ار گنه کار اوست
به جای گنهکار بر بی گناهچو خشم آوری نیست آیین و راه
و گر نزد شه ما گنه کرده ایمسر اینک بَرِ تیغش آورده ایم
اگر سر بُرد ور ببخشد رواستپسندیده ایم آنچه او را هواست
ز گرشاسب درخواست مهراج شاهکه این رای را هم تو بین روی و راه
به پاداش کژّی و از راه راستبدین کشور امروز فرمان تراست
سپهبد گناهی کجا بودشانببخشید و از دل ببخشودشان
دگر دادشان از هر امید بهروز آنجا کشیدند لشکر به شهر
بسی یافت مهراج هر گونه چیزز گنج بهو و آن لشکرش نیز
نهان کرده ها بر کشید از مغاکبه گرشاسب و ایرانیان داد پاک
یکی ماه از آن پس به شادی و کامببودند کز می نیاسود جام
چو مه گوی بفکند و چوگان گرفتبر اسپ سیه سبز میدان گرفت
بدیدند مه بر رخ پهلوانوز آنجای دلشاد و روشن روان
به کوه دهو بر گرفتند راهچه کوهی بلندیش بر چرخ ماه
که گویند آدم چو فرمان بهشتبر آن کوه برز اوفتاد از بهشت
نشان کف پایش آنجا تمامبدیدند هر پی چو هفتاد گام
ز هرچ اسپر غمست و گل گونه گونبر آن کوه بُد صد هزاران فزون
ز شمشاد و از سوسن و یاسمنز نسرین و از سنبل و نسترن
هم از خیری و گام چشم و زرشکبشسته رخ هر یک ابر از سرشک
همه کوه چون تخت گوهر فروشز سیسنبر و لاله و پیل غوش
هزاران گل نو دمیده ز سنگز صد برگ و دوروی و ز هفت رنگ
چه نرگس چه نو ارغوان و چه خویدچه شب بو چه نیلوفر و شنبلید
بنفشه سرآورده زی مشکبویشده یاسمن انجمن گرد جوی
رده در رده زان گل لعلگونکه خوانی عروسش به پرده درون
گل زرد هال جهان دید جفت گرفته بر بید بویا نهفت
به دستان چکاوک شکافه شکافسرایان ز گل ساری و زند واف
به هر سو یکی آبدان چون گلابشناور شده ماغ بر روی آب
چو زنگی که بستر ز جوشن کندچو هندو که آیینه روشن کند
بُد از هر سوی میوه داران دگربُن اش بر زمین و سوی چرخ سر
که در سایه شاخ هر میوه دارنشستی به هم مرد بیش از هزار
همانجا یکی سهمگین چاه بودکه ژرفیش صد شاه رش راه بود
هر آن چیز کانداختندی درویوگر از گرانی بُدی سنگ و روی
سبک زو همان چیز باز آمدیچو تیر از بُن اش بر فراز آمدی
برانداختی بر سر اندر زمانندیدست کس یک شگفتی چنان
بسی کان یاقوت دیدند نیزز بلور و الماس و هر گونه چیز
بسی چشمه آب روان جای جایبه هر گوشه مرغان دستانسرای
ز کافور و از عود بی مر درختهم از زر گیا رسته بر سنگ سخت
ز گاوان عنبر به هر سو رمهوز آهو گله نافه افکن همه
بر آن کُه برهمن یکی پیرمردبرآورده وز گردش روز گرد
گلش گشته گل سرو زرین کناغچو پرّ حواصل شده پرّ زاغ
شده تیر بالا کمان وار کوژکمان دو ابرو شده سیم توژ
برهنه سر و پای پوشیده تنز برگ درخت و گیا پیرهن
ازو پهلوان جست راه سخنکه ای راست دل کوژ پشت کهن
برینگونه آن کوه خرّم ز چیستبر او نشانِ کفِ پای کیست
پرستنده پیر آفرین بر گرفتچنین گفت کایدر بسست از شگفت
هم از گونه گون گوهر آبدارهم از عود و کافور و هم میوه دار
از آن آن که ایدون خوش و خرّمست که با فرّ فرخ پی آدمست
نشان پی است آنکه در پیش تستکه هفتاد گامست هر پی درست
از ایدر به دریا دو میل است راست شدی او به سه گام هر گه که خواست
ز دریا درون هر شب ابری بلندبرآید غریونده چون دردمند
به آب مژه هر پی اش بیش و کمبشوید نبارد دگر جای نم
ز مینو چو آدم برین کُه فتادهمی بود با درد و با سرد باد
ز دل دود غم رفته بر آفتابدو دیده چو دریا دو رخ جوی آب
به صد سال گریان بُد از روزگارهمی خواست آمرزش از کردگار
چنین تا به مژده بیامد سروشکه کام دلت یافتی کم خروش
ز دیده بدان خرّمی نیز نمببارید چندانکه هنگام غم
از آن آب غم کز مژه رخ بشستهمه کُه خس و خار و هم زهر رست
وزان آب شادی کش از رخ دویدهمه سبزه و داروی و گل دمید
غمی ماند جفتش تهی زو کناربر جدّه نزدیک دریا کنار
همی ماهی آورد از قعر آببپختی میان هوا ز آفتاب
خور و خوانش ماهی بریان بدیبر آدم شب و روز گریان بدی
وز اندوه آدم از ایدر به دردشب و روز گرینده و روی زرد
چو گاه ستایش ستادی به پایسرش بآسمان بر رسیدی به جای
هم از وی فرشته شنیدی خروش	همو یافتی راز ایشان به گوش
فرستاد پس کردگار از بهشت به دست سروش خجسته سرشت
ز یاقوتِ یکپاره لعل فام درفشان یکی خانه آباد نام
مر آن را میان جهان جای کردپرستشگهی زو دلارای کرد
بفرمود تا آدم آن جا شتافتچو شد نزد او جفت را بازیافت
بدان گه که بگرفت طوفان جهان شد آن خانه سوی گر زمان نهان
همان جایگه ساخت خواهد خداییکی خانه کز وی بود دین به پای
بفرّ پسین تر ز پیغمبرانبسی خوبی افزود خواهد بر آن
چو رخ زو بتابی شود دین تباهچو سنگش ببوسی بریزد گناه
چو شد سال آدم تمامی هزارشد از گیتی کرده زی کردگار
و ار شیث پوشید در خاک تنسروش آوریدش ز مینو کفن
نشانگاه گورش کنون ایدرستیکی بهره از وی به دریا درست
چو نوح آمد و یافت ایدر درنگکشید استخوانش به دژهوخت گنگ
از آن این کُه از گوهر و گل نکوستکه بر وی نشانِ کفِ پایِ اوست
نه کوهست ازین بُرزتر در جهاننه یاقوت دارد جز اینجای کان
هم از هر کجا دُر خیزد دگربدین مرز باشد بها گیرتر
دگر ره سپهبد یل چیردستبپرسید کای پیر یزدان پرست
شگفتی بد آنروی سوی شمالچه گوید جهاندیده دانش سگال
برهمن چنین گفت کای پاکرایبد آنروی کم یابی آباد جای
دو صد میل ره بیشه باشد فزوندرختان بارآور گونه گون
در آن بیشها مردم بیشمارگیا خوردشان یا بَرِ میوه دار
چو مردم گشاده کف دست و رویچو میشان نهفته همه تن به موی
یکی بهره را موی سر تا میانچو قرطاس تن چهره چون زنگیان
ز بیگانه مردم بودشان گریزبتازند وز تک به از باد تیز
اگر چند دارندشان جفت نازچو نبوند بسته گریزند باز
همانجا ز کافور و عود و بقمبسی بیشه پیوسته بینی بهم
جزیری همانجاست نزد کلهکه کشتی بدو دیر یابد خله
همه پر درختان با بار و برگکُه و دشت او بیشه پیل و کرگ
درو بیکران مردم زورمندستمکاره و خونی و پرگزند
کرا یافتند از دگر مردمانکشند از سرش کاسه هم در زمان
چو ساز عروسیّ دختر کنندبه کابین همه کاسه سر کنند
خورش هم بدان کاسه آرند پیش توانگر تر آن کس کش آن کاسه بیش
میان درختان به روز شکاربگیرند بر پیل راه آشکار
نخستین ز پای اندر آرند زودوز آنجا گریزند پس همچو دود
از ایرا که پیلان دیگر به کینبر آن بوی کشته دوند از کمین
به خشم آن زمین زیر و از بر کننددرخت فراوان ز بن بر کنند
چو پیلان از آنجای گردند بازشوند آن گُره در شب دیر باز
مر آن پیل را پاره پاره ز نیشکنند و برد هر کسی بهر خویش
ندارند خود کِشته و چار پاینورزند جز میوه ها جای جای
ز پیلست هر گونه شان خوردنیهم از چرم او هر چه گستردنی
کرا مُرد سنگی گران در شتابببندند و زود افکنندش در آب
فکنده همه بیشه شان میل میلسروهای کرگست و دندان پیل
به هندوستان داروی گونه گوناز آن بیشه جایی نخیزد فزون
دگر رهش پرسید گرد دلیرکه ای از خرد بر هوا گشته چیر
بدین کوه تنها نشستت چراستچه چیزست خوردت چو پوشش گیاست
بدو گفت پیرش که سالست شستکه تا من بدین کوه دارم نشست
گیایست پوشیدن و خوردنمسپاس کسی نیست بر گردنم
همه کار من با خدایست و بسنه از من کسی رنجه ، نی من ز کس
و گر بی کس ام نیستم بی خدایبه تنهایی او بس مرا دلگشای
خرد نیز دارم که چون دل نژندبمانم ، کند دردم آسان به پند
تنومند را از خورش چاره نیستوزین بر تنومند بیغاره نیست
چو دیدی که گیتی ندارد بهااز او بس بود خورد و پوشش گیا
چه باید سوی هر خورش تاختنشکم گور هر جانور ساختن 
روان پرور ایدونکه تن پروریبه پروانه تن رنج تا کی بری
کسی کش روان شد به دانش جوانگرش تن بمیرد ، نمیرد روان
روان هست زندانی مستنمدتن او را چو زندان طبایع چو بند
چنانست پروردن از ناز تنکه دیوار زندان قوی داشتن
چه باید کشید اینهمه رنج و باکبه چیزی که گوهرش یک مشت خاک
دمی گرش نبود بمیرد به جایبه پی گر نجنبد ، بیفتد ز پای
هم از یک خوی خویش گردد نژندهم از نیش یک پشه گیرد گزند
چه مهر افکنی بر تن و این جهانکه با تو نه این ماند خواهد نه آن
جهان از بد و نیک آبستنستبرون دوستست از درون دشمنست
چو باغیست پر میوه دارش چمنبه گردش نسیم خوش و نوسمن
هر آن گه که شد رام او دل به مهردگر سان شود یکسرش رنگ چهر
درختش بلا گردد و میوه مارنسیمش سموم و سمن برگ خار
چه ورزیش کت ندهد از رنج بربمالد به پی چون بگیرد به بر
به دوری ز خویشانت آرد نُویدنمایدت طمع و نشاند نمید
کند کوز پشتت، رخ سرخ زردجوانیت پیری ، درستیت درد
پس آنکو چنین با تو باشد به کینتو او را چرا دوست داری چنین
چه نازی به دیبا و خز و سمورکه خواهد تنت را خورد کرم و مور
بسی چاره ها سازی و داوریبری رنج تا گنج گرد آوری
سرانجام بینی شده باد رنجبه تو رنج ماند به بدخواه گنج
گرت نیک باید به هر دو سرایسوی کردگار جهانبان گرای
سپهدار گفت از نهان و آشکارگوا چیست بر هستی کردگار
نشانش چه سان و ستودنش چونچه دانی سوی یکیش رهنمون
هر آن چیز کت دل بدو رهبرستبه چیزی شناسی کزو برترست
خدای از خرد برترست و روانبه چه چیز دانستن او را توان
برهمن چنین گفت کز رای پاکهمه چیزی از چرخ تا تیره خاک
به هستی یزدان سراسر گواستگویانِ خاموش گوینده راست
زمین و آسمان وین همه اخترانهمین درهم آویخته گوهران 
پس اینها که گه زیر و گاه از برندبگردند و هر ساعتی دیگرند
گهی نوبهار آید و گاه تیرجوانست گیتی گهی گاه پیر
زمان تا زمان چرخد را کار نوشب و روز همواره بر راه او
همان مرگ با زندگانی به همبد و نیک با شادمانی و غم
ازین نیست گیتی تهی یک زمانبه گردش دَرند اینهمه بی گمان
ز گردش شود گردگی آشکارنشانست پس گرده بر گردکار
از آرام و جنبش نبد بیش چیزهمان هر دو چیز آفریدست نیز
پس آن چه نبد پیش ازین از نخستچنان دان که هست آفریده درست
چو هستیش دیدی یکی دان و بسدویی دور دار و دو مشنو ز کس
 یکی پادشاه و برو پادشا نشاید بُدَن هر دو فرمانروا
که ناچار آن چیره باشد گرینکند سرکشی این بر آن و آن برین
چو باشند این هر دوان ناتوانتوانا یکی بهتر از هر دوان
دو یارست باشند یا بیش و کمدویی هر دو را باز دارد ز هم
پس آن گه کز آن زین جدایی بودچنین نه نشان خدایی بود
مرورا ندانی مگر هم بدویکه راهت نماید به هر جست و جوی
بپرسید بازش هنرمند مردکه یزدان جهان را سرشت از چه کرد
بهانه چه افتاد تا کرده شدسپهر و ستاره بر آورده شد
چنین گفت این آن شناسد درستکه گیتی همو آفرید از نخست
ولیک از پدر یاد دارم سخنکه گفت این جهان گوهری بُد زبُن
که یزدان چُنان گوهر ناب کردگدازیدش از تفّ و جوشاب کرد
ز جوش و تفش باد و آتش فراشتز عکسش که بر زد ستاره نگاشت
ز موجش همه کوهها کرد و غارزمین از کف و چرخها از بخار
ز دانا دگر سان شنیدم درستکه یزدان خرد آفرید از نخست
خرد نقطه فرمانش پرگار کردو زو گوهر جان پدیدار کرد
پس از جان هیولی و این گوهران پس از گوهران چرخ و این اختران
از آغاز بُد جنبشی کافریدکه از زیر آن گرمی آمد پدید
چو آن جنبش آرام را یار شداز آرام سردی پدیدار شد
کجا جنبش آنجاست گرمی نهفتچو آرام را باز سردیست جفت
ز گرمی دَرِ خشکی اندر گشادز سردی که برخواست ترّی بزاد
زمان تا زمان خشکی آنگاه بازهمی تاخت ترّی ز سردی فراز
چو سردی سوی خشکی آهنگ کردزمین آمد اینک که خشکست و سرد
دمید آتش از خشکی و تف و تابز سردی و ترّی پدید آمد آب
هم از بهر ترّی که سر برفراختهوا گشت و هم جفت گرمی بساخت
چو این چارگوهر به ساز آمدنددگر ره به جنبش فراز آمدند
سبک هر چه زو بُد همه شد بخاربلندی گرفت از بَرِ هر چهار 
چو شد هفت بار آن بخار از زبرشد این هفت چرخ از بَرِ یکدگر
پس آتش ز نو جنبش انگیخت بازوزو هفت ره شد بخار از فراز
از آن هر بخار اختری تابناکبرافروخت از چرخ یزدان پاک
ز کیوان گرفت این چنین تا به ماهبه هر چرخ در اختری جایگاه
از آن پس دگر بیکران شد بخارستاره برافروخت چندین هزار
مرین گوهران راچو جنبش فتادز دو پهلوی چرخ برخاست باد
از آن باد گردون به گشتن گرفتستاره برو ره نوشتن گرفت
سپهر و ستاره به رفتار خاستیکی سوی چپّ و دگر سوی راست
چو این چار گوهر شد آمیخته ز هفت و ده و دو در آویخته 
نخست از زمین معدنی خاست پاکبرافراخت پس رستنی سر ز خاک
پس از رستنی گونه گون جانورپدید آمد آمیخت با خواب و خور
پسین مردم آمد که از هر چه بودشدش بهره و بر همه برفزود
بدو خط پرگار پیوسته شددَرِ آفرینش همه بسته شد
نخستین خرد بود و مردم پسیناگر راه یزدانت باید بس این
ولیک از دگر ره شناسان هندشنیدم هم از فیلسوفان سند
که دیگر جهان است از ما نهانکه دانا همی خواندش آن جهان
جهانی فروزنده و تابناککه جای فرشتست و جان های پاک
ز جان وز فرشته درو هر که هست همه در نمازند و یزدان پرست
دو تا بهره ای زو و بهری به پایدگر بهره در سجده پیش خدای
گروهی روان ها پس آن گه ز راهبگشتند و ، دیوان شدند از گناه
از اندازه بر پای بگذاشتندز یزدان به هم روی برگاشتند
ستمکارگان و آن که بُد بی ستمبر آمیخت زین هر دو بهری به هم
چو بردند از پایگه پای خویشنگون اوفتادند از جای خویش
ز دانش بماندند وز بندگیبه مرگی رسیدند از زندگی
پس آن گه جهان داور داد گردرایشان سرشت آن جهان دگر
چو بایست در هر گهر کار کردجهانی چنین نو پدیدار کرد
از آغاز کاین چار گوهر نمودمیانشان یکی جنبش انگیخت زود
دوگونست جنبش ز بن کژ و راستهمان دایره نیز از نقطه خاست
چو گردیده شد دایره آسمانزمین ماند چون نقطه اندر میان
ز جنبش چو گردون به رفتار گشتز گرمیش آتش پدیدار گشت
دگر باره نو گرمیی برفزودهوا گشت از آن آتش تیره دود
چو ترّی ز گرمیش لختی براندگران گشت و در زیر آتش بماند
ز سردی و خشکی زمین بهره داشتبه سردیش ترّی هوا بر گماشت
پس از سردی و ترّی هر دوانگشاد آب و گرد زمین شد روان
چو بسته شدند این گهر هر چهاربماندند ازین چرخها در حصار
 سرشت جهان پاک از آمیختن درآمد به هر پیکر انگیختن
ازین گوهران هیچ کاری به جاینیاید ز بُن ، تا نخواهد خدای
کز آن گوهر این دیگر آگاه نیستبه راز خداوندشان راه نیست
جهاندار کاین چار پیوسته کردهمه زورشان با زمین بسته کرد
که تا آن روان ها که افکنده انددرین چار گوهر پراکنده اند
همه بر زمین شان بود پرورشبرو دارد و زآن دهد شان خورش
برد شان به هر کالبد کژّ و راستبدارد چنان کش بود کام و خواست
از آن پس به پیغمبران آگهیدهدشان ز راه بدیّ و بهی
پس آن جان که زی روشنی یافت راهوز ایدر شود گشته پاک از گناه
چو از خاک یزدانش گوید که خیزبه دستش دهد نامه رستخیز
به زودی شمارش گزارد تمامبهشتش دهد جای آرام و کام
وگر تیره جانی بود زشت کیشهمان روز چون خواند ایزدش پیش
سیه روی خیزد ز شرم گناهسوی چینود پُل نباشدش راه
ببادفره جاودان کرده بنددر آتش به دوزخ بماند نژند
خنک آن که جانش از گنه هست پاکبماند بهشی چو خیزد ز خاک
ز من هر چه پرسیدی از کم و بیشبگفتم ترا چون شنیدم ز پیش
هم از فیلسوفان رومی درستشنیدم که گیتی هوا بُد نخست
فراوان کسان آن که دانشورندبهین طبع گیتی هوا را گِرند
هوا هست ارمیده باد از نهادچو جنبد هوا نام گرددش باد
هر آن جانور کش دمست از هواستبه دَم جان و تن زنده و بانواست
همه تخم در کشتها گونه گونکه ناراست افتد بود سرنگون
هوا در همه زور و ساز آوردسَرِ هر نگون زی فراز آورد
اگر چندشان ز آب خیزد پسیچهوا چون نباشد نرویند هیچ
ز گردون گروهی نمایند راهکه او را نشاید بُد آن جایگاه
نگوید ورا جای دانش پرستکه برجای جانست گوید چو هست
فرازش هواییست روشن دگرسبک سخت وز هر هوا پاکتر
ز برش ار نه چیزی دگر سان بُدیستاده بدی وی، نه گردان بُدی
هم از باد گردان شدست این چنینهم از باد شست ایستاده زمین
فلک و آتش و اختر تابناکهمه در هوااند استاده پاک
بدآنسان که آهنگر کارسازفرازد دمش نزد آتش فراز
دمادم چو باد دم افتد بهمشود آتش از باد پیچان به دم
ز گیتی هوا بُد نخستین پدیدخدای اندرو جنبشی آفرید
چو جنبید سخت آن هوای شگفتببد باد و ، زان باد آتش گرفت
مرآن باد را آتش افسرده کردازو آب بنشاند و گسترده کرد
چو نم دار جامه که بدهیش تاببیفشاریش زو بپالاید آب
کف و تیرگی هر چه ز آن آب خاست زمین گشت اینک که در زیر ماست
پس از تف آن آتش و عکس آببرآمد بخار و ز نو داد تاب
خدای از بخارش سپهر آفریدز عکسش ستاره پدید آورید
ازین پس هر آنچ از کم وز فزونببد یکسر از پیش گفتم که چون
دگر نیز دان کز گروهان دهردوسانند کز دینشان نیست بهر
گروهی به ایزدنگویند کسکه تا مر جهان را شناسند بس
ز هر جانور پاک وز رستنیهمه هر چه پیدا شود بر زمی
نگارندش اختر شناسد ز چرخطبایع به هر یک رسانند برخ
هم از گفت ایشان چنینست یادکه گیتی چنان کآینست از نهاد
در و پیکر هر چه گشت آشکارچنانست چون بآینه در نگار
که چیزی بود چون به دیدن رسیدبنا چیز گردد چو شد ناپدید
یکی مرد فرزانه هر چند گاه بیاید نماید دگر دین و راه
فرستاده ام گوید از کردگارهمی گفته او کنم آشکار
نهد دوزخی و بهشتی ز پیشکه تا هر کس اندیشد از کرد خویش
درین همگره باز گویند نیزکه ناید درست آنچه دانش به چیز
نخستین گیایی نماید درختبُنه گیرد آن گه کند بیخ سخت
از آن پس زند شاخ و برگ آورددهد بار و سایه فرو گسترد
درنگش به آخر درآرد ز پایشود کنده گرنه بپیوسد به جای
ز بیخ اندرش تا گل و برگ و بربه هر سان که شد دانشی بُد دگر
چو این دانش آمد برفت آن نخست چو نادیده شد چیز نامد درست
نخست آب با خاک بُد هم سرشتگل تر بگردند پس خشک خشت
از آن خشت دیوار پیراستندز دیوار پس خانه آراستند
چو خانه کهن گشت و ریزنده پاکهمیدون دگر باره شد تیره خاک
به هر سان که گشت از نشان وز گهردگر دانشی بود نامش دگر
همه نام و دانش که از وی رسیدببد نیست و او نیز شد ناپدید
پس از هرچه خواهد بدو هست و بودندانی زیان چون چو دانی چه سود
چه دانی و گر گوید این دور یابکه هست آتش این کش همی گویی آب
گرین کش همی تن شماری سرستورین کش همی پیل خوانی خرست
نه این چیزها را تو گسترده ایو گر نام هر یک تو آورده ای
چنین یافه ها را سراینده اندکه بر هیچ دانش نه پاینده اند
از آنست گفتارشان زین نشانکه یک چشمکانند و کم دانشان
نگه میکنند آنچه هست از برون ندارند دیدارِ چشم درون
اگر بس بدی دیدن آشکارز بُن نامدی دیدن دل به کار
همی دیدن دل طلب هر زمانکه از دیدن دل فزاید روان
جدا فیلسوفند دیگر گروه جهان از ستیهندگیشان ستوه
که گویند کاین گیتی ایدون به پایهمیشه بدو نیز باشد به جای
گمانشان چنینست در گفت خویشبر آن کاین جهان بُد همیشه ز پیش
که بر ایزد این گفت نتوان به نیزکه بُد پادشا و نبدش ایچ چیز
بکرد آن گه ایدون جهانی شگفتکه تا پادشا شد بزرگی گرفت 
چنان بُد که همواره بد پادشاازو پادشایی نباشد جدا
ره من همینست و گفتار منولیکن جزاینست دیدار من
بَرِ من جهان است دیگر یکی که هست این جهان نزد آن اندکی
از آنجاست افتادن جان مادرین تیره گیتی که زندان ما
جهان چار طبع و ستارست و چرخپس اینان ز دانش ندارند برخ
نه گویا ، نه بینا ، نه دانشورندنه جفت خرد، نز هنر رهبرند
ز یکسو بود جنبش طبع راستچنان جنبد این جان که او را هواست
مرین جان ما را گهر دیگرستکه بینا و گویا و دانشورست
پس او نیست از گوهر این جهاندگر جایگاهست او را نهان
از آن سان که بُد پیش گشته شدستدرین طبع گیتی سرشته شدست
خورا هر چه بینی تو از کم و بیشکند همچو خود هر یکی خورد خویش
اگر جانور صد بود گونه گونز یک چیزشان خورد نبود فزون
خورند آن یکی چیز را تن به تنکند هر یک از خورده چون خویشتن
خورد رستنی از زمین آب و خاککند همچو خود هر چه را خورد پاک
گیا را گیاخوار چون خورد کردکند باز چون خویشتن هر چه خورد
خورد مر گیاخوار را آدمیدرآردش در پیکر مردمی
ز خاک سیه تا به مردم فرازرسد پایه پایه همی تا فراز
مرین پایها را گذارد همیبرآنسان که یزدانش دارد همی
گرفتار ماندست در کار خویشرسیده به پاداش کردار خویش 
ولیکن چو افتاده شد در زمینخستین بود پایه رستنی
نگون باشد آنجا به خاک اندرونکه هر رستنی می برد سرنگون
 چو اندر گیاخوار پیدا شودمعلق سرش سوی پهنا شود
چو در مردم آید پدیدار بازشود زین دو پستی سرش برفراز
وز آن پس بر از آدمی پایه نیستکه در جانور بیش ازین مایه نیست
چو آمد درین پیکر و راست خاستبه ایزد رسد گر بود پاک و راست
به داد و به دین راند آیین و راههم ایزد شناسد بداند اله
هم آگاه گردد که چون بُد نخستبهشت برین جای یابد درست
ور از دین بود دور و ناخوب کاربه دوزخ بود جاودان پایدار
درین ره سخن هست دیگر نهفتولیکن فزون زین نشایدش گفت
اگر خواهی آن جست باید بسیمگر اوفتد کت نماید کسی
ز من هر چه پرسیدی از کمّ و بیشبگفتم ترا چون شنیدم ز پیش 
اگر چند دانش بَر ما بسستخداوند داناتر از هر کسست 
تو گر چند بسیار دانی سخنهمان بیشتر کش ندانی ز بن
همه دانشی با خدایست و بسنداند نهانش جزو هیچکس
بپرسید باز از بر کوهسارکدامست شهری به دریا کنار
بدین روی دریا و زآنروی کوهبه دشت آمده برزگر یک گروه
سرانجام از آن دشت شیری نهانبرد یک یکی را همی ناگهان
کِرا کشتی و توشه شد ساختهشود شاد زی شهر پرداخته
همان کش نه کشتی نه توشه نه سازشود غرق و ماند ز همراه باز
برین دشت از آن پس کِرا بود کِشتبدان شهر یابد برش خوب و زشت
چنین گفت دانای روشن روانکه شهر آن جهانست و دشت این جهان
دمان شیر مرگست و ما ورزکارهمان چرخ و دریا و در کشت کار
ره نیک و بد کشتن تخم ماستخرد کشتی و توشه مان راه راست
هر آن کشت کاینجای کردیم سازبَرِ او بدان سر بیابیم باز
بپرسید کز کار آدم سخنچه دانی که گویند گِل بد زبن
دگر گفت کایزدش چون آفریدورا از درختی پدید آورید
بفرمود پس تا درخت از درون بکافند و زو آدم آمد برون
نشاید که زاید به مردم درختتو بگشای اگر دانی این بند سخت
به پرسنده گفت آن که چرخ و زمینهمو کرد ازو کی شگفت آید این
ز چیزی شگفت ار بمانی به جایشگفت از تو باشد چنان نز خدای
همان کز نچیز آفریدست چیزز چیز ار کند چیز نشگفت نیز
 چو بنیاد ما از گِل آمد درستچنین دان که گِل بود آدم نخست
درختی شناس این جهان فراخسپهرش چو بیخ آخشیجانش شاخ
ستاره چو گل های بسیار اویهمه رستنی برگ و ما بار اوی
همی هر زمان نو برآرد بریچو این شد کهن بر دمد دیگری
بدینگونه تا بیخ و بارش به جایبماند نه پوسد نه افتد ز پای
درخت آن که زو آدم آمد برونبدان کاین بود کت بگفتم که چون
به تخم درخت ار فتی در گماننگه کن برش تخم باشد همان
بَرِ این جهان مردم آمد درستچنان دان که تخمش همین بُد نخست
چنان چون درخت آمد از بهر بارجهان از پی مردم آید به کار
درختی کزو نیز نایدت برجز از بهر کندن نشاید دگر
جهان نیز کز مردم و کشت و رُستتهی شد شود نیست چون بد نخست
هم از چند چیزش بپرسید بازچنین گفت کای مرد فرهنگ ساز
همه گفتهایت به جای خودستبه عالم مباد آن که نابخردست
کدامست گفت این دو اسپ نوندهمه ساله تازان سیاه و سمند
سواران هر دو به ره تیز پایهم اندر تک و هم بمانده به جای
بدو گفت روز و شب اند این دو راستسوارانش ماییم و ره عمر ماست
از ایشان ره ما به منزل فرازیکی راست کوتاه و یکیّ دراز
بپرسید آن سبز ایوان به پایکدامست تازان و فرشش به جای
چهار اژدها بر هم آویختهاز آن سبز ایوان درآویخته
به جان و به تن زان چهار اژدهابه گیتی نیابد کسی زو رها
همان فرش خوانیست آراسته خورنده برو بیکران خاسته 
به پاسخ چنین گفت دانش گزین که ایوان سپهرست و فرش این زمین
همان فرش خوانیست کز گونه گونخورش دارد از صد هزاران فزون 
خورنده به گرد جهان هرچه هستندارد جز گرد این خوان نشست
چهار اژدها آن که کردی تو یادهمین آتش و خاک و آبست و باد 
به دین هر چهارست گیتی به بندوزیشان به جان نیست کس بی گزند
چه دانی یکی گنج آکنده است که دارد بسی گوهر اندر نهفت 
نه پُری گرد هیچ از انباشتننه کمی پذیرد ز برداشتن 
همان گنج هست آینه بی گمان توان اندرو دید هر دو جهان
چنین گفت کای در هنر برده رنجگوهر دانش و مرد داناست گنج
سخن های دانا که نیکو بودبرد هر کسی باز با او بود
نه سیر آید از گنج دانش کسینه کم گردد ار زو ببخشد بسی
همان آینه مرد دانا شناسکه دارد به دانش ز یزدان سپاس
روان تنش زاندرون و برونببیند بداند دو گیتی که چون
به از گنج دانش به گیتی کجاستکرا گنج دانش بود پادشاست
ز هر دانشی چیست بهتر نخستچه چیز آن که دانست نتوان درست
به ما چیست نزدیکتر در جهانهمان دورتر نیز وز ما نهان
بتر دشمن و نیکتر دوست چیستسرِ هر درستی و هر درد چیست
بهین رادی آن کت کند نیکنامچه سان و توانگر ترین کس کدام
دل کیست همواره مانده نژندکرا دانی ایمن به جان از گزند
چه چیز آن که یاور نخواهد کسیچه چیز آن که با یار باید بسی
چه دانی که از گیتی آن نیکترچه چیز آن که شد باز ناید دگر
چه بیشست در ما و چه کمترستچه گوهر که بهتر ز هر گوهرست
چه نرم آن که ز آهن بسی سخت ترهم از مردمان کیست بی بخت تر
مه از کوه وز وی گرانتر چه چیزبه نیروترین کس کدامست نیز
به گیتی سیاهی ز زنگی چه بیشکه بی ترس و ایمن ز یزدان خویش
ز روزی و دانش چه کاهد بگویچه چیز آورد بیشتر غم به روی
برهمن چنین گفت کای رهنمونشنو پاسخ هر چه گفتی کنون
ز دانش نخست آنچه آید به کار بهین هست دانستن کردگار
دگر آن که نتوانش دانست راستبزرگی و خوبی یزدان ماست
به ما مرگ نزدیکتر بی گمانکه بیمست کاید زمان تا زمان
ز روزی مدان دورتر کان گذشتکه هرگز نخواهد بُدش بازگشت
دو چیزست اندر جهان نیکترجوانی یکی تندرستی دگر
زما آن که چون شد نیابیم بازجوانیست چون پیری آمد فراز
همه درد تن در فزون خوردنستدرستیش به اندازه پروردنست
بهین دوستست از جهان خوی خوشخوی بد بتر دشمن کینه کش
به جان از بدی ایمن آنست و بسکه نیکی کند بد نخواهد به کس
بود بیش اندوه مرد از دو تنز فرزند نادان و ناپاک زن
به ما در فزون از گمان نیست چیزچنان چون دم از کم زدن نیست نیز
بود مهتری آن که بایدش یارنخواهد ز بُن بخت یاور به کار
بهین رادی آن دان که بی درد و خشمببخشی نداری به پاداش چشم
نکو نامی از گیتی آنرا سزاستکه کردار او خوب وگفتار راست
دژم تر کسی مردِ رشکست و آزکه هر ساعتش مرگی آید فراز
چو نیک، کسی دید غمگین به جایبماند کند دشمنی با خدای
توانگر تر آن کس که خرسند ترچو والاتر آن کاو هنرمندتر
به نیرو تر آن کس که از روی دینکند بردباری گه خَشم و کین
گرانتر ز هر چیز بار گناهکزو جان دژم گردد و دل سیاه
دورغ بزرگست مهتر ز کوهکه گویند بر بیگناهان گروه
سه چیزست اندر جهان خاستهکه روزی و دانش کند کاسته
یکی شرم و دیگر سرافراشتنسوم پیشه را کاهلی داشتن
سیه تر دل مرد بی دین شناسکه نه شرمش از کس نه ز ایزد هراس
همان سخت تر ز آهن و خاره سنگمدان جز دل زفت بی نام و ننگ
بهین گوهری هست روشن خردکه بر هر چه دانی خرد بگذرد
خرد مر جهان را سَرِ گوهرستروان را به دانش خرد رهبرست
کسی باشد ایمن ز ترس خدایکه نبود گناهش چوشد زین سرای
دل از ترس یزدان ندارد دژمکه داند کز ایزد نباشد ستم
کسی نیست بدبخت وکم بوده ترز درویش نادان دل خیره سر
که نه چیز دارد نه دانش نه راینژندیش بهره به هر دوسرای
مرا دانش این بُد که گفتم نخستازین به روا باشد ار نزد تست
به فرهنگی ار ره تو دانی بسیرهی نیز شاید که داند کسی
بسی دان ره دانش افزون وکاستنداند خرد جز یکی راه راست
برو پهلوان آفرین کرد و گفتشدم با بسی خرمی از تو جفت 
چراغ خرد در دل افروختمفراوان ز هر دانش آموختم
کنون خواهم از تو که با رای پاکچو رخ برنهی در نیایش به خاک
بخواهی که تا داور کردگارببخشد گناهم به روز شمار
وزین راه دشوار کم هست پیش برد شادی زی میهن و مان خویش
بگفت این و زآب مژه رود کردببوسیدش از مهر و بدرود کرد
یکی مرد ملاح بُد راهبرکه بودش همه راه دریا ز بر
بُد آگه که در هر جزیره چه چیز زبان همه پاک دانست نیز
به دریا هر آنجا که آب آزمایببویید آن گل بگفت از کجای 
چو دریا به شورش گرفتی شتابیکی طشت بودش بکردی پر آب
همه بودنی ها درو کم و بیشبدیدی چو در آینه چهر خویش
ورا رهبری داد مهراج شاهبه سوی جزیری گرفتند راه
که خوانند برطایل آنرا به نامجزیری همه جای شادی و کام 
پر آب خوش و میوه هر سو به بارگل گونه گون گرد او صد هزار 
ز خوشی زمین چون دل شاد بودز باران هوا چون کف راد بود
چو رنگ رخ یار شاخ از سمنچو موی سر زنگی آب از شکن
خروش رباب و نواهای نایره چنگ و دستان بربط سرای
همی آمد از بیشه هر سو فرازنه گوینده پیدا نه دستان نواز
تو گفتی همه بیشه بزم پریستدرختش ز هر سو به رامشگریست
چنان هر زمان بانگ برخاستیکه می خواره را آرزو خواستی
دل پهلوان خیره شد ز آن خروشبه هر گوشه ای گشت و بنهاد گوش
نه کس دید و نه مرغ و دیو و پرینه کمتر شد آن بانگ رامشگری
ز ملاح از آن بانگ پرسید بازنداند کس این گفت پیدا و راز
همان جا شب تیره بر دشت و راغیکی روشنی دید همچون چراغ
بپرسید از آن پهلوان سترگبگفتند گاویست آبی بزرگ
چو دم زد فتد روشنی در هوابدان روشنایی کند شب چرا
چنین هر شب از دور پیدا شودسپیده دمان باز دریا شود
ز دام و دد و بوی نخچیر گیرگریزان بود بر سه پرتاب تیر
ببودند روزی وز آن جایگاهکشیدند سوی صواحل سپاه
جزیری بُد آن نیز با رنگ و بوی که عنبر بس افتد ز دریا بدوی
ز دریا کجا عنبر افتد دگربر آن یک جزیره بود بیشتر
بگردید مهراج هر سو بسیهمان پهلوان نیز با هر کسی
گیایش همه بود تریاک زهربه کُه سنگش از کهربا داشت بهر
شکفتی گل نوشکفته ز سنگبسی بود هر گونه از رنگ رنگ
هم از میوه هایی که خیزد خزانکز ایرانیان کس نبد دیده آن 
یکی بیشه دیدند گند آب و نیکه آن آب مستی نمودی چو می
ازو هر که خوردی فتادی خموشزمانی بُدی و آمدی باز هوش
کبابه به هر جای بسیار بودکه هریک مه از نار بر بار بود
گیا بُد که چون سوی او مرد دستکشیدی، شدی خفته بر خاک پست
چو زو مرد کف باز برداشتیز پستی دگر سر برافراشتی
نمودند دیگر گیاهی سپیدسیاهش گل و بیخ چون سرخ بید
بُدی دودگون روز بر دشت و راغشب از دور درتافتی چون چراغ
گیا بُد که چون سنگ آهن ربایکشد آهن او زر کشیدی ز جای
دگر سنگ بُد نیز کز دور سیم ربودی ورا زیر و گشتی دو نیم
ز گلها گلی بُد نیز که هرکس ببوی گرفتی ، بخندیدی از بوی اوی
گلی بُد که چون بوی بردیش مردشدی زار و گرینده بی سوک و درد
چنین چند بُد ز آن که نتوان شمردکرا رای بُد هرچه بایست برد
دگر جای دیدند چندین گروهز عنبر یکی توده مانند کوه
به یک بار چندانکه یک پیلوارهمانا به سنگ رطل بد هزار
به گرشاسب بخشید مهراج و گفتکه هرگز کس این ندیدست جفت
گواهی دهم کاین شگفتی درستهم از فرّ ایران شه و بخت تست
یکی چشمه دیدند نزدیک اویبه ده گام سوراخی از پیش جوی
همی هر گه از چشم آن چشمه آبشدی در هوا همچو تیر از شتاب
ز بالا فرود آمدی همچو دودبدان تنگ سوراخ رفتی فرود
ازو هرچه گشتی چکان بی درنگشدی بر زمین ژاله کردار سنگ
سپید آمدی سنگ او سال و ماهجز اندر زمستان که بودی سیاه
نه کس دید کان آب راه ره کجاستنه سیر آمد از خوردنش هر که خواست
وز آنجای خرّم بی اندوه و رنجکشیدند سوی جزیرهٔ هرنج
جزیری پر از بیشها بود و غیش به بالا و پهنا دو صد میل بیش 
فروان درو شهر و بی مر سپاهیکی شاه با فرّ و با دستگاه 
چو آن شه ز مهراج وز پهلوانخبر یافت شد شاد و روشن روان
ز نزل و علف هر چه بایست سازبفرمود و شد با سپه پیشباز
یکی هفته شان داشت مهمان خویش کمر بسته روز وشب استاده پیش
به هر بزم چندان گهر برفرشاندکه مهراج و گرشاسب خیره بماند
ببخشیدشان هدیه چندان ز گنجکز آن ماند دریا وکشتی به رنج
ز کافور وز عنبر وعود ترز دینار و یاقوت و دُرّ و گهر
ز بیجاده تاج و ز پیروزه تختز زربفت فرش و مرجان درخت
ز ترگ و ز شمشیر وز درع نیزهمیدون طرایف ز هر گونه چیز
دگر داد چندان به ایرانیانکه گفتن به صد سال نتوانی آن 
وز آنجای خرّم دل و راهجویبه سوی جزیری نهادند روی
که آن جای را رامنی نام بود یکی خوش بهشت دلارام بود 
کُه و دشت او بود بر هر کنار درختان کافور سیصد هزار
همه چون بر انگشت بفسرده شیر وزو شاخها چون سرافکنده پیر
تو گفتی که ابری برآمد شگرف برآن بی شُمر ژاله بارید و برف 
چو دست کمندافکنان روزِ کار همه شاخها پُر ز پیچیده مار 
 زمین سر به سر گفتی از پیش شیدز کافور در چادری بُد سپید
 برو راه ماران شکن در شکن  چو آهخته بر برف پیچان رسن 
همی یخ شد از بوی کافور خوی برانگیخت از مغر سرمای دی 
 به هر شاخ کافور بر جای جای بسی مرغ دیدند دستان سرای 
از آن مرغ هر کس چنین کرد یادکه چون آشیان کرد و خایه نهاد 
شود مار تا بچه اش زآشیان  بیارد جهد خایه تُند از میان 
زند بر سر و چشم مار از ستیز تن خویش تا مار گیرد گریز
پس آن مرغ تا بچه آرد بروننهد خایه از گرد خانه درون
که تا گر دگر ره شود مار باز نیارد بدان آشیان شد فراز
همان جای دیدند کوهی سیاه گرفته سرش راه بر چرخ ماه
درختی گشن شاخ بر شخ کوهاز انبوه شاخش ستاره ستوه 
بلندیش با چرخ همباز بود ستبریش بیش از چهل باز بود 
زعود و ز صندل به هم ساختهبه سر برش ایوانی افراخته 
دگر ره سپهدار پیروزبختز ملاح پرسید کار درخت
که بر شاخش آن کاخ بر پای چیست چنین از بَِر آسمان جای کیست
چنین گفت کآن جای سیمرغ راستکه بر خیل مرغان همه پادشاست 
هر آن مرغ کاینجاست از بیم اوی نیارد بُد این ز آن دگر کینه جوی 
به کوه اژدها و به دریا نهنگهر آنجا که یابد بدرد به چنگ
چو گمراه بیند کسی روز و شب ز بی توشگی جان رسیده به لب 
از ایدر برد نزدش اندر شتاب به چنگال میوه به منقار آب 
به سوی رَهِ راست باز آردش ز مردم کرا دید ناز آردش 
پدید آمد آن مرغ هم در زمان ازو شد چو صد رنگ فرش آسمان 
چو باغی روان در هوا سر نگونشکفته درختان درو گونه گون 
چو تازان کُهی پر گل و لاله زار زبالاش قوس قزح صد هزار 
ز باد پرش موج دریا ستوه ز بانگش گریزان دد از دشت و کوه 
به منقار بگرفته یکی نهنگ چهل رش فزون اژدهایی به چنگ 
بر آن آشیان رفت و سر بر فراخت تو گفتی ز دیبا یکی کُلَه ساخت 
 سپهبد فروماند خیره به جای همی گفت ای پاک و برتر خدای 
به هر کار بینا و دانا تویی به هر آفرینش توانا تویی 
تو سازیدی این هفت چرخ روان ستاره معلق زمین در میان 
جهان را گهر مایه کردی چهار وزایشان تن جانور صد هزار 
به هر پیکری نو برآری همی بر آنسان که خواهی نگاری همی 
کنی هر چه خواهی و کس راه راستجز از تو نداند که چونان چراست
به کار اندرت رنج و همباز نیست سخنهات را حرف و آواز نیست 
ز مرده تن زنده آری فراز پدید آوری مرده از زنده باز 
تو دانی یکی قطره آب آفرید که باشد درو هر دو گیتی پدید 
ز خاک آن هنر هم تو پیدا کنی کز آن جای گویا و بینا کنی 
گمست آن که سوی تواش راه نیست به دل کور هر کز تو آگاه نیست 
برینسان به پرواز پرنده کوه تو کردی کزو خشک و تر را ستوه 
نشیمنش را زابر بگذاشتی به صد رنگ پیکرش بنگاشتی 
همیدون نیایش کنان گشت باز همی گشت با هر که بُد سرفراز 
ز کافور و عنبر کجا یافتند ببردند هر چند برتافتند 
وز آن جای رفتند زی هر دو زورجزیری سزاوار شادی و سور
همه کوهش از رنگ گل ناپدید همه راغ پُر سوسن و شنبلید 
زمین چرخ و ابرش بخار بهشت هوا مشکبوی آب عنبر سرشت 
تو گفتی بهار از پی دین به کین سپه کرد و آمد برون از کمین 
کمان آزفنداک شد ژاله تیر  گل غنچه ترگ و زره آبگیر 
شکوفه چو بر رشته کرده گهر درختان چو طاووس بگشاده پر 
هزاران رده دید گل هر کسی  ازین تازه گلهای ما مِه بسی
ستاک سمن بود زانسان ببر  که یک مرد بستم گرفتی به بر 
گل رسته بُد شسته باران ز گرد  چو گیلی سپرها چه سرخ و چه زرد 
بنفشه به بالای یکی درفش ببر برگ هر یک چو جامی بنفش 
 همه لاله بُد رسته بیراه و راه دو چندان که باشد عقیقین کلاه
 ز بوی گل و سنبل و ارغوان همی گشت فرتوت از سر جوان 
 به گیتی نشانی نداد آدمی جزیری بدان خوشی و خرمی 
چنین داستان بود از آن بوم و رُست که یک سال هرک ایدر آرام جست 
هزاران اگر نوبهاران و تیر برآید نه بیمار گردد نه پیر 
خروشان بسی مرغ بُد در هوا همه خوب رنگ و همه خوش نوا 
 خدنگ از کمان پهلوان کرد راست از آن مرغ چندی بیفکند خواست 
بدو گفت ملاح کای ارجمند مرین مرغکان را نشاید فکند 
که در ژرف دریا هر آنجایگاه که ناگه شود کشتیی گم ز راه 
به سوی ره این مرغ با خشم و جوش  همی دارد از پیش کشتی خروش 
 که تا بر پی بانگ و پرواز اوی برانند کشتی برآواز اوی
کجا مار بینند و نیز از نهنگ بدرندش از هم به منقار و چنگ 
گرفتند از آن زنده چندی شکار مگر از پی کشتی آید به کار
به دیگر جزیری فکندند رخت پر از کان سیم و پر آب و درخت 
بدو در گیا داروی گونه گون گل و میوه از صد هزاران فزون 
زمینش ز بس بیشه زعفرانچو دیبای زرد از کران تا کران 
ز بس گل که هر جای خودروی بود گلش خوردنی پاک و خشبوی بود 
درخت گلی بُد که چون آفتاب بدیدی شکفتی هم اندر شتاب 
فروتاختی سوی خورشید پستسر خویش چون مردم خورپرست
ز هر سو که خورشید گشتی ز برهمی گشتی آن همچنان سوی خور 
چو خورشید بفکندی از چرخ رخت شدی سست و لرزان بجای آن درخت 
چو یاری سرشک از غم رفته یار فشاند همی گل فشاندی ز بار 
گلی بود دیگر شکفته شگفتکه گفتی دم از مشک و عنبر گرفت
بُدی روز چون کف بخشنده بازبه شب چون کف زفت ماندی فراز 
گلی بُد که در تَف گیتی فروز شکفته بُدی تا گه نیمروز 
از آن پس چو چشمی بدی نیم خواب فشاندی ز مژگان چو گرینده آب 
چنین اشک تا شب همی تاختیگهش شب به یک بار بگداختی
درختان بُد از میوه دیگر به بار  که هر سال بار آوریدی دو بار 
شگفتی بدینسان بی اندازه بود اگر میوه گر نوگل تازه بود
شده خیره دل پهلوان زمین همی خواند بر بوم هند آفرین 
همی گفت هر چیزی گیتی فزای بدین هندوان داد گویی خدای
به رخ دوزخی وار تاراند و زشت به آباد کشور چو خرّم بهشت 
نه چندین شگفتست جای دگر نه زینسان هوای خوش و بوم و بر 
نه کس کور بینم نه بیمار و سُستنز اندام جایی کژ و نادُرست 
اگر چه کسی سالخوردست و پیر بسان جوان موی دارد چو قیر
دو هفته خوش و شاد بگذاشتند وز آن جا سپه باز برگاشتند 
رسیدند نزد جزیری فراز همه خار و خاره نشیب و فراز
 ز هر سو درو مار چون خیل مور زمین شوره آبش همه تلخ و شور 
در آن شوره خرم یکی گلستانگلش هر یک از نیکوی دلستان
تو گفتی که رضوان ز باغ بهشتز هر گل کجا یافت آن جا بکشت
در آن گلستان چشمه ای روشن آبخوش آبی به بویندگی چون گلاب 
به گرد سپهدار مهراج گفت که این چشمه دارد شگفتی نهفت 
بفرمود تا چادری پیش اوی ببردند پر زآن گل مشکبوی 
کشیدند از افراز آن چشمه باز همان گه زد آن چشمه جوش از فراز 
ز جوشش سبک آتشی بر فروخت بسوزید گل پاک و چادر نسوخت
سپهدار از آن کار پرسید چند که هست ایزدی یا طلسمست و بند 
بدو گفت مهراج کاندر جهان نداند درستی کسی این نهان 
کز آب آتش از چه فروزد همی رهد چادر و گل بسوزد همی 
بدان چشمه ژرف هم در شتاب شدند آشنا بر کسان زیر آب 
بگشتند و جستند هر سو پدیدکس از روی نیرنگ چیزی ندید
وز آن جا به کوهی نهادند روی جزیری که اسکونه بُد نام اوی 
کُهی پر گل گونه گون دامنش ز نیشکر انبوه پیرامنش 
چنان نار و نارنگ پر بار بود کز آن هر دو یکی شتروار بود 
ترنج از بزرگی چنان یافتند که هر یک به ده مرد برتافتند 
بر آن کُه رهی بود یک باره تنگحصاری بر افرازش ازخاره سنگ
میان حصار آبگیری فراخ زگِردش بسی گونه ایوان و کاخ
در و بام هر خانه از عود و ساج نگاریده پیوسته با ساج عاج 
چنان بود هر سنگ دیوار اوی که کشتی شدی غرقه از بار اوی
بسی گنبد از سنگ بُد ساخته  به سنگین ستون ها بر افراخته 
که کوشای صد مرد زورآزماینه برتافتی ز آن ستونی ز جای 
به گرشاسب مهراج گفت این حصار زنی کرد و مردی به کم روزگار 
به هر دو تن این کاخ ها کرده اند چنین سنگ ها زین کُه آورده اند 
به هندوستان نام این هر دو تن بُد از ماربی مرد و مارینه زن 
نبد یارگرشان درین کار کسزن و شوی بودند هم یار و بس
سپهدار شد خیره دل کآن شنیدهمیگفت کس زور ازینسان ندید 
همانا که هر گنبدی را به کار ببرداشتن مرد باید هزار 
کجا این چنین زور و این کار کرد چه داریم ما خویشتن را به مرد 
بر آن کُه ز جندال وز برهمن فراوان به هر گوشه دید انجمن 
یکی را بپرسید و گفت این حصار شما را ز بهر چه آید به کار 
بر همن چنین گفت کاین جایگاهنیایشگه ماست در سال و ماه 
به یزدان بدینجای داریم روی به گاه پرستش نتابیم روی 
چو دارد کسی با کسی داوری نیابد به داد از کسی یاوری 
بدین خانه آیند هر دو به هم نشینند و گویند هر بیش و کم 
همان گه ستمگر به زاری شود تبش گیرد و دیده تاری شود
نبیند دگر روشنی دیده را مگر داد بدهد ستمدیده را 
و دیگر چو بیمار افتد کسی در آن دردمندی بماند بسی 
بریمش درین خانه هنگام خواب بشویند چهرش به مشک و گلاب 
گرش بخش روزیست چون بُد نخست بماند به سه روز گردد درست 
وگر راه روزیش بست آسمان ببرد روانش هم اندر زمان 
در آن خانه شد پهلوان از شگفتبسی پیش یزدان نیایش گرفت 
دو صد شمع در گرد او بر فروخت به خروارها مشک و عنبر بسوخت 
وز آن کوه با ویژگان سوی دشتدر آمد یکی گرد بیشه بگشت 
ز ناگاه دیدند مرغی شگفتکه از شخ آن کُه نوا بر گرفت 
به بالای اسپی به برگستوان فروهشته پر بانگ داران نوان 
ز سوراخ چون نای منقار اوی فتاده در آن بانگ بسیار اوی 
برآنسان که باد آمدش پیش باز همی زد نواها به هر گونه ساز 
فزونتر ز سوراخ پنجاه بود که از وی دمش را برون راه بود 
به هم صد هزارش خروش از دهن همی خاست هر یک به دیگر شکن 
تو گفتی دو صد بربط و چنگ و نای به یک ره شدستند دستان سرای 
فراوان کس از خوشی آن خروش  فتادند و زیشان رمان گشت هوش 
یکی زو همه نعره و خنده داشتیکی گریه زاندازه اندر گذاشت
به نظاره گردش سپه همگروه وی آوا در افکنده زآنسان به کوه 
 چو بد یک زمان از نشیب و فرازبسی هیزم آورد هر سو فراز
یکی پشته سازید سهمن بلند پس از باد پرآتش اندر فکند
چو هیزم ز باد هوا بر فروختشد اندر میان خویشتن را بسوخت 
سپه خیره ماندند در کار اویهم از سوزش و ناله زار اوی 
به گرشاسب ملاح گفت این شگفتز روم آمد آرامش ایدر گرفت 
مرین را نه کس جفت بیند نه یار ولیکن چو سالش برآید هزار
ز گیتی شود سیر وز جان و تن بیاید بسوزد تن خویشتن 
ز خاکش از آن پس به روز درازیکی مرغ خیزد چو او نیز باز 
به روم اندر ایدون شنیدم کنون که بر بانگ او ساختند ارغنون
چو سه روز بگذشت و شد راست بادبه کشتی نشستند و رفتند شاد 
به دریا و خشکی ز کشتی کشانهر آن کس که داد از شگفتی نشان 
برفتند سیصد هزاران فزون بدیدند از جانور گونه گون 
چه برسانِ پرنده و چارپای چه هم گونه دیو مردم نمای 
یکی را سه رو پای و چنگل هزار یکی بهره را سر دو و چشم چار 
یکی را دُم ماهی و چنگ شیر دهان از بَرِ سینه و چشم زیر 
یکی را تن اسپ و خرطوم پیل  رخش لعل و اندام همرنگ نیل 
یکی را سر گاو و یشک نهنگ  یکی را تن مردم و شاخ رنگ 
همه زین نشان گونه گون جانور نمودند در آب با یکدگر 
چنین تا کُهی کآن نه بس دور بود سَر مرز او نزد فیصور بود 
از آن کوه ملاح بگذشت خواستسپهدار گفت این شتابت چراست
بمان تا برین گنگ باز از شگفت چه بینیم کان یاد باید گرفت 
بدو گفت ملاح مفزای کارکه ایدر بود کرگدن بی شمار
به بالای گاوی پر از خشم و شور یکی جانور مه ز پیلان به زور
سرو دارد از باز مردی فزون سرش چون سنان تن چو زآهن ستون 
به زخم سرو کُه درآرد ز پای زند پیل را بر رباید ز جای 
دلاور نبرد ایچ تیمار مرگمیان بست بر جنگ و پیکار کرگ 
بدو گفت کام من این بُد ز بخت که پیش آیدم روزی این رزم سخت 
کنون بور آهو تک کرگ دَن کمان و کمین من و کرگدن 
نبد باکم از ببر و از اژدها بدینسان ددی را چه باشد بها 
ز کشتی برون رفت بر زه کمان یکی کرگدن دید کآمد دمان 
چو نیزه سرو راست کرده بدوی همان گه خدنگی یل نامجوی 
بپیوست و ز آنسان در آهیخت زوش که پیکان به ناخن بُد و زه به گوش
زبان و گلوگاه و یک نیمه تن فرو دوخت با گردن کرگدن 
همه گنگ تا شب بدینسان بگشت بیفکند از آن کرگدن سی و هشت 
به خنجر سروشان بیفکند و برد بَر شاه مهراج و او را سپرد
سپه پاک و مهراج گشتند شاد بر او هر کسی آفرین کرد یاد
به دیگر جزیری رسیدند زودکجا نام آن جای هدکیر بود 
درو شهری آباد و شاهی بزرگسپاهی فراوان دلیر و سترگ 
چو گشت آگه آن شه ز مهراج شاه پذیره شدش در زمان با سپاه 
بیاراست ایوان و بزم شهی بسی گنج کرد از فشاندن تهی 
ببودند یک هفته دل شاد خوار به بازی و چوگان و بزم و شکار 
 سپهدار با سروران سپاه  همی گشت روزی به نخچیرگاه 
یکی بیشه دیدند پاک آبنوس درو چشمه ای همچو چشم خروس 
فراوان درو خیل ماهی به جوش  همه سرخ چون لشکر لعل پوش 
 ز هر سو سپه برگشادند دست به ماهی گرفتن به دام و به شست 
هر آن ماهیی کاو فتادی ز آب بدو باد جستی شدی سنگ ناب 
گرفتند از آن آزمون را بسینبد بهره جز سنگ با هر کسی
همان جای بُد مرغزاری فراخمیانش درختی گشن برگ و شاخ 
بلندیش بگذشته از چرخ تیر فزون سایش از نیم پرتاب تیر 
چوگاه خزان خاستی باد سختفروریختی پاک برگ درخت
همه برگ او یک یک اندر هوااز آن پس به مرغی شدی خوش نوا
چو سرما پدید آمدی اندکیاز آن مرغ زنده نماندی یکی
همیدون به کُه بر یکی خانه دیدفرازش یکی قصر شاهانه دید
بپرسید کآنجا که دارد نشستچنین گفت ملاح دانش پرست
که هست این پرستشگهی دلپذیربتی در وی از سنگ همرنگ قیر
سر از پیش چون غمگنی داشتهدو تا پشت و انگشتی افراشته
چو خور بر کشد تیغ هر بامدادزند بانگی آن بت کشد سردباد
چو دلداده یاری ز دلبر به رشکزمانی همی بارد از دیده اشک
پرستندگان طاس دارند پیشبرد هر کس از اشک او بهر خویش
شود ز اشک او درد بیمار کمز رخ زنگ بزداید از دیده تَم
و گر پنج گامی برندش ز جاینه نالد نه گرید نه استد به پای
شد و دید نیز از شگفت آنچه بودهمه دید و  زآن جا برفتند زود
رسیدند نزدیک کوهی بلندکه بود از بلندش بر مَه گزند
بسی کان گوهر بدان کوهسارهمان دیو مردم فزون از شمار
گروهی سیه چهر و بالا درازبه دندان پیشین چونان گراز
نه بر کوهشان مرغ را راه بودنه نیز از زبانشان کس آگاه بود
به دریا زدندی چو ماهی شناهبه کشتی رسیدندی از دور راه
همه روز از الماس تیغی به کفبدندی به هر جای جویان صدف
چو کشتی پدید آمدی هر کسیشدندی به کف درّ و گوهر بسی
خریدندی آهن به درّ و گهرنجستندی از بُن جز آهن دگر
ندانست کس بازشان راه راستکشان رای چندان به آهن چراست
چو کشتی مهراج و ایران گروهبدیدندی از تیغ آن بُزز کوه
گهرهای کانی از اندازه بیشببردند با هدیه هر یک به پیش
به گوهر بسی ز آهن آلات و سازز هر کس خریدند و گشتند باز
دو لشکر از ایشان توانگر شدندهمه پاک با درّ و گوهر شدند
برفتند و آمد جزیری پدیدکه آن جا به جز اژدها کس ندید
بدانسان بزرگ اژدها کز دو میلبیوباشتندی به دَم زنده پیل
ز زهرش همه کوه و هامون سیاهدم و دودشان رفته بر چرخ و ماه
یکایک پراکنده بر دشت و غارزبان چون درخت و دهان چون دهار
یکی را دُم از حلقه هر سو چو دامدمان آتش از زخم دندان و کام
یکی زوکشان گیسوان گرد خویشبه سر بر سرو رسته چون گاومیش
سپهبد برآراست رفتن به جنگگرفتند دامنش گردان به چنگ
همی گفت هر کس که با جان ستیزمجوی و مشو در دم رستخیز
بسی اژدهای دمان ایدرستکز آن کش تو کشتی بسی مهترست
چه با اژدها رزم را ساختنچه مر مرگ را بآرزو خواستن
همان نیز ملاّح فرزانه هوشمشو گفت و بر جان سپردن مکوش
بدین گونه مارست کز زهر تابکند مرد را آرزومند آب
لبان کفته و تشنه و روی زردبود دل طپان تا بمیرد به درد
همان نیز مارست کز زهر و خشمبمیرد هر آنکس برافکند چشم
وز آن مار کز دمش باد سمومبه مردار بر آید گدازد چو موم
دگر هست کز وی تن مرد خونگرد جوش وز پوست آید برون
و ز آن هم که گر کشته زهر اویکسی بیند او نیز میرد به بوی
همی بسپری روی دولت به پایهمی بر کنی بیخ شادی ز جای
سپهبد برآشفت و گفت از نبردمرا چرخ گردان نگوید که گرد
به یزدان که داد از بر خاک و آبزمین را درنگ و زمان را شتاب
کزین جایگه برنگردم کنونمگر رانده از اژدها جوی خون
نه بور نبردی به کار آیدمنه زایدر کسی دستیار آیدم
بگفت این و ترکش پر از تیر کرد بپوشید خفتان زره زیر کرد
سپر در برافکند با گرز و تیغ برون رفت برسان غرنده میغ 
سراسر شخ و سنگلاخ درشتبگشت و از آن اژدها شش بکشت
به شمشیر تنشان همه ریزه کردسرانشان ببرید و بر نیزه کرد
بیاورد تا دید یکسر سپاههمی گفت هر کس که این کینه خواه
دلاور چه گردست از اینسان دلیرکه بر هر که رزم آورد هست چیر
اگر اژدها باشد ار پیل و کرگبر تیغ او نیست ایمن ز مرگ
همانروز کردند از آن کُه گذررسیدند نزد جزیری دگر
جزیری ز بس بیشه نادیده مرزمرو را بسی مردم کشت ورز
گروه ورا پیشه پر خاش بوددرختان گل و کشتشان ماش بود
یکی مرده ماهی همان روزگاربرافکنده موجش به سوی کنار
ارش هفتصد بود بالای اوفزون از چهل بود پهنای او
دُمش بود بهری فتاده ز بندندانست انداز آن کس که چند
شده ده هزار انجمن مرد و زنبه نی پشتها بسته بر وی رسن
رسن ها سوی بیشه باز آختهکشان بر درخت و گره ساخته
ز گردش همه هر دو لشکر به جوشوزیشان رسیده به پروین خروش
زمان تا زمان خاستی موج سختگسستی رسن چند کندی درخت
کشیدند از آب اندورن همگروهبه کشتی به خشکی مر آن پاره کوه
برو ز آن سیاهان ابر کوه و راغشد انبوه بر بوم چون خیل زاغ
بسی گوهر و زر بُد اوباشتههمه سینش از عنبر انباشته
بیامد کس ِ شاه برداشت پاکبرون کرد دندانش و زد مغز چاک
بسی روغن از مغز و از چشم اویگرفتند افزون ز سیصد سبوی
دگر هر چه ماند از بزرگان و خردز بهر خورش پاره کردند و برد
بماند از شگفتی سپهبد به جایبدو گفت مهراج فرخنده رای
که این ماهیست آن که خوانند والوزین مه بس افتد هم ایدر به سال
بود نیز چندانکه بی رنج و غمبیوبارد این کشتی ما به دم
چو بینند کآید ز دریا برونز سهمش که کشتی کند سرنگون
ز بوق و دهل وز جرس وز خروشرسانند بر چرخ گردنده جوش
به هر سو سک ترش دارند و تیزبریزند تا زود گیرد گریز
همیدون یکی ماهی دیگرستکزین وال تنش اندکی کمتر ست
کجا او گذشت این دگر ماهیانگریزند و باشند تا ماهیان
یکی خُرد ماهیست با او به کینچو دیدش جهد در قفاش از کمین
به دندان گشایدش در مغز راهبرآرد سر از درد ماهی به ماه
دگر هست مرغی به تن لعل رنگمِه از باز چون او به منقار و چنگ
مرین ماهی خرد را دشمنستهمه روز گردانش پیرامنست
چو بیند کش اندر قفا ره گشاددرآید ربایدش ازو همچو باد
گر آن مرغ فریاد رس نیست زودبرآرد به سه روزش از مغز دود
به گیتی در از زندگان نیست چیزکش اندر نهان دشمنی نیست نیز
یکی گفت دیگر ز کشتی کشانکه دیدم دگر ماهیی زین نشان
ز دریا فتاده به خشکی بروندرازای او چار صدرش فزون
به کام اندرش کشتی لخت لختبدو در نه مردم بمانده نه رخت
شکمش هم آن گه که بشکافتیمیکی زنده ماهی دراو یافتیم
ز سی رش فزون بود از بیش و کمبُدش ماهیی یک رش اندر شکم
همان ماهی خُرد بُد زنده نیزازین به شگفت ار بجویی چه چیز 
شگفت خداوند چرخ بلندبه گیتی که داند شمردن که چند 
به هر کاری او راست کام و توانکه فرمانش بی رنج دارد روان
ز خون تبه مشک بویا کندز خاک سیه جان گویا کند
پدید آورد تیره سنگی در آبکند زو همان آب دُرّ خوشاب
به جایی که بایسته بیند همی ز هر سان شگفت آفریند همی
بدان تا شگفتی چنین گونه گونبود بر تواناییش رهنمون
بَر شاه آن جای از آن پس به کامببودند یک هفته با بزم و جام
چو ده روز رفتند ره کم و بیشجزیری دگر خرم آمد به پیش
ز هر گوشه صد میل بیشه به همچه رمح و چه صندل چه عود و بقم
همه مردمش پاک برنا و پیربه دیده چو خون و به چهره چو قیر
سَرِ بینی هر یک انداختهبسفته درو حلقها ساخته
دل ِ پهلوان گشت از آن بد گمانز ملاح پرسید هم در زمان
که این بد بدیشان چه بدخواه کردکشان سفت بینی و کوتاه کرد 
اگر تافتند این بزرگان ز راهز خردانش باری چه آمد گناه 
بخندید ملاح و گفت از نخستچنین آمد آیین ایشان دُرست
به فرزند ازین گونه مادر کندکش آرایش زر و زیور کند
همان هفته بُرّد که جان آیدشبسنبد به گوهر بیارایدش
ازین گر ترا جای بخشا یشستبه نزدیک ایشان از آرایشست
شنیدم ز دانای فرهنگ دوستکه زی هر کس آیین شهرش نکوست
بگشت آن همه کوه و بیشه سپاهشگفتی بسی بُد به هر جایگاه
چه از کان ارزیز وز سیم و زرچه ز الماس وز گونه گونه گهر
پراکنده سیماب در هر مغاکچه در بوته بگداخته سیم پاک
بد از کهربا زرد گوهر در آبدرخشنده چون در سپهر آفتاب
هم از جوز هندی فراوان درختجهان کرده پر بانگشان باد سخت
که بر شاخشان مرد اگر صدهزارشدندی نبودی یکی آشکار
از آن بوم و بر هر چشان رای بودببردند و رفتند از آن جای زود
سه هفته چو راندند از آن پس به کامبه کوهی رسیدند لانیس نام
جزیری به پهنای کشور سرشهمه بیشه واق واق از برش
به بالا ز صدرش فزون هر درختبه مه بر سر و بیخ بر سنگ سخت
همه برگشان پهن و زنگار گونز گیلی سپرها به پهنا فزون
بَر هر یکی چون سَر مردمانبرو چشم و بینی و گوش و دهان
چو ناگه وزیدی یکی باد تیزاز این بیشه برخاستی رستخیز
سَرِ شاخ ها سوی ساق آمدیوزآن هر سری واق واق آمدی
سپهبد ز ملاح فرزانه رایبپرسید کای راست بر رهنمای
برین کُه درختست چندین هزارهمه سبز و بشکفته با برگ و بار
ز چندین بر و برگ آمیختهچرا نیست جز اندکی ریخته 
بدو گفت هر بامدادی که مهرفروزد سپهر و زمین را به چهر
گلستان ازو سبز دریا شودسیه شعر این زرد دیبا شود
فغان زین درختان بخیزد همهگل و برگ و برشان بریزد همه
چنین تا به شب برگ ریزان بودوز آشوب هر دَد گریزان بود
چو طاووس گون روز پرد ز راغدرآید شب تیره همرنگ زاغ
ازین آب در جانور گونه گون بر آیند سیصد هزاران فزون
خورند این بر و برگ پاشیده پاکنمانند بر جای جز سنگ و خاک
چنین هر شب تیره پیدا شوندسپیده دمان باز دریا شوند
درخت آن گه از نو شگفتن گرد ز سَر شاخ و برگش شکفتن گرد
فشاند برو زو شب آید به باربرینگونه باشد همه روز گار
شگفتی بسست این چنین گونه گونکه آن کس نداند جز ایزد که چون
به هر کار کاو ساخت داننده اوستروان بخش و روزی رساننده اوست
ز مردم همان جا به هر سو رمهبدیدند پویان برهنه همه
به یک چشم و یک روی ویک دست وپایبه تک همچو آهو دونده ز جای
دو تن هم براستاده ز ایشان به همبدی یکتن از ما نه بیش و نه کم
نبد کار از جنگشان جز گریزهم از دور دیدی نکردی ستیز
سوی لشکر انگشت کرده درازچو مرغان سراینده چیزی به راز
به پیکارشان هر کس آهنگ کردکز آن نیم چهران برآرند گرد
سپهبد برآشفت از آهنگشانمجویید گفتا کسی جنگشان
کز ایشان کسی مرد پیکار نیستبه جز دیدن از دورشان کار نیست
هر آن کس که ننمایدت رنج و غمچو رنجش نمایی تو باشد ستم
ز مردم همانا که غمخواره ترنبودست از ایشان نه بیچاره تر
گر آید پیشم یکی را رواستکه تاوی خورد زین کجا خورد ماست
سواری برون شد شتابان چو تیرکز ایشان یکی را کند دستگیر
گریزنده یک پای از آنسان شتافتکه اسپ دوان گردش اندر نیافت
دگر دید بر مرز دریای ژرفیکی گرد کوه از سپیدی چو برف
همه کُه چنان روشن و ساده بودکه یک میل ازو تابش افتاده بود
که گر مرغ جُستی برو جای پایخزیدیش پای و نبودیش جای
برش آبگیری کزو جز بخارشناور نکردی به روزی گذار
همه آبش از عکس آن کُه به جوشچو زخم دهل صد هزاران خروش
بسی مرغ در گرد او رنگ رنگبه سر بر سر و رسته چون شاخ رنگ
ز پس هر یکی را دو پا و سه پیشدو منقار چون تیغ و چنگل چو نیش
چو دیدند مردم خروشان شدنددر آن زیر آن آب جوشان شدند
پس از یکزمان ز آن که ابری چو قیردرآمد بزد خیمه در آبگیر
از آن ابر مرغان در آن ژرف آبببودند پنهان هم اندر شتاب
شد ابر از پس کوه در نا پدیدفرو ماند هر کان شگفتی بدید
وز آن جا سوی کوه قالون شدندبه رنج گران یک مه افزون شدند
جزیری که مرزش نبد نیم پیجز از سنگ و خار و گزستان و نی
ز یک پهلوش بیشه آب کندکلاتی درو بُرز کوهی بلند
بپرسید ملاح را نامجویکه ایدر چه چیز از شگفتی بگوی
چنین گفت دانا کز آن روی کوهبسی لشکرند از یلان همگروه
سپاهی که سگسار خوانندشاندلیران پیکار دانند شان
چو غولانشان چهره چون سگ دهنبسان بزان موی پوشیده تن
به دندان گراز و به دو گوش پیلبه رخ زرد و اندام همرنگ نیل
گیاشان بود فرش و گستردنیز ماهی و از میوه شان خوردنی
ازین کوه سنباده و زر برندهم ارزیز و پولاد و گوهر برند
هر آن کآید ایدر خریدارشانز مرجان بود وز شبه بارشان
شبه هر چه مردست افسر کنندز مرجان زنان تاج و زیور کنند
بود اسپشان در یکی مرغزارز هر رنگ افزونتر از ده هزار
هر اسپی ز باد بزان تیزترز موج دمان حمله انگیز تر
چو روزی بود روز رزم و ستیزهمه زی فسیله شتابند تیز
جدا هر یک اسپی چو ارغنده شیربه خم کمند اندر آرند زیر
سوار آورند اندر آورد و کیننه بر تن سلیح و نه بر اسپ زین
کمندی و تیغی به کف تافتهبَش بارگی چون عنان بافته
سری حلقه در گرد بازو کمندسری گرد اسپ و میان کرده بند
گرفته ستونی ز ده رش فزوندو شاخ آهنین در سر هر ستون
بَرِ کوه در زخم هامون کننددل و چشم خور چشمه خون کنند
به نیرو کنند از بُن آسان درختبدرند از آوا دل سنگ سخت
به دریا شتابان نهنگ آورندبه شمشیر با شیر جنگ آورند
بسان گرازان بر اندام مردبه دندان بدرند درع نبرد
ربایند مرد از بر زین چو دودخورندش هم اندر زمان زنده زود
بسی رزم کردی به پیروز بختنیامدت پیش این چنین رزم سخت
بشد زآن دژم گرد لشکر پناههم آن جا به شب خیمه زد با سپاه
چو خور بُرد در قبه آبنوسپس پرده زرد مه را عروس
شب از رشک زد قیرگون جامه چاکز بر عقد پیرایه بگسست پاک
پدید آمد از بیشه وز تیغ کوهاز آن پیل گوشان گروها گروه
ز کار سپه آگهی یافتندبه پیکار چون شیر بشتافتند
بر اسپان بی زین به تیغ و کمندخروشان چو تندر در ابر بلند
به دست از درختان الماس شاخگرفتند ناورد دشت فراخ
بر آمد یکی نابیوسان نبرد که دریا همه خون شد دشت گرد
هر ایرانیی تاختند از کمینفکندند از ایشان یکی بر زمین
شد از تف تیغ آب دریا بخاررخ خور بخارید نیزه به خار
ز خون آب در جوی چون باده گشتبه کُه کهربا لعل و بیجاده گشت
چنان کوبش گرز و کوبال بودکه دام و دد از بانگ بی هال بود
شده عمرها کوته و کین درازدَمِ اژدهای فلک مانده باز
خدنگ از دل جنگیان کینه توزتبر مغز کاف و سنان سینه دوز
هوا چون شب و گرد چون دیو زشتدرو چو شهاب روان تیر و خشت
زمانه بر الماس مرجان نشانبه مرجان در از بردن جان نشان
ز جان سیر گردان و وز جنگ نهروان راهش و چهره را رنگ نه
ز چرح اختر از بیم بگریختهشب از روز دست اندر آویخته
پری بی هُش از بانگ و دیوانه دیوزمین پر ز آوای و کُه با غریو
به زنهار دهر و به افغان سپهربه اندرز ماه و به فریاد مهر
سپهدار بر کرد شولک ز جایکشیده به کین تیغ کشور گشای
ز هر سو که ناورد و پیکار کردکه و دشت گفتی به پرگار کرد
از آن پیل گوشان برآورد جوشبه هر گوشه زایشان سرافکند و گوش
فرو کوفت بر میسره میمنهصف قلب ببرید و زد بر بنه
به نیزه همی دیده مه بدوختتف خنجرش پشت ماهی بسوخت
از ایرانیان کس نبد دیده چیرچُنان دیو چهران گرد دلیر
نه از خشت و نز تیر غم داشتندنه از گرز وز تیغ سرگاشتند
چنان داشتند اسپ تازنده تیزکه گر حمله بردی به زخم از گریز
زدندی و از دست هر گرد گیرنه خشت اندر ایشان رسیدی نه تیر
کرا بر ربودندی از پشت زینبه زخم کمند از کمان وز کمین
یکی سرش کندی یکی دست و پایبخوردندی از پیش صف هم به جای
برینگونه کردند رزمی درشتاز ایرانیان چند خوردند و کشت
سبک داد فرمان سپهبد که جنگمجویید کس جز به تیر خدنگ
دلیران به تیر و کمان تاختندهمه نیزه و تیغ بنداختند
جهان گشت پر ابر الماس ریزشد از خاک و خون باد شنگرف بیز
هوا تیره چون پود بر تار شدبر آن دیو چهران جهان تار شد
ز غم نعره شان بانگ و فریاد گشتز پیکان جگر کان پولاد گشت
کس از خیل ایشان نبد مرد تیربماندند در زخم او خیره خیر
همی هر کسی تیر از آنکس که خستکشیدی چو ژوپین فکندی ز دست
از آن روز یک نیمه بگذشته بودکزیشان دو بهره فزون کشته بود
بُد از مغزشان وز دل و استخوانددان را بر آن دشت هر جای خوان
بر آن خوان کباب از جگرها به جوشسرانشان برو کاسه و سفره گوش
تو گفتی که ترگیست هر سو نگونفراز سپرهای شنگرف گون
گروهی به بیشه درون تاختنددگر تن به دریا در انداختند
سپه خار و خارا بهم بر زدندهمه بیشه را آتش اندر زدند
سراسر همه بیشه چون برفروختهر آن کس که بُد زنده زیشان بسوخت
بگشتند از آن پس کُه و مرغزارحصاری بدیدند بر کوهسار
ز ملاح گرشاسب پرسید و گفتکه این حصن را چیست اندر نهفت 
چنین گفت کاین حصن جایی نکوستستودان فرخ سیامک در اوست
بُنش بر ز پولاد ارزیز پوشبرآورده دیوارش از هفت جوش
سپه گردش اندر به گشتن شتافتبجستند چندی درش کس نیافت
چنین گفت ملاح پسش مِهانکه ناید در این را پدید از نهان
مگر جامه یکسر پرستنده واربپوشید و نالید بر کردگار
گوان جامه رزم بنداختندنیایش کنان دست بفراختند
هم آن گه شد از باره مردی پدیدکزو خوبتر آدمی کس ندید
چنان بد که چشمش سه بد هر سه باز دو از زیر ابرو یکی از فراز
فسونی به آواز خواندن گرفتز دلها تَفِ غم نشاندن گرفت
حصار از خروشش پرآواز شدز دیوار هر سو دری باز شد
یکی باغ دیدند خوش چون بهشتپر از تازه گل های اردیبهشت
نهادش چو رامش گوارنده نوشنسیمش چو دانش فزاینده هوش
از آوای رامش خوش انگیزترز دیدار خوبان دلاویزتر
درختی درو سرکشیده به ماهتنش سر به سر سبز و شاخش سیاه
هم برگ او چون سپرهای زردپدیدار در هر یکی چهر مرد
بسان کدو میوه زو سرنگونبه خوشی چو قند و به سرخی چو خون
سپهبد ز مرد سه چشمه سخنبپرسید کار درخت کهن
چنین گفت کآغاز گیتی درستنخست این بُد از هر درختی که رُست
همه ساله این میوه باشد برویچو شکر به طعم و چو عنبر به بوی
نگردد ز بُن کم بر و برگ و برچو کم شد یکی باز روید دگر
ور از یک زمانش ببویی فزونز خوشی ز بینی گشایدت خون
ازین هر که یک میوه یابد خورشیکی هفته بس باشدش پرورش
از آن خورد و مر هر کسی را بدادیکی کاخ را ز آن سپس در گشاد
پدید آمد ایوانی از جزع پاکچو چرخ شب از گوهر تابناک
همه بوم و دیوار تا کنگرهبه دُرّ و زبر جد درون یکسره
بلورینه تختی درو شاهواربتی بر وی از زر گوهر نگار
ز یاقوت لوحی گرفته به دستبر آن لوح خفته سر افکنده پست
ز بالاش تابوتی آویختههم از زر و از گوهر انگیخته
سپهبد دگر ره ز پالیزبانبپرسید و بگشاد گویا زبان
که این بت چه چیزست تابوت چیست همیدون نگارنده بر لوح کیست 
چنین گفت کاین تخت و ایوان و سازبدان کز سیامک بماندست باز
همین بزمگاه دلارای اوستدرین نغز تابوت هم جای اوست
چو رفت او  بتی همچنان ساختندبرینسانش بر تخت بنشاختند
بدان تا پرستندش از مهر اویگسارند با بت غم از چهر اوی
ازین کاخ هر کس که چیزی بردنیابد برون راه تا بگذرد
ازو یادگارست گفتار چندنوشته برین لوح بسیار پند
که ای آن که آیی درین خوب جایببینی ستودان من و این سرای
سیامک منم شاه والا گهرکه فرخ کیومرث بودم پدر
به فرمان من بود روی زمیدد و مرغ و دیو و پری و آدمی
شب و روز جز شاد نگذاشتمز هر خوشیی بهره برداشتم
بُد اندر جهان سال عمرم هزاردو صد بر وی افزون کم از سی و چار
چو گفتم جهان شد به فرمان منبگردید گردون ز پیمان من
پی اسپ عمرم ز تک باز ماندهمه کار شاهیم ناساز ماند
اگر چه بُدم گنج شاهی بسیبدانگونه رفتم که کمتر کسی
چنین آمد این گیتی بیدرنگنخستین دهد نوش و آن گه شرنگ
بدارد چو فرزند در بر به نازکند پس به زیر لگد پست باز
نگر تا نباشی برو استواربه من بنگر و زو دل ایمن مدار
درو کام دل کس به از من نراندنماند به کس بر چو بر من نماند
نبد شه ز من نامبردارترکنون هم ز من نیست کس خوارتر
سپهبد گشاد از مژه جوی خونبدو گفت کی نیکدل رهنمون
مرا باش بر پندی آموزگارکه باشد ز گفتار تو یادگار
چنین گفت دانا که باری نخستز هستی یزدان شو آگه درست
بدان کز خرد آشکار و نهفتیکی اوست دیگر همه چیز جفت
ازو ترس و از بد بدو کن پناهبتاب از گمان و بترس از گناه
مجوی آن گناهی که گویی نهانکنم تا نبیند کس اندر جهان
که گر کس نبیند همی آشکارنهان او همی بیندت شرم دار
چرا ز آن که سود اندر او ناپدیدتن پاک را کرد باید پلید 
سه بدخواه داری به بد رهنموندو پوشیده در تن یکی از برون
درونت یکی خشم و دیگر هواستبرون مستیی کز خرد نارواست
چو خواهی به هر درد درمان خویشبدار این سه را زیر فرمان خویش
خرد مستی و خشم را بند کنهوا بنده و دل خداوند کن
منه دل بدین گنبد چاپلوسکه گیتی فسانست و باد و فسوس
بود جُستنش کار دشخوارترچو آمد به کف نیست زو خوارتر
مجوی آز و از دل خردمند باشبه بخش خداوند خرسند باش
شب و روز گیتی اگر چه بسستترا نیست یکسر که جز تو کسست
بود خیره دل سال و مه مرد آزکفش بسته همواره و چشم باز
دهد رشک را چیرگی پر خردخورد چیز خود هر کس او غم خورد
سپهدار را ز آن سخن های نغزبیفزود زور دل و هوش مغز
فراوان گهر دادش و سیم و زرنپذرفت و گفت ای یل پُرهنر
من آن دادمت کآید از جان پاکتو آنم دهی کآید از سنگ و خاک
منت راه یزدان نمودم که چونتو زی دیو باشی مرا رهنمون
گرم رای باشد به زر و به دُرازین هر دو این کاخ من هست پُر
ولیکن چو با هر دوام کار نیستچو هرگز نباشدم تیمار نیست
کسی کو جهان را بود خواستارورا دانش آید نه گوهر به کار
اگر درّ را ارج بودی بسیبه خاک و به سنگش ندادی کسی
چه باید بدان شاد بودن که اویکند دوست را دشمن کینه جوی 
چو بنهی نگهداشتن بایدتچو بدهیش درویشی افزایدت
نه اینجات از مرگ دارد نگاهنه چون شد بوی با تو آید به راه
به شاه سیامک نگر کاین سرایبرآورد و این کاخ شاهانه جای
بدین بیکران گوهر پر بهاهم از چنگ مرگش نیامد رها
به چندین گهرها و زرّش که بودندانست یک روز عمرش فزود
مدان به ز دانش یکی خواستهکه ناید هم از دهش کاسته
روان را بود مایه زندگیرساند به آزادی از بندگی
بدین جایت از بد نگهبان بودچو زی در شدی توشه جان بود
ز دانش به اندر جهان هیچ نیستتن مرده و جان نادان یکیست
برهنه بُدی کآمدی در جهاننبد با تو چیز آشکار و نهان
چنان کآمدی همچنان بگذریخوروپوشش افزون ترا بر سری
ازو چون خور و پوشش آمد به دستدل اندر فزونی نبایدت بست
من این هر دو دارم که ایزد ز بختیکی مهربان دایه کرد این درخت
گهِ تشنگی بخشد از بیخم آببه گرما کند سایه ام ز آفتاب
خورم زین برِ او و پوشم ز برگمرا این بسندست تا روز مرگ
ببدخیره دل هر که زو این شنودنیایش فزودند و پوزش نمود
برون آمدند از برش همگروهبگشتند چندی در آن دشت و کوه
در آن کُه بسی کان سنباده بودهم الماس ویاقوت بیجاده بود
گل و نیشکر بیکران و انگبینگیادار و از میوه ها هم چنین
صف سنبل و بیشهٔ زعفرانروان لادن و بیشهٔ خیزران
چو دید آن چنان جای مهراج شاهدریغ آمدش کآن ندارد نگاه
ز گردان سری با سپه شش هزاربدان جایگاه کرد فرمانگزار
وزآن جنگی اسپان همه هر چه بودبه کشتی فکندند و راندند زود
چو رفتند یک ماه دیگر به کامیکی کوه دیدند بندآب نام
حصاری بر آن کُه ز جزع سیاهبلندیش بگرفته بر ماه راه
به زیر درش نردبانی ز سنگدرازاش سی پایه پهناش تنگ
مه از پیل بر نردبان یک سوارگرفته در حصن را رهگذر
یکی دست او بر عنان ساختهدگر زی سرین ستور آخته
بپرسید ملاح را پهلوانکه از چیست این اسپ و این نردوان
چنین گفت کاین را نهان ز اندرونطلسمست کآن کس نداد که چون
برین نردبان هر که بنهاد پایبه سنگ این سوارش رباید ز جای
یکی را به خفتان و درع و سپرفرستاد تا بر شود بر زبر
نخستین که بر پایه رفت ای شگفتسوار از بر اسپ جنبش گرفت
بزد نعره و سنگی انداخت زیرکه شد مرد بی هوش و بفتاد دیر
دگر شد یکی گردن افراختهیکی تنگ پنبه سپر ساخته
چنان سنگی آمدش کز جای خویشنگون از پس افتاده ده گام پیش
به هر پایه هر سنگ کآمد ز بربه ده من گرانتر بدی زآن دگر
چنین تا ز یک پایه بر چار شددو تن کشته آمد دو افکار شد
کسی بر نشد نیز و پس پهلوانبفرمود کندن بُن نردوان
چهی ژرف دیدند صد باز راهیکی چرخ گردنده بُده در به چاه
ز چه سار زنجیری آویختههمه زرّ و با گوهر آمیخته
سر حلقه در خم چرخ استواردگر سر کمر بر میان سوار
شکستند چرخ و به چه درفکندگسستند زنجیر یکسر ز بند
همان گه نگون شد سوار از فرازدرِ بسته حصن شد زود باز
سپهدار با ویژگان سپاهدرون رفت و کردند هر سو نگاه
سرایی بُد از رنگ همچون بهارزگرد وی ایوان بلورین چهار
ز هر پیکری جانور بیکراناز ایوان برآویخته پیکران
ز دیو و ز مردم ز پیل و نهنگز نخچیر و از مرغ و شیر و پلنگ
هم از خم آن طاق ها سرنگوننگاریده ازگوهر گونه گون
تو گفتی کنون کرده اند از نهادنه نم دیده زابر و نه گردی زباد
از آن گوهران درهم افتاده تابجهان کرده روشنتر از آفتاب
بسی شمع بر هر سوی از لاژورددو یاقوت بر هر یکی سرخ و زرد
به روز آن گهرها چو بشگفته باغبه شب هر یکی همچو روشن چراغ
ز پیش هر ایوان درختی ز زرزبرجد برو برگ و یاقوت بر
یکی تخت بر سایه هر درختز گوهر همه پایه و روی تخت
زمین جزع یک پاره هموار بودچنان کاندرو چهره دیدار بود
یکی خانه دیدند از لاژوردبرآورده از شفشه زر زرد
چو زلف بتان شفشها تافتهسراسر به یاقوت و دُر بافته
یکی پهن تابوت زرین درویجهان زو چو از مشک بگرفته بوی
بفرمود گرشاسب کآنرا ز جایبیارند بیرون میان سرای
نبد هیچکس رابه تابوت دستهر آن کسکه شد نزدش افتاد پست
وگر زآن گهرها ببردی کسیندیدی ره ار چند جُستی بسی
به دیگر یکی خانه رفتند بازبه زیر زمین کرده راهی دراز
همه خانه بُد سنگ همرنگ نیلدرو چشمه آب زرین دو میل
به هر میل بر مهره ای از بلوربرو گوهری چون درفشنده هور
گهرها فروزان در آب از فرازوزو نور داده همه خانه باز
برِچشمه تختی و مردی برویبمرده به چادر نهنبیده روی
یکی لاژوردینش لوحی زبربر آن لوح سی خط نبشته به زر
سپهبد به ملاح گفت این بخوانچو بر خواند گشتش زریری رخان
نبشته چنین بُد که هر کز خردبدینجای آرام من بنگرد
سزد گر ز مهر سرای سپنجبتابد دل و تن ندارد به رنج
منم پور هوشنگ شاه بلندجهاندار طهمورث دیو بند
حصار و طلسمی چنین ساختمبسی گوهر و گنج پرداختم
اگر بنگری کمترین گوهریبها بیشتر دارد از کشوری
به چندین گهر در سپنجی سرایچو من شه نمادم که ماند به جای
تو ای پهلوان گرد جوینده کامکه گرشاسب خواندت هر کس به نام
زما بر تو باد آفرین و درودچو آیی بدین کاخ ما در فرود
طلسمی که بستم تو دانی گشادچو دیدی ز کردار ما دار یاد
نگر تا نبندی دل اندر جهاننباشی ازو ایمن اندر نهان
که گیتی یکی نغز بازیگرستکه هزمانش نو بازی دیگرست
بهر نیک و هر بد که دارد پسیچنگیرد به یک سان بر آرام هیچ
چو بر قسمت از ابر و چو آتش ز سنگکجا روشنیش ندارد درنگ
دهد اندک اندک به روز درازپس آن گه ستاند به یک بار باز
سر رنج هر کس برد باز بُنکند تازه امید و تنها کهن
به تدبیر اویی و او همچنینبه تدبیر مرگ تو اندر کمین
بگرد از وی و سوی یزدان گرانبه هر کار فرمان یزدان بپای
اگر چه شهی بر زمین و زمانخداوند را بنده ای بی گمان
شوی کار دیو بدآیین کنیپس آنگاه بر دیو نفرین کنی
اگر دیو راهی نمودی درستنبردی ز ره خویشتن را نخست
مخور غم فراوان ز روی خردکه کمتر زید آن که او غم خورد
نشاید بداندیش بودن بسیکند زندگی تلخ بر هر کسی
درازست ره باشی پرداختههمه توشه یکبارگی ساخته
میفزای بار گنه کز گناهچو بارت گران شد بمانی به راه
بدان کوش کایزد چو خواندت پیشنیایدت شرم از گناهان خویش
به نزدیک تابوت زرّین مگردکه دیدی در آن خانهٔ لاژورد
که هست اندرو حلقه و یاره چندز حوا بماندست با گیسبند
همان جامه کایزد به دست سروشبه آدم فرستاد کآنرا بپوش
دگر گوهری کو دهد اندر آببه تاریکی اندر چو خورشید تاب
کزین جایگاه این سه چیز آن بَرَدکه یکی پیمبر بود با خرد
زید تا جهان باشد ایزدپرستنهان آورد آب حیوان به دست
چنان گردد این کاخ از آن پس نهانکه نیزش نبیند کس اندر جهان
دژم شد سپهدار و مهراج شاهگرستند یکسر سران سپاه
یکی بر گناهان و کردار خویشیکی بر غریبی و تیمار خویش
بر آن هم نشان کاخ بگذاشتندبه کشتی رَهِ دور برداشتند
سوی تاملی شاد خوار آمدندبه نزدیک دریا کنار آمدند
پر انبوه مردم یکی جای بودهمه بومشان باغ و کشت و درود
مگر آب خوش کان ز باران بدیبدلشان در اندوه و بار آن بدی
چو بر روی چرخ ابر دامن کشانشدی چون صدف های لولو فشان
همه کوزه و مشک ها در شتاببکردندی از قطر باران پر آب
چو باران نبودی جگر تافتهبُدندی لب از تشنگی کافته
بپرسید ازیشان یل نامدارکه باران نبارد چه سازید کار
بتی را نمودند و لوحی بهمز مس لوح و آن بت ز چوب بقم
بر آن لوح چون خط یویانیانچهل حرف و شش هیکل اندر میان
به باران چو داریم گفتند کامبرآریم این لوح و بت را به بام
پس این لوح و بت را به سر برنهیمنیایش کنان دست بر سر نهیم
برهنه زن و مرد هر سو بسیزاری زده بر میان هر کسی
بگرییم و آریم چندان خروشکه دریا و کُه گیرد از ناله جوش
همان گه بر آید یکی تیره ابرکند روی گردون چو پشت هژبر
چنان زآب دیده بشوید زمینکزو موج خیزد چو دریای چین
یل نیو گفتا کنون کایدریمکنید این که بی آزمون نگذریم
نگیرد چنین چاره گفتند سازجز آن گه که باشد به باران نیاز
کنون کآبمان هست ده ره بهمگرآییم ناید یکی قطره نم
کُهی بُد همان جا به دریا کنارگرفته ز دریا کنارش سنار
پر انبوه بیشه یکی کوه پیشنبد نیم فرسنگ پهناش بیش
چو موج فراوان فراز آمدیشدی آن کُه از جای و باز آمدی
گهی راست بودی دوان پیلوارگهی چون به ناورد گردان سوار
گمان برد هر کس که بُد سنگ پشتبرو رسته از بیشه خار درشت
سپهبد ز ملاح پرسش گرفتکزین کوه تازان چه دانی شگفت
چنین گفت ملاح دانش پژوهکزین سون دریا دگر هست کوه
جزیریست بر دامن رنگبارپر انبوه شهری بدو استوار
همه سنگ و خارست آن بوم و مرزتهی یکسر از میوه و کشت ورز
به یک روزه راهش جزیریست نیزپر از میوه و کشت و هر گونه چیز
چو آید بهار خوش و دلگشایبجنبد به موج آن جزیره ز جای
به کردار کشتی ز راه درازبیاید بر شهر آن گه فراز
همه شهر بیرون پذیره شوندبه شادی سوی آن جزیره شوند
ز نخچیر وز هیزم و خوردنیبرند آنچه شان باید از بردنی
چو سازند یکساله را کار پیشجزیره شود باز زی جای خویش
نه رنج و نه پیشه نشسته بجایهمه هر چه باید دهدشان خدای
چنین گفت گرشاسب با رهنمونکه روزی نبشته نگردد فزون
از آن بخش کایزد بکردست پیشنه کم گردد از رنج روزی نه بیش
دد و مرغ و نخچیر چندین هزارنگه کن که چون روز گشت آشکار
شوند از برون گرسنه با نیازچو شب شد همه سیر گردند باز
نه مر طمع را هستشان پیشه اینه دارند جز خوردن اندیشه ای
بگشتند دریا همه سر به سربدیدند چندان شگفتی دگر
پس آن گه ز دریا به هامون شدندبه یک ماه از چین به بیرون شدند
همی خواست مهراج تا پهلوانببیند همه کشور هندوان
نمایدش جاه و بزرگی خویشز بس شهر یاران کش آیند پیش
سوی شهرها شاد دادند رویشد این آگهی نزد هر نامجوی
شهان و مهان کارساز آمدندپرستنده از پیش باز آمدند
همه شهرها گشت آراستههمه راه پر نزل و پر خواسته
زمین باغ فردوس دیدار شدهوا ابر بارنده دینار شد
ز رامش جهان بانگ خنیا گرفتز بس درّ کشور ثریا گرفت
به دشتی رسیدند روزی ز راهبی اندازه بر وی ز طوطی سیاه
به تن پاک همواره زنگار گونبه چنگال و منقار گلنار گون
زمین از بس انبوه ایشان به همچو پاشیده بر سبز دیبا بقم
چو دریای اخضر که جوشان بوددرود موج بر سرخ مرجان بود
درختی در آن دشت بر آب کندگشن برگ و شاداب شاخ و بلند
کبودش تن و برگ یکسره سپیدسیه تخمش و بار چون مشک بید
همه شاخسارش پر از طوطیانبرو ساخته صدهزار آشیان
ز شاخ و تنش هر که کرد اندرونبه آهن خلیده همی زآزمون
همان گه خروشیدن آراستیوزو چون زرگ خون روان خاستی
گرفتند از طوطیان بی شماردگر روز کردند از آن جا گذار
هم از ره دگر شهری آمد به پیشدرو نغز بتخانه ز اندازه بیش
یکی بتکده در میان ساختهسر گنبدش بر مه افروختته
همه بوم و دیوار او ساده سنگتهی پاک از آرایش و بوی و رنگ
بتی ساخته ماه پیکر درویبرهنه نه زر و نه زیور بروی
میان هوا ایستاده بلندنه زیرش ستون و نه زافزار بند
بسی پیکر مردم ومرغ و بازز گردش میان هوا پر باز
گروهی شمن گرد او انجمنسیه شان تن و دل سیه تر ز تن
گرفته همه لکهن و بسته رویکه و مه زنخ ساده کرده ز موی
چنان بُد مر آن بی رهان را گمانکه هست او خدای آمده ز آسمان
فرشتست گردش بپر هر که هستبفرمانش استاده ایزد پرست
کسی را که بودی به چیزی هواچو زو خواستی کردی ایزد روا
از آهن بُد آن بت معلق به جایهمان خانه از سنگ آهن ربای
ازآن بُد میان هوا داشتهکه سنگش همی داشت افراشتته
به شهری رسیدند خرّم دگرپُرآرایش و زیب و خوبی و فر
ز بیرونش بتخانه ای پر نگاربراو بی کران برده گوهر به کار
نهاده در ایوانش تختی ز عاجبتی در وی از زر با طوق و تاج
درختی گشن رسته در پیش تختکه دادی بر از هفت سان آن درخت
ز انگور و انجیر و نارنج و سیبز نار و ترنج و بِه دلفریب
نه باری بدینسان به بار آمدیکه هر سال بارش دو بار آمدی
هر آن برگ کز وی شدی آشکاربُدی چهره آن بت بر و بر نگار
ز شهر آن که بیمار بودی و سُستچو خوردی از آن میوه گشتی درست
برو چون مهِ نو یکی داس بودکه تیزیش مانند الماس بود
کسی کاو شدی پیش آن بُت شمنفدا کردی از بهر او خویشتن
بن داس در نوک شاخی درازببستی و زی خود کشیدی فراز
فکندیش در حلق چون خم شستبه یک ره رها کردی آن گه ز دست
سرش را چو گویی برانداختیچنین خویشتن را فدا ساختی
همان گاه بودی به یک زخم سختتنش بر زمین و سرش بر درخت
سپهدار با ویژگان سپاهبه دیدار آن خانه شد هم ز راه
بدید آن درخت نوآیین به بارچو باغی پُر از گونه گون میوه دار
سرش سایه گسترده بر کاخ بربر از هفت گونه به هر شاخ بر
هم از کار آن داس بر خیره ماندبر آن بت بنفرید و ز آن جا براند
دگر جای خارا یکی کوه دیدبَرکوه شهری پُر انبوه دید
به دروازهٔ شهر بر راه برنشانده بتی دید بر گاه بر
برو مردم شهر پاک انجمنزده حلقه انبوه و چندی شمن
بدان اَنبه اندر یکی مرد مستبه سنگی بر از دور تیغی به دست
نشستی گهی گاه بر خاستیبر آن بت به مهر آفرین خواستی
پس از ناگه آن تیغ کش بُد به مشتبزد بر شکم برد بیرون ز پُشت
بد و نیک هرچ آشکار و نهفتدر آن سال بد خواست یکسر بگفت
سراینده تا گاهِ شب هم چنینهمی بود ازو خون روان بر زمین
از آن پس بیفتاد بی جان نگونبرو هر کس از دیده بارید خون
همی تیز تیز آتشی ساختندمرآن کُشته در آتش انداختند
بیامد یکی مرد از آن انجمنکه سوزد ز مهرش همی خویشتن
شمن هر چه بد گرد آتش فرازستادند با نیزه های دراز
به کف طاس روغن کهان و مهانچو تنبول و فوفلش اندر دهان
به پای اندرون موزه و بسته رویزده گرد آن مرد صف همچو کوی
ز نظاره برخاسته بانگ و جوشز بانگ دهل رفته بر مه خروش
بسی پند دادند و نشنید پندچو پروانه تن را به آتش فکند
بس از بیم آن خواست کآرد گریززدندش به نوک سنان های تیز
فشاندند روغن بر او تا به جایسبکتر برافروخت سر تا به پای
چو انگشت گشت آتش و رفت دودببردند خاکستر هر دو زود
بر گنگ و حج گاهشان تاختندبد آن آب گنگ اندر انداختند
چنین آمد آیین شان از نخستبُد آیین و کیشی بی اندام و سُست
به یزدان به دین و دل افروختنرسد مرد نز خویشتن سوختن
خردمند کوشد کز آتش رهدنه خود را بسوزنده آتش دهد
خود ابلیس کز آتش تیز بودچه پاکیش بُد یا چه آمدش سود
گر آتش نمودی بدارنده راهنبودی به دوزخ درش جایگاه
به شهری دگر دید بتخانه ایشمن مرو را هر چه فرزانه ای
بدو در بُتی از خمآهنش تنز بُسدش تاج از گهر پیرهن
کف دست ها بر نهاده به بریکی دستش از سیم و دیگر ز زر
به پیش اندرش حوضی از زر نابروان از دهانش در آن حوض آب
کرا بودی از درد بیمار تنبشستی بدان آب در خویشتن
سه ره بردی از پیش آن بت نمازسوی دست او دست بردی فراز
بت ار دادی آن دست کز زر بودبدان درد در مُردی آن مرد زود
ور آن دست دادی که بودی ز سیمبرستی ز بیماری و ترس و بیم
هر آن کز پی مزد آن هندوانفدا کردی از پیش آن بت روان
پُر آتش یکی طشت رخشان ز زرز خیره سری بر نهادی به سر
زدی پیش او زانوان بر زمینهمی خواندی از دل به مهرآفرین
چنین تاش دو دیده بگداختیز مژگان به رخسار بر تاختی
به شهری دگر با سپه برگذشتبه ره گنبدی دید بر پهن دشت
درو چشمهٔ آب روشن چو زنگبه نزدش بتی مَرد پیکر ز سنگ
بدان شهر در هر زنی خوبرویکه تخمش برآورد نبودی ز شوی
چو هم جفت آن بُت شدی در نهفتاز آن پس برومند گشتی ز جفت
هر آن کس که کردی بکندنش رایفتادی همانگاه بی جان بجای
دگر دید شهری چو خرّم بهاردرود نغز بتخانه ای زرنگار
میانش درختی چو سرو سهیکه از بار هرگز نگشتی تهی
هم از بیخ او خاستی کیمیابُدی برگ او چشم را توتیا
چو جستنی کسی با کسی گفتگویبه چیزی که سوگند بودی بدوی
ز پولاد سندانی اندر شتابببردی چو تفسیده اخگر ز تاب
یکی برگ تَر زآن درخت ببرنهادی ابر دست و سندان ز بر
کفش سوختی گر بُدی آهمندو گر راست بودی نکردی گزند
ز پیروزه و نعل رویین دگرنبد چیزی آن جا بهاگیرتر
کزین هر دو از بهر نام بلندکُلا ساختی مرد و زن گیس بند
ستاره پرستان بسی چند نیزشگفت اندر آن کیش بسیار چیز
همان نیز کز پیش گاو و خروسشدندی پرستنده و چاپلوس
کُهی دید دیگر ز سنگ سیاهبرون کرده زین سو بر آن سوی راه
کرا کس ندانستی از بوم هندکه او پاکزادست و گر هست سند
برفتی به سوراخ آن که فرازگرفتی دو دست از پَسِ پشت باز
گذشتی ازو گر بُدی پاکزادبماندی میانش ار بُدی بد نژاد
به کوهی دگر بود کانی فراخفرازش کمر بست و بن دیو لاخ
ز بالا دو چیز از دل سنگ سختبرون تاخته چون ترنج از درخت
یکی زو بنفش و دگر همچو زربنفشیش پا زهر و زهر آن دگر
نُبد ره بدو لیکن از ناگزیرز بالا فکندیش هر کس به تیر
همی داشتندی مر آنرا نگاهنبردی کس آن جز سوی گنج شاه
کُهی دید دیگر به مه بر سرشیکی کان آهن شگفت از برش
که بی آتش آهنش بُد لعلگونچنان بود کز آتش آری برون
به شب همچون اخگر نمودی ز تابگرفتی به روز آتش از آفتاب
چو الماس پولاد بگذاشتیوز آب اندرون سنگ برداشتی
شدی دور ازو سنگ آهن ربایوز آتش ببودی سیه هم بجای
از آن تیغ مهراج بودی و بسندادی از آن تیغ هرگز به کس
یکی تیغ ازو تا ببردی به گنجبه کف نامدی جز به بسیار رنج
کرا ریختندی بدان تیغ خوننرفتی ز تن خون مگر زاندرون
دگر دید از اینگونه چندان شگفتکه نتوان شمارش به سالی گرفت
همه کام مهراج از بد ز پیشکه بیند همه پادشاهی خویش
جهان پهلوان را ز هر سو که خواستهمی گشت زینگونه سه سال راست
به آزادیش نزد ضحاک شاهنبشتی همی نامه هر چند گاه
به هر نامه صد لابه آراستیببودنش پوزش همی خواستی
سمند سرافراز را کرد زینبرون رفت تنها به روز گزین
همه برد هر چش نبود چاره زویسوی شام زی بادیه داد روی
یکی ریدک ترک با او به راهز بهر پرستش به هر جایگاه
بدان بی سپاه و بنه شد برونکه تا کس نداند و چرا و نه چون
شتابان نوند ره انجام راعنان داده او را و دل کام را 
شده چشم چشمه ز گردش به بنددل غول و دیو از نهیبش نژند
سنانش از جهان کرده نخچیر گاهکمانش از کمین بسته بر چرخ راه
بدام کمندش سر نرّه گورز شمشیرش اندر دل شیر شور
ز ناگه بَرِ مرغزاری رسیددرختان بار آور و سبزه دید
لب مرغ هر سو گلی مشکبوییکی چشمه‌ چون‌ چشم سوکی دروی
همه آب آن چشمه روشن چو زنگچو از آینه پاک بزدوده زنگ
تو گفتی یکی بوته بد ساختهبه جوش اندرو سیم بگداخته
بر چشمه شیری شخاوان زمیندمان بر دم گوری اندر کمین
چو زد چنگ و گور اندر آورد زیربزد بانگ بر باره گرد دلیر
سبک دست زی تیغ پیکار کردبه زخمی که زد هر دو را چار کرد
درختی بکند از لب آبگیربرافروخت آتش ز پیکان تیر
بر آن آهنی نیزه یل فکنزد آن گور چون مرغ بر بابزن
هنوز اندر این کار بد سرفرازرسیدند دو پیک نزدش فراز
 ز خاور همی آمد آن و این ز رومبسی یافته رنج و پیموده بوم
درخت و گل و سبزه دیدند و آبزمین جای نخچیر و آرام وخواب
زیک دست گور و زیک دست شیرمیان کرده آتش سوار دلیر
چران گردش اندر نوند سمندگره کرده بر یال خم کمند
برو زآن شگفت آفرین خوان شدندبه خوردن نشستند و هم خوان شدند 
هنوز آن دو تن را کبابی به دستشده خیره از خورد او وز نشست
بُد از گور پردخته گرد دلیرهمه خورده تنها و نابوده سیر
چو پردخت از آن هر دو پرسش گرفتکه هر جا که دانی چیزی شگفت
بگویید تا دانش افزایدممگر دل به چیزی بیارایدم
جدا هر یکی هر شگفتی که دیدهمی گفت هر گونه و او شنید
سخن راند رومی سر انجام کارکه دیدم شگفتی در این روزگار
شه روم را دختری دلبر است که از روی رشک بت آزرست
نگاری پری چهره کز چرخ ماهنیارد بدو تیز کردن نگاه
دل هر شهی بسته مهر اوستبر ایوان‌ها پیکر چهر اوست
ز بهرش پدر رنگی آمیختستکمانی ز درگه برآویختست
نهادست پیمان که هرک این کمانکشد دختر او را دهم بی گمان
ز زور آزمایان گردن فرازبسا کس شد و گشت نومید باز
بشد شاد از این پهلوان گزینچو باد بزان اندر آمد به زین
به جان بوبه یار دلبر گرفتشتابان ره رومیه برگرفت
دو منزل چو بگذشت جایی رسیدبرهنه بسی مردم افکنده دید
یکی بهره خسته دگر بسته دستغریوان و غلتنده بر خاک پست
بپرسید کز بد چه اوفتادتانبه کین دام بر ره که بنهادتان
خروشید هر یک دل از غم ستوهکه بازارگانیم ما یک گروه
ز مصر آمده روم را خواستهابا کاروانی پر از خواسته
چهل دزد ناگاه بر ما زدندببستندمان و آنچه بُد بستدند
هنوز آنک از پیش تو گردشانرسی گر کنی رای ناوردشان
بشد تافته دل یل رزمجویسوی رهزنان رزم را داد روی
بر آن رهزنان بانگ برزد به کینکه گیرید یکسر سر خویش هین
وگرنه همه کاروان بار بستستانم کنم تان به یک بار پست
شما را بس از بازوی چیر مناگر تان رود سر ز شمشیر من
به پاسخش گفتند بد ساختیکه بر دم ما طمع را تاختی
نه هرکز پی شیر شد خورد گوربسا کس که از شیر شد بخت شور
سپردی تو نیز اسپ و کالای خویشببینی کنون پست بالای خویش
سپهبد برانگیخت سرکش سمندبه ناوردشان گردی اندر فکند
درآمد چنان زد یکی را به تیغکجا سرش چون ماغ بر شد به میغ
بزد نیزه بر گرده گاه دو گردبرآورد و زد بر زمین کرد خرد
یکی را چنان کوفت گرز از کمینکه ماند اسپ با مرد زیر زمین
دگر یکسر از زین فرو ریختندبه زنهار از او خواهش انگیختند
برهنه به جان دادشان زینهارستد اسپشان و آلت کارزار
بر مردم کاروان رفت شادجدا کالای هر کسی باز داد
بدادش به بازارگانان همهشدندش روان تا سوی رومیه
دگر هر که در ره ز رفتن بماندبه هر اسپ دزدی یکی بر نشاند
سوی رومیه شاد با فرّهیشد و کرد با کاروان همرهی
یکی مایه ور مرد بازارگانشد از کاروان دوست با پهلوان
همه راهش از دل پرستنده بودبه هرکارش از پیش چون بنده بود
نهان راز خود پهلوان سر به سربُدش گفته جز نام خویش و پدر
همه راه اگر تازه بُد گر کهنز دخت شه روم بُدشان سخن
چو آمد بر میهن و مان خویشببردش به صد لابه مهمان خویش
به آزادی از پیش شایسته جفتهنر هر چه زو دید یکسر بگفت
یکی باغ بودش در اندر سرایبر قصر شه چون بهشتی به جای
شراعی بزد بر لب آبگیربیاراست بزمی خوش و دلپذیر
شب و روز با باده و رود و سازهمی داشتش جفت آرام و ناز
گهی خفت بر سنبل و نو سمنگهی با چمانه چمان در چمن
زنی دایه دختر شاه بودکه بازارگان را نکو خواه بود
بر جفت بازارگان بامدادبیامد به سویش همی مژده داد
هوا زی جهان پهلوان را بدیدکه در سایه گل همی مل کشید 
یکی سرو با خسروانی قبایبه فر و به فال همایون همای
رخش چون مه گرد ماه بلندزمانه برافکنده مشکین کمند
دو لب همچو بر لاله گرد عبیرتو گفتی که حورا بدش داده شیر
چو شد سیر شیر و به دایه سپردلبش را به گیسوی مشکین سترد
همیدن همه فرّ و فرهنگ و هوشدراو زور مردی و گردی به‌جوش
بپرسید کاین مرد بی واره کیستکه گستاخی اش سخت یکبارگیست
ندانمش گفت از هنر وز نژادولیکن چنان کس ز مادر نزاد
به زور و سواری و فرهنگ و برزبدرّد دل کوه خارا به گرز
از آهنش نیزه و وز آهن سپرمیان تنگ و پیلش درآید ببر
به دیدار رخ جان فزاید همیبه گفتار خویش دل رباید همی
به دل دختر شاه را هست دوستهمه روز گفتارش از چهر اوست
بدین روی با شویم آمد ز راهبخواهد کشیدن کمان پیش شاه
هم از راه و دزدان بگفت آنچه بودسلیحش همه یک یک او را نمود
ببد دایه دل خیره آمد دوانسخن راند با دختر از پهلوان
ز گردی و از رای و فرهنگ اوز بالا و از فرّ و اورنگ او 
شکیبایی از لاله رخ دور شدهوا در دلش نیش زنبور شد
همی بود تا گشت خور زردفامز مهر سپهبد برآمد به بام
بدیدش همان جای بر تخت خویشیکی بالغ و کاله می به پیش
جوانی که از فر و بالا و چهرهمی مه بر او آرزو کرد مهر
دو رخ چون دو خورشید سنبل پرستبرآورده شب گرد خورشید دست
یکی مرغ بر شاخسار از برشکه بودی گه بزم رامشگرش
از و مه دگر مرغکی خوبرنگهمی آشیان بستد از وی به چنگ
سپهدار بگشاد بر مرغ تیرز پروازش افکند در آبگیر
به دل گرمتر شد بت ماه چهرهوا کرد جانش به زندان مهر
شد از بام لاله زریری شدهدونوش از دم سرد خیری شده
تو گفتی که از آتش مهر و شرمبه تن برش هر موی داغیست گرم
چو دایه رخ ماه بی رنگ دیدبپرسید کت نو چه انده رسید
جهان بر دلم زین ترنجیده شدبگو کز که جان تو رنجیده شد
چنین داد پاسخ کزاین نوجواندلم شد به مهر اندورن ناتوان
یکی بند بر جانم آمد پدیدکه دارد به دریای بی بن کلید
بترسم که با آن کمان سر فرازنتابد بماند غم من دراز
به بد نام هر جای پیدا شومبه نزد پدر نیز رسوا شوم
درین ژرف دریای نابن پذیرتو افکندیم  هم توام دست گیر
به نزدیک او پای مَردم تو باشبدین درد درمان دردم تو باش
بگفت این و از هر دو بادام مستبه پیکان همی سفت دُر بر جمست
بدو دایه گفت آخر انده مدارکه کارت هم اکنون کنم چون نگار
به هر کار بر نیک و بد چاره هستجز از مرگ کش چاره ناید به دست
چو از باغ چرخ آفتاب آشکاربه رنگ خزان شست رنگ بهار
بر جفت بازارگان رفت زودز هر در سخن گفت و چندی شنود
ز گرد سپهبد بپرسید بازکه چون است مهمانت را کار و ساز
ز کار کمان هیچ دارد پسیچسخن راند از دختر شاه هیچ
چنین داد پاسخ که تا روز دوشبه یادش دمادم کشیدست نوش
به می در همی زد دم سرد و گفترخش دیدمی باری اندر نهفت
که گر بینمش چهر و افتد خوشمکمان را به انگشت کوچک کشم
تو نیز ار توان چاره ای کن ز مهرکه یکدیگران را ببینند چهر
ز دیدار باشد هوا خاستنز چشمست دیدن ز دل خواستن
گمانست در هر شنیدن نخستشنیدن چو دیدن نباشد درست
بدو گفت دایه که کامت رواستاگر میهمان ترا این هواست
تو رو ساز کن گلشن و گاه راکه امشب بیارم من آن ماه را
به پیمان که غواص گرد صدفنگردد کزو گوهر آرد به کف
در گنج را دزد نکند تباهکلیدش نجوید سوی قفل راه
برین بست پیمان و چون باد تفتبر دختر آمد بگفت آنچه رفت
وزین سو بشد جفت بازارگانبه مژده بر شاه آزادگان
بسازید در گلشن زرنگاریکی بزم خرّم تر از نو بهار
به خوبی چو گفتار آراستهبه خوشی چو با ایمنی خواسته
به جام بلورین می آورد ناببرآمیخت با مشک و عنبر گلاب
یل پهلوان را به شادی نشاندز رامش برو جان همی برفشاند
چو شب گیل شد در گلیم سیاهورا زرد گیلی سپر گشت ماه
همه خاک ازو گرد مشگین گرفتهمه آسمان نوک ژوپین گرفت
سوی باغ با دایه ناگه ز در		درآمد پری چهره سیمبر
یکی جام زرین به کف پُر نبید		چو لاله می و جام چون شنبلید
نهفته به زربفت رومی برش		ز یاقوت و دُر افسری بر سرش
خرامان چو با ماه پیوسته سرو		ز گیسو چو در دام مشکین تذرو
دو زلفش به هم جیم و در جیم دال		دهن میم و بر میم از مشک خال
دو برگ گلشن سوسن می سرشت		دو شمشاد عنبرفروش بهشت
زنخدان چو از سیم پاکیزه گوی		که افتد چه از نوک چوگان دروی
دو بیجاده گفتی که جادو نهفت		میانش به الماس اندیشه سفت
بناگوش تا بنده خورشیدوار		فرو هشته زو حلقه گوشوار
دو مه بُد یکی گرد و دیگر دو نیم		یکی ماه از زر و دیگر زسیم
به مه برش درعی ز مشک و عبیر		گه از تاب چین ساز و گه خم پذیر
شکنش آتش نیکوی تافته		گره هاش دست زمان بافته
دو بادام پربند و تنبل پرست	 	یکی نیم خواب و یکی نیم مست
بزان بادش از زلفک مشکبیز		همه ره چو از نافه بگشاده زیز
ز خنده لبش چشمهٔ نوش ناب		فسرده درو قطره بر قطره آب
به سیمین ستون خم درآورد و گفت		که بایدت مهمان ناخوانده جفت
سپهدار بر جست و بردش نماز		مزیدش دو یاقوت گوینده راز
بدو اندر آویخت آن دلگسل		چو معنی ز گفتار شیرین به دل
به رویش بر از بسد در پوش		همی ریخت بر لاله شکر ز نوش
نشستند و بزمی نو آراستند		به می یاد یکدیگران خواستند
بلورین پیاله ز می لاله شد		کف می کش از لاله پر ژاله شد
سپهدار گفتا سپاس از خدای		که جفتی مرا چون تو آمد به جای
گر از پیش دانستمی کار تو		همین فرّ و خوبی و دیدار تو
بُدی دیرگه کان کمان پیش شاه		کشیدسمتی بر امید تو ماه
پری چهره گفت ایچ پیل آن توان		ندارند پس چون توانی تو آن
بدان کان کمان آهنست اندرون		دگر چوب و توز و پیست از برون
بمان تا چنان هم کمانی دگر		من از چوب سازم نهان از پدر
بخندید یل گفت از آنگونه پنج		کشم چونت دیدم ندارم به رنج
کشیدن چنان چرخ کار منست		مرا هست موم ار ترا آهنست
چو خر در گل افتد کسی نیکتر		نکوشد به زور از خداوند خر
از آن پس به می دست بردند و رود		بر هر دو دایه سرایان سرود
به جز دایه دمساز با هر دو کس		زن خوب بازارگان بود و بس
شده غمگسارنده شان هر دو زن		گه این پای کوب و گه آن دست زن
همه بودشان رامش و میگسار		مل و نقل و بازی و بوس و کنار
به یک چیزشان طبع رنجور بود		که انگشت از انگشتری دور بود
چو از باده سرشان گرانبار شد		سمن برگ هر دو چو گلنار شد
یل نیو را کرد بدرود ماه 		بشد باز گلشن به آرامگاه
همه شب دژم هر دو از مهر و تاب		نه با دل شکیب و نه با دیده خواب
بیابانی آمدش ناگاه پیش		ز تابیدن مهر پهناش بیش
چه دشتی که گر وی بود چرخ ماه		درو ماه هر شب شدی گم ز راه
همه دشت سنگ و همه سنگ غاز		همه خار ریگ و همه ریگ مار
هواش آتش و اخگر تفته بوم		گیاهش همه زهر و بادش سموم
نه مرغ اندرو دیده یک قطره آب		نه غول اندرو بوده فرزند یاب
رهی سخت چون چینود تن گداز		تهی چون کف زُفت روز نیاز
درشتیش چون داغ در دل نهان		درازیش چون روزگار جهان
ز رنجش به جز مرگ فریاد نه		درو هیچ جنبنده جز باد نه
به پهنای گیتی نشیب و فراز		تو گفتی که فرشیست گسترده باز
ز شوره درو پود و از ریگ تار		ز دوزخش رنگ و ز دیوان نگار
درین راه ده روزه چون تاختند		بیابان پهن از پس انداختند
به ره چشمهٔ آب دیدند چند		میانشان برآورده میلی بلند
بر آن میل چوبی زنی ساخته		دو دست از فراز سرافراخته
هر آنچ از هوا مرغ از گونه گون		بر آن بر نشستی فتادی نگون
فرو ریختی هر دو پرّش بجای		از آن پس نرفتی همی جز به پای
همه دشت از آن مرغ بد گردگرد		فکندند بسیار و کشتند و خورد
زمانی به هم چشم کردند گرم		از آن پس گرفتند ره نرم نرم
به کوهی رسیدند سر بر سپهر		بر آن کُه دژی برتر از اوج مهر
چو ماری رهش یکسر از پیچ و خم		گرفته به دُم کوه و کیوان به دَم
تو گفی تنی بُد مگر چرخ ماه		مر او را سر آن کوه و آن دژ کلاه
بیابان ز صد میل ره یکسره		گذر زیر آن دژ بُد اندر دره
در آن دژ یکی زنگی پرستیز		که غول از نهیبش گرفتی گریز
به چهره سیاه و به بالا دراز		به دیدار دیو و به دندان گراز
تو گفتی تن و چهر آن دیو زشت		خدای از دم و دود دوزخ سرشت
سیاهی که چون جنگ برگاشتی		به کف سنگ و پیل استخوان داشتی
ز که دیدبانش سرافراخته		ز صد میل ره دیده برساخته
اگر مردم اندک بدی گر بسی		ابی باژ نگذشتی از وی کسی
پس کوه شهری پرانبوه بود		بسی ده به پیرامن کوه بود
همه کس بد از بیم فرمانبرش		خورش ها همی تاختندی برش
به نوبت ز هر دژ کنیزی چو ماه		ببردی و کردی مر او را تباه
چو گرشاسب نزدیکی دژ رسید		ز که دیدبانش جرس برکشید
سبک جست زنگی ز آوای زنگ		شده مست و طاسی پر از می به چنگ
همان سنگ و پیل استخوان در ربود		دوید از پس پهلوان همچو دود
چنان نعره ای زد که کُه شد نوان		نگه کرد ناگه ز پس پهلوان
دمان زنگییی دید چون کوه قار		که ابلیس ازو خواستی زینهار
سیه کردی از چهره گیتی فروز		شب آوردی از سایه مهمان روز
به بالا چو بر رفته بر ابر ساج		به دندان چو دو شانه بر هم ز عاج
دو چشمش چو دو گنبد قیرفام		نشانده ز پیروزه مینا دو جام
سر بینی اش چون دو رزون به هم		گشاده ز دوزخ درو دود و دم
به سر برش موی گره بر گره		چو بر قیر زنگار خورده زره
ز دیوست گفتیش رفتار و پی		درازا و رنگ از شب ماه دی
سوی پهلوان چون که غضبان ز چنگ		رها کرد آن سی منی خاره سنگ
سر از سنگ او پهلوان درکشید		ازو رفت و شد در زمین ناپدید
دگر ره برآمد پر از چین رخان		زدش بر سر آن شاخ شاخ استخوان
بخستش دو کتف و سپر کرد خرد		به گرز اندر آمد سپهدار گرد
چنان زدش بر سر به زور دو دست		که با مغز و خون چشمش از سر بجست
به خنجر سرش را ز تن برگرفت		سوی دیدبانش ره اندر گرفت
پیاده بر آن کُه چو نخجیرگیر		همی شد ز پس تا فکندش به تیر
بشد تا بد آن شهر از آن سوی کوه 		به پرسش گرفتند گردش گروه
که با تو درین ره که بد یارمند		که رستی ز دست سیه بی گزند
چنین گفت کان کاو مرا زشت خواه		چنان باد غلتان به خون کان سیاه
سر زنگی از پیش ایشان فکند		برآمد ز هرکس خروشی بلند
دویدند هر کس همی دید پست		گرفت آفرین بر چنان زور و دست
به تاراج دژ تیز بشتافتند		بسی گوهر و سیم و زر یافتند
به خروارها عنبر و زعفران		هم از فرش و از دیبهٔ بی کران
غریوان یکی ماهرخ دختری		کزآن شهر بودش پدر مهتری
ببردند نزد پدر هم به جای		فکندند دژ پست در زیر پای
بسی هدیهٔ گونه گون ساختند		به پوزش بر پهلوان تاختند
بلابه شدند آن همه شهریار		که بر ما تو باش از جهان شهریار
نپذرفت و یک هفته آنجا ببود		سر هفته زان شهر برکرد زود
یکی پیک با باد همراه کرد		پدر را ازین مژده آگاه کرد
ببد شاد اثرط سپه برنشاند		بدان مژده ده زر و گوهر فشاند
یکی هودج از ماه زرین سرش		زده کله زربفت از برش
بیاراست بر کوههٔ زنده پیل		زد آذین ز دیبا و گنبد دو میل
جهان شد بهاری چو باغ ارم		زبرگرد مشک ابر و باران درم
همه پشت پیلان درفشان درفش		ز دیبا جهان سرخ و زرد و بنفش
سواران همه راه بر پشت زین		ستاننده رطل این از آن آن از این
ز بس برهم آمیخته مشک و می		بر اسبان شده غالیه گرد و خوی
بر آیین آن روزگار از نخست		ز سر باز بستند عقدی درست
به هر برزن آواز خنیاگران		به هر گوشه ای دست بند سران
هم از ره عروس نو و شاه نو		در ایوان نشستند بر گاه نو
گشاد اثرط از بهر جفت پسر		یکی گنج یاقوت و دُر سر به سر
براو کرد چندان گهرها نثار		که گنج پدر بر دلش گشت خوار
برآن مهرکش بود صد برفزود		نهان زی پدر نامه ای کرد زود
ز کار سپهدار و آن فر و جاه		همه گفت از کار زنگی و راه
دژم گشت قیصر ز کردار خویش		روان کرد گنجی از اندازه بیش
هزار اشتر آراسته بار کرد		ده از بارگی بار دینار کرد
هزار دگر راست کردند بار		ز فرش و خز و دیبهٔ شاهوار
ز زر افسر و یاره و طوق و تاج		به گوهر نگاریده تختی ز عاج
دو صد اشتر آرایش بارگاه		ازو صد سپید و دگر صد سیاه
فرستاد پاک اثرط راد را		همان دخت و فرخنده داماد را
دگر هرکرا بد سزا هدیه داد		به نامه بسی پوزش آورد یاد
زبس خواهشش پهلوان نرم شد		از آزار دل سوی آزرم شد
به خلعت فرستاده را شاد کرد		به پاسخ بسی نیکوی یاد کرد
دگر گفت گامی ره از کام تو		نگردم نجویم جز آرام تو
ولیکن بدان مرد بازارگان		ز نیکی بکن هر چه داری توان
بدان کاو دل و جان و رای منست		بدو هرچه کردی به جای منست
بود آینه دوست را مرد دوست		نماید بدو هرچه زشت و نکوست
فرستاد ازینگونه پیغام باز		از آن پس همی بود با کام و ناز
از آن پس شد آن مرد بازارگان		شه روم را تاج آزادگان
ز گرد گزین وز شه روم نیز		همی یافت هرگونه بسیار چیز
به گیتی به جز دست نیکی مبر		که آید یکی روز نیکی به بر
بسی جای ها گفته اند این سخن		که کن نیکویی و به جیحون فکن
پشیمان نگردد کس از کار نیک		نکوتر ز نیکی چه چیزست و یک
به میدان دانش بر اسپ هنر		نشین و ببند از ستایش کمر
وفا ترگ کن درع رادی بپوش		کمان از خرد ساز و خنجر ز هوش
براینسان سواری کن از خویشتن		پس اسپت به هر سو که خواهی فکن
چو بگذشت ازین کار ماهی فرهبیآمد به نزدیک آب زره
ز اخترشناس و مهندس شماربه روم و به هند آن که بد نامدار
بیاورد و بنهاد شهر زرنجکه در کار ناسود روزی ز رنج
ز گل باره ای گردش اندر کشیدمیانش دژی سر به مه برکشید
ز پیرامن دژ یکی کنده ساختز هر جوی و شهر آب در وی بتاخت
بسا رود برداشت از هیرمندوزان جوی و کاریزها برفکند
در این کار بُد پهلوان سپاهکه از شاه کابل تهی ماند گاه
پسر شاد بنشست بر جای اویبگردید از آیین و از رای اوی
خراج پدرش آن که هر سال پیشبه اثرط فرستادی از گنج خویش
دو ساله به گنج اندر انبار کرددگر طمع کشورش بسیار کرد
بسی دادش اثرط به هر نامه پندنپذرفت و بد پاسخ آراست چند
همیدونش دستور فرزانه هوشبسی گفت کاین جنگ و کین را مکوش
به صدسال یک دوست آید به دستبه یک روز دشمن توان کرد شست
چو بود آشتی نو میآغاز جنگپس شیر رفته مینداز سنگ
تن و جان بود چیز را مایه دارچو جان شد بود چیز ناید به کار
تو این پادشاهی بیابی که هستبه از طمع مه زین که ناید به دست
پشیزی به دست تو بهتر بسیز دینار در دست دیگر کسی
نگه کن که در پیشت آبست و چاهکلیجه میفکن که نرسی به ماه
شهان از پی آن فزایند گنجکه از تن بدو بازدارند رنج
تو گنج از پی رنج خواهی همیفزودن بزرگی بکاهی همی
ز گرشاسب ترسد همی چرخ و بومسُته شد ز گرزش همه هند و روم
شهان را همه نیست پایاب اوی	چه داری تو با این سپه تاب اوی
چو آتش کنی زیر دامن درونرسد دود زود از گریبان برون
مکن بد که تا بد نیایدت زودمدرو و مدوز و ترا رشته سود
برآشفت و گفتش تو لشکر پسیچز پیکار گرشاسب مندیش هیچ
دو سال است کاو شد ز درگاه شاهبه نزدیک آب زره با سپاه
به نوی یکی شهر سازد همیز هر شهر مردم نوازد همی
به ما تا رسد گرد او در نبردز زاول برآورد باشیم گرد
بُدش ابن عم نام انبارسیبدادش ز گردان دو صد بار سی
فرستادش از پیش و سالار کردز پس با سپه ساز پیکار کرد
گزید از دلیران دو ره چل هزارصد و شست پیل از در کارزار
بشد تا سر مرز کابلستانبه کین جستن شاه زابلستان
خبر شد برِ اثرط سر فرازسبک خواند لشکر ز هر سو فراز
برادرش را سروری هوشیارپسر بُد یکی نام او نوشیار
ورا کرد پیش سپه جنگجویبَرِ شهر داور فرود آمد اوی
به جنگ آن دو سالار پیش از دو شاهرسیدند زی یکدگر کینه خواه
دو لشکر زدند از دو سو پره بازببد دست جنگ دلیران دراز
سواران به یک جا برآمیختندپیاده جدا درهم آویختند
سر خنجر آتش شد و گرد دودچو آتش کزو جوش خون خاست زود
بغرید کوس و برآمد نبردبرخشید تیغ و بجوشید گرد
نوان گشت بوم و جهان شد سیاهبلرزید مهر و بترسید ماه
یکی بزمگه بود گفتی نه رزمدلیران درو باده خواران بزم
غو کوسشان زخم بربط سرایدم گاو دم ناله و آوای نای
روان خون می و نعره شان بانگ زیرپیاله سر خنجر و نقل تیر
به هر گوشه ای مستی افکنده خوارچه مستی که هرگز نشد هوشیار
چویک رویه پیکار پیوسته شد	زگردان بسی کشته وخسته شد
دمان نوشیار از میان نبردبه انبارسی ناگهان باز خورد
برآورد زهر آبگون خنجرشبه زخمی زتن ماند تنها سرش
سپه چون سپهبد نگون یافتندعنان یکسر از رزم برتافتند
زپس خیل زاول سه فرسنگ بیشبرفتند و دشمن گریزان ز پیش
فکندند از ایشان بسی رزم سازچو خورشید شد زرد گشتند باز
همان گه شه کابل اندر رسیدهمه دشت و که کشته و خسته دید
زدش ز آتش درد بر مغز دودکه شب گشت و هنگام کوشش نبود
تن کشته انبارسی باز جستبرو رُخ به خون دو دیند بشست
یکی عود با زعفران برفروختمر آن کشته را تن به آتش بسوخت
هم از بهر آن کشته بر انجمنبسی کس به آتش فکندند تن
سپه هر کجا کشته شان بد دگرهمه شب بدند از برش مویه گر
به یاری بر نوشیار از سرانهمان شب بیامد سپاهی گران
چوباز سپیده بزد پر باز از او زاغ شب شد گریزنده باز
شه کابل آورد لشکر به جنگبرابر دو صد برکشیدند تنگ
بپیوست رزمی گران کز سپهرگریزنده شد ماه و گم گشت مهر
برآورد ده و دار و گیر و گریززهر سو سرافشان بُد و ترگ ریز
جهان جوش گردان سرکش گرفتبه دریا زتیغ آب آتش گرفت
همه دشت تابان ز الماس بودهمه کوه در بانگ سر پاس بود
فکنده سر نیزه ی جان ستانیکی را نگون و یکی را ستان
زبس خون خسته زمی لاله زاروز آن خستگان خاسته ناله زار
تن پیل پرخون و پرتیر و خشتچو زآب بقم رسته بر کوه کشت
به تیغ وسنان و به گرز گرانبکشتند چندان ز یکدیگران
که شد مرگ از آن خوار برچشم خویشسته گشت و نفرید بر خشم خویش
دل جنگیان شد ز کوشش ستوهشکست اندر آمد به زاول گروه
ز پیش سپه نوشیار دلیردرآمد بغرید چون تند شیر
کزین غرچگان چیست چندین گریغبکوشید هم پشت با گرز و تیغ
همان لشکرست این که در کارزارگریزان شدند از شما چند بار
سپه را به یک بار پس باز بردبه نیزه فکند از یلان چند گرد
تنوره زد از گردش اندر سپاهز هر سو به زخمش گرفتند راه
بینداختندش به شمشیر دستفکندند بی جانش بر خاک پست
پسرش از دلیری بیفشرد پایستد کینه زان جنگجویان بجای
نخست از یلان پنج بفکند تفتپدر را ببست از بر زین و رفت
دلیران زاول همه ترگ و تیغفکندند و جستند راه گریغ
از ایشان همه دشت سر بود ودستگرفتند بسیار و کشتند و خست
چوشب خیمه زد از پرند سیاهدرو فرش سیمین بگسترد ماه
شه کابل آنجا که پیروز گشتبزد با سپه پرخون و پرخاک و گرد
گریزندگان نزد اثرط به دردرسیدند پرخون و پرخاک و گرد
بدادندش از هر چه بُد آگهیبماند از هش و رای مغزش تهی
زدرد سپه وز غم نوشیاربه دل درش با زهر شد نوش یار
وز آن سو چو از شهر داور سپاهسوی جنگ برد اثرط کینه خواه
سپه سی هزار از یلان داشت بیشدوصد پیل برگستوان دار پیش
دلیران پرخاش دو رویه صفکشیدند جان برنهاده به کف
سواران شد آمد فزون ساختندیلان از کمین ها برون تاختند
به کوه اندر از کوس کین ناله خاستز پیکان در ابر آهنین ژاله خاست
شتاب اندر آمیخت کین با درنگشد از خون و از گرد گیتی دو رنگ
هوا تف خشت درفشان گرفتسر تیغ هرسو سرافشان گرفت
تو گفتی ز بس خون که بارد همیجهان زخم خنجر سرآرد همی
درآورده خرطوم پیلان به همچو ماران خم اندر فکنده به خم
همی خون و خوی برهم آمیختندبه دندان ز زخم آتش انگیختند
گرفتند پیلان اثرط گریزبر آمد ز زابل گروه رستخیز
فراوان کس از پیل افتاد پستبسی کس نگون ماند بی پا و دست
فکند این سلیح آن دگر رخت ریختدلاور ز بددل همی به گریخت
زد اثرط برون ادهم تیزگامیلان را همی خواند یک یک به نام
عنان چند را باز پیچید و گفتنیستاد کس مانده با درد جفت
بدش ریدگان سرایی هزارهزار دگر گرد خنجر گزار
بدین مایه لشکر بیفشرد پایفرو داشت چندان سپه را بجای
چپ و راست با نامداران جنگهمی جست جنگ از پی نام و ننگ
عنان را به حمله بسودن گرفتسران را به نیزه ربودن گرفت	
کجا گردی انگیختی در نبردبه خون باز بنشاندی آن تیره گرد
چنین تا فروشد سپهری درفشزشب گشت زربفت گیتی بنفش
به راه سکاوند چون باد تفتشب قیرگون روی بنهاد ورفت
بر دامن کوهی آمد فرودهمه راغ او بیشه ی کلک بود
گریزندگان را گروها ، گروههمی خواند از هر رهی سوی کوه
پراکنده گرد آمدش پیل شستدگر ده هزار از یلان چیره دست
همه خسته و مانده و تافتهز بس تشنگی کام و دل کافته
طلایه پراکنده بر کوه و دشتببد تا سپاه شب از جا بگشت
چو دینار گردون برآمد ز خمستد یک یک از سبز مینا درم
درفش شه کابل آمد پدیدسپاه از پسش یکسر اندر رسید
سراسیمه ماندند زاول سپاهبه اثرط نمودند هر گونه راه
چه سازیم گفتند چاره که جنگ	فراز آمد و شد جهان تار و تنگ
ستوهیم هم مرد و هم بارگیشده در دم مرگ یکبارگی
ز چندین سپه نیست ناخواسته کسره دور پیشست و دشمن ز پس
چنین گفت اثرط که یک بار نیزبکوشیم تا بخش کمتر نگردد نه بیش
جهاندار بخشی که کردست پیشاز آن بخش کمتر نگردد به بیش
همه کار پیکار و رزم ایزدیستکه داند که فرجام پیروز کیست
به هر سختیی تا بود جان به جاینباید بریدن امید از خدای
چه خواهد بدن مرگ فرجام کارچه در بزم مردن چه در کارزار
بگفت این و خفتان و مغفر بخواستبزد کوس و صف سپه کرد راست
شد اندر زمان روی چرخ بنفشپر از مه ز بس ماه روی درفش
ز خون یلان و ز گرد سپاه	زمین گشت لعل و هوا شد سیاه
ز بس گرز بر ترگ ها کوفتنفتاد آسمان ها در آشوفتن
سرتیغ در چرخ مه تاب دادسنان باغ کین را به خون آب داد
بد از زخم گردان سراسیمه کوهز بانگ ستوران ستاره ستوه
شده پاره بر شیر مردان زرهز خون بسته بر نیزه هاشان گره
زمین از پی پیل پرژرف چاهچو کاریز یلان خون را به هر چاه راه
خزان است آن دشت گفتی به رنگدرختان یلان باغ میدان جنگ
چمن صف دم بد دلان باد سردروان خون می و چهرها برگ زرد
شد از کشته پرپشته بالا و پستسرانجام بد خواه شد چیره دست
به زاول گره بخت بربیخت گردهمه روی برگاشتند از نبرد
یکی کوه و دیگر بیابان گرفتبماند از بد بخت اثرط شگفت
برآهخت تیغ اندر آمد به پیشدو تن را فکند از دلیران خویش
بسی خورد سوگندهای درشتکه هر کاو نماید به بدخواه پشت
نیام سر تیغ سازم برشکنم افسر دار بی تن سرش
وگر من به تنهایی اندر ستیزبمانم دهم سر نگیرم گریز
دگر باره گردان پرخاشجویبه ناکام زی رزم دادند روی
ده و گیر برخاست بادار و بردهوا چون بیابان شد از تیره گرد
بیابانی آشفته همرنگ قیردرو غول مرگ و گیا خشت وتیر
ز چرخ کمان گفته شد کوه برزدرید آسمان از چکاکاک گرز
ببارید چندان نم خون ز تیغکه باران به سالی نبارد ز میغ
یکی بهره شد کشته زاول گروهدگر گشته از جنگ جستن ستوه
چنان غرقه درخون که هرکس که زیستبه آوازه بشناختندی که کیست
به اندرز کردن همه خستگانوز آن خستگان زارتر بستگان
غریو از همه زار برخاستهبریده دل از جان و از خواسته
همی گفت هرکس برین دشت کینبکوشید تا تیره شب همچنین
مگر شب بدین چاره افسون کنیمسر از چنبر مرگ بیرون کنیم
پس که چو خور ساز رفتن گرفترخش اندک اندک نهفتن گرفت
غو دیده بان از برِ مه رسیدکه آمد درفش سپهبد پدید
خروش یلان شد ز شادی بر ابرستد ناله ی کوس هوش هژبر
سپه را دل آمد همه باز جاییکی مرد ده را بیفشرد پای
بر آن بود دشمن که شب در نهانگریزند زاول گره ناگهان
ز گرشاسب آگه نبودند کسشب آمد ز پیکار کردند بس
یل پهلوان داشت کآمد ز راهتنی ده هزار از یلان سپاه
که هر کز گریزندگان یافت زودعنانشان ز ره باز برتافت زود
هم از ره که آمد نشد زی پدربه کین بست بر جنگ جستن کمر
سران سپه و اثرط سرافرازبه صد لابه بردندش از پیش باز
ببد تا برآسود و چیزی بخوردز لشکر بپرسید پس وز نبرد
جز از کشتگان هر که را نام بردهمه خسته دید از بزرگان و خرد
ز بس خشم و کین کرد سوگند یادکه بدهم من امشب بدین جنگ داد
زنم تیغ چندان که از جوش خونرخ قیر گون شب کنم لاله گون
شب تار وشبرنگ در زیر منکه تا بد بر گرز وشمشیر من
طلایه فرستاد هم در شتابزمانی گران کرد مژگان به خواب
شبی همچو زنگی سیه تر ز زاغمه نو چو در دست زنگی چراغ
سیاهیش بر هم سیاهی پذیرچو موج از بر موج دریای قیر
چو هندو به قار اندر اندوده رویسیه جامه وز رخ فروهشته موی
چنان تیره گیتی که از لب خروشز بس تیرگی ره نبردی به گوش
میان هوا جای جای ابر و نمچو افتاده بر چشم تاریک تم
جهان گفتیی دوزخی بود تاربه هر گوشه دیو اندر او صدهزار
از انگشت بدشان همه پیرهندمان باد تاریک و دود از دهن
زمین را که از قار دیدار نهزمان را ره و روی رفتار نه
به زندان شب در به بند آفتابفروهشته بر دیده ها پرده خواب
فرشته گرفته ز بس بیم پاسپری در نهیب اهرمن در هراس
بسان تنی بی روان بُد زمینهوا چون دژم سوکیی دل غمین
بدان سوک برکرده گردون ز رشکرخ نیلگون پُر ز سیمین سرشک
چو خم گاه چوگانی از سیم ماهدرآن خم پدیدار گویی سیاه
تو گفتی سپهر آینست از فرازستاره درو چشم زنگیست باز
درین شب سپهبد چو لختی غنودز بهر شبیخون بر آراست زود
همان نامور ویژگان را که داشتبرون برد وز ره عنان بازگاشت
چو نزدیکی خیل دشمن رسیدسواری صد آمد طلایه پدید
کشید ابر بیجاده باز از نیامبرانگیخت شبرنگ و برگفت نام
ز زین کرد مر چند را سرنشیبگرفتند دیگر گریز از نهیب
سپهدار با ویژگان گفت هینگرید از پس ام گرز و شمشیر کین
همه گوش دارید آوای منگراییدن گرز سرسای من
بزد نعره ای کز جهان خاست جوشز دشمن چهل مُرد و صد شد ز هوش
به یک ره بر انبوه لشکر زدندسپه با طلایه به هم بر زدند
سپه برهم افتاد شیب و فرازرکیب از عنان کس ندانست باز
رمیدند پیلان و اسپان زجایسپردند مر خیمه ها را به پای
همی تاخت هرکس در آن جنگ وشوریکی زی سلیح و یکی زی ستور
دلیران زاول چو پیلان مستدوان هر سوی گرز و خنجر به دست
سراپرده زآتش برافروختندبسی خرگه و خمیه ها سوختند
شد از تابش تیغ ها تیره شبچو زنگی که بگشاید از خنده لب
تو گفتی به دوزخ درون اهرمندمد هر سوی آتش همی از دهن
به کم یک زمان خاست صد جا فزونز گردان تل کشته و جوی خون
یکی را فکنده ز تن پای و دستیکی را سر و مغز از گرز پست
یکی دوزخی وار تن سوختهسلیح و سلب ز آتش افروخته
چو سیم روان برزد از چرخ سربرآن سیم خورشید بر ریخت زر
بد از رنگ خورشید وز خون مردهمه دشت چون دیبه ی سرخ و زرد
سپهبد سوی صف پیلان دمانچو باد از کمین تاخت بر زه کمان
به تیر اندر آن حمله بفکند تفتز پیلان برگستوان دار هفت
به ترگ و به جوشن ز کابل گرویکی دیده بان دید بر تیغ کوه
زدش بر بر و دل خدنگی درشتچنان کز دلش جست بیرون ز پشت
بشد تیر پنهان به سنگ اندرونفتاد از کمر مرد بی جان نگون
وز آن جای با ویژگان رفت چیرسوی لشکرش همچو ارغنده شیر
به شادی برآمد ز لشکر خروشفتاد از غو کوس در چرخ جوش
ز کابل سپه کشته شد شش هزارندانست کس خستگان را شمار
نبد کشته از خیل گرشاسب کسشمردند یک مرد کم بود و بس
رسید آن یکی نیز تازان نوندگرفته سواری به خم کمند
همه خیل کابل شدند انجمنبرآن کشته پیلان پولادتن
به یک تیر بد هریک افکنده خواربراین سو زده کرده زآن برز کوه
همیدون بر آن دیده بان یک گروهشدند انبه از زیر کرده ز آن سو گذار
بدیدند در سنگ نادیده تیریلان را همه روی شد چون زریر
بدانست هرکس به فرهنگ زودکه آن زخم از شست گرشاسب بود
زد اسپ از میان شاه کابل چو بادسوی لشکر زابل آواز داد
ز گرشاسب پرسید گفتا کجاستدهیدم ازو مژده گر با شماست
که با او به جنگ بهو بوده امهمه کشور هند پیموده ام
شنیدم که زاول بپرداختستبه شهریست کآنرا کنون ساختست
یکی گفت نشناسی ای رفته هوشکه گرشاسب کرد این همه رزم دوش
هم از ره که آمد فکند این سرانبرآرد کنون گرد ازین دیگران
به هنگام از ایدر گریزید زاراز آن پیش کآرد کنون کارزار
شه کابل آمد دو رخساره زردبه لشکر بر آن راز پیدا نکرد
مترسید گفتا که گرشاسب نیستسری نامدارست و مردی دویست
شب این تیرها را وی انداختستهمین تاختن ناگه او ساختست
به گرشاسب یاور نباید کسماگر اوست تنها من او را بسم
شبیخون بود پیشه ی بد دلانازین ننگ دارند جنگی یلان
اگر ما برایشان شبیخون کنیمهمه آب ها در شبی خون کنیم
بگفت این ولشکر همه گرد کردبزد کوس و برخاست صف نبرد
سپه را سبک پهلوان صف کشیدجدا جای هر سرکشی برگزید
همه خستگان را ز پس بازداشتبه جنگ آنکه شایسته بد برگماشت
درآورد پیش اژدهافش درفششد از تیغ هامون چو گردون بنفش
دم نای رویین ز مه برگذشتغو کوس دشت و که اندر نوشت
به حمله یلان در فراز و نشیبعنان گرد کردند تازان رکیب
به زخم سر تیغ الماس چهرهمی خون فشاندند بر ماه و مهر
شل و خشت چون پود و چون تار بودچکاکاک برخاست از ترگ و خود
زهفتم زمین گرد پیکار خاستز دیو و پری بانگ زنهار خاست
عقیقین شد از خون به فرسنگ سنگفروریخت از چرخ خرچنگ چنگ
ز بس خنجر و نیزه ی جان ستانزمین همچو آتش بد و نیستان
نگارنده از خون سنان ها زمینگشاینده مرگ از کمان ها کمین
شده تیغ ها در سر انداختنچو بازیگر از گوی ها باختن
بد آتش ز هر حلقه ی درع پوشزبانه زبانه برآورده جوش
تو گفتی ز بگداخته زرکارهوا شفشه سازد همی صدهزار
چو گرشاسب آن رزم و پیکار دیدجهان پرسوار صف او بار دید
به شبرنگ مه نعل گردون نورددرآمد برافروخت گرز نبرد
دو دستی همی کوفت بر مغز و ترگهمی ریخت ز الماس کین زهر مرگ
گه انداخت خرطوم پیلان به تیغبرافشاند گه مغز گردان به میغ
کجا گرز بر زخم بگماشتیزمین از بر گاو برگاشتی 
زگردان به خم کمند از کمینبه هر حمله دو دو ربودی ز زین
سم اسپش از گرد سنگ سیاههمی کرد چون سرمه در چشم ماه
دل کوه نعلش همی چاک زدزخون خرمن لاله بر خاک زد
یکی پیل چون کوه هامون سپرخمش کرد خرطوم گرد کمر
بکوشید کز زینش آرد به زیر	نجنبید از جای گرد دلیر
زدش گرز و خونش از گلو برفشاندز سر مغزش و چشم بیرون جهاند
بیفکند دیگر ز پیلان چهارهمی تاخت غران چو ابر بهار
رمیدند پیلان از آن جنگجویسوی لشکر خویش دادند روی
فکندند بسیار و کردند پستدرفش دلیران نگون شد ز دست
بدانست هر کس که گرشاسبست	سخن گفتن شاه گوشاسبست
که و دشت از افکنده بُد ناپدیدگریزنده کس دو به یک جا ندید
سواران رمان گشته بی هوش و هالپیاده ز پیلان شده پایمال
به راهی دگر هر یکی گشته گمز بر کرکس و غول تازان به دم
چوشب قطره قطره خوی سندروسپراکند بر گنبد آبنوس
ده و شش هزار آزموده سوارگرفته شد و کشته پنجه هزار
سراپرده و خیمه و خواستهسلیح و ستوران آراسته
همه گرد کردند از اندازه بیشجدا برد ازو هر کسی بهر خویش
گرفتاریان با همه هر چه بودسپهبد به زاول فرستاد زود
ده و دو هزار از دلیران گردگزین کرد و دیگر به اثرط سپرد
مرورا به زاول فرستاد بازشد او سوی کاول به کین رزم ساز
به هنگام رفتن چو ره را بساختنشاندش پدر پیش و چندی نواخت
بدو گفت هر چند رای بلندتو داری مرا نیست چاره ز پند
جوان گرچه دانادل و پرفسونبود نزد پیر آزمایش فزون
جوان کینه را شاید و جنگ را	کهن پیر تدبیر و فرهنگ را
خردمند به پیر و یزدان پرستجوان گرد و خوشخوی و بخشنده دست
کنون چون به شاهی رسیدی زبختبزرگیت خواهد بد و تاج و تخت
نگه کن که چون کرد باید شهیبیآموز آیین و راه مهی
چهارست آهوی شاه آشکارکه شه را نباشد بتر زین چهار
یکی خیره رایی دوم بددلیسوم زفتی و چارمین کاهلی
خرد شاه را برترین افسرستهش و دانشش نیک تر لشکرست
بهین گنج او هست داننده مردنکوتر سلیحش یلان نبرد
دگر نیک تر دوستداران اوکدیور مهین پایکاران او
شه آن به که هر دانش و دسترسهمه زو گرند او نگیرد زکس
چنان دارد از هر دری پیشه کار	که در پیشه هر یک ندارند یار
دل شاه ایمن بر آن کس نکوستکه در هر بد و نیک انباز اوست
شه از داد و بخشش بود نیکبختکرا بخشش و داد نیکوست بخت
چو خواهی که شاهی کنی راد باش 	به هر کار با دانش و داد باش
کهن دار دستور و فرزانه رایبه هر کار یکتا دل و رهنمای
سپه دار و گنج آکن و غم گسلکدیور به طبع و سپاهی به دل
نکوکار و با دانش و داد دوستیکی رسم ننهد که آن نانکوست
خردمند کن حاجب و خوب کارطرازنده درگه و بزم و بار
به دیدار باید که نیکو بودکجا پرده روی کار او بود
به هنگام گوید سخن پیش شاهسزا دارد انداز هر کس نگاه
نکو خط و داننده باید دبیرشمارنده چابک دل و یادگیر
ز دل بنده شاه و دارنده رازبه معنی از اندیشه دوشیزه ساز
چو این هرسه زین گونه آری به دست سپه ساز گردان خسرو پرست
یلانی کشان پیشه کین آختن شبان روز خو کرده بر تاختن
که در جنگ بر چشم کشته پسرنهد پای و از کین نتابد پدر
همه روز فرمایشان دار و برد 	سواری و شور سلیح و نبرد
نباید که بیکار باشد سپاهنه آسوده از رنج و تدبیر شاه
نکودار مر مردم خویش راهمان پارسا مرد درویش را
همه کار سازانت از کم و بیشنباید که ورزند جز کار خویش 
کند هرکس آن کار کاو برگزیدبدان تا بود کار هرکس پدید
سلیح ایچ در دست شهری گروهنشاید که شه را نباشد شکوه
نباید مهان سپه سر به سرکه پیوند سازند با یکدیگر
نشاید که هم پشت باشند هیچمگر در گه رزم کردن پسیچ
کسی کاو به جایت سزد شهریارورا از بر خویشتن دور دار
به هر کهتر اندر خورش کن نگاهسزای هنر ده ورا پایگاه
گرت کهتری بر دل آید گرانچو دارد هنر ورگران منگر آن
که را دوست داری و کام تو اوستهر آهوش را همچنان دار دوست
به بیداد مستان تو چیزی ز کسبه داد و ستد راستی جوی و بس
میان سپاهت هر آن کز مهانبترسی ازو آشکار و نهان
چو پیدا نیاری بدش کینه جوینهانی به دارو بپرداز ازوی
دروغ و گزافه مران در سخنبه هر تندیی هرچه خواهی مکن
که شه بر همه بد بود کامکارچو گردد پشیمان نیاید به کار
میان دو تن چو کنی داوریبه آزرم کس را مکن یاوری
نشاید زهی گاو دوشای و رزکه بکشی چو مانی تو در کار وارز 
به کشت و به ورز کشاورزیانچنان کن که ناید به کشور زیان
ممان کس به بازی و خنده زپیشتو نیز این مجوی و مبرآب خویش
گه خشم چون چهره کردی نژنددژم باش و باکس به زودی مخند
کسی را که دادی بزرگی و جاههمان جاه مستان ازو بی گناه
چو نیکی نمایدت گیتی خدایتو با هرکسی نیز نیکی نمای
کرا با تو گویند بد بیشترچو نبود گنه دان که هستش هنر
درختی که دارد فزونتر بر اویفزون افکند سنگ هر کس بر اوی
منه نو رهی کان نه آیین بودکه تا ماند آن بر تو نفرین بود
همه راهی از رهزنان پاک دارمدار از در دزد جز تیغ و دار
چو بنشینی از گردت آن را نشانکه دارند در دل ز مهرت نشان
به جفت کسان چشم خود را مروشبترس از خدا وآن جهان را بکوش
بود مه گناهی که نامد تباهازو کاو بود داور هرگناه
در داد بر دادخواهان مبندزسوگند مگذر نگه دار پند
چو نیکی کنی و نیاید به باربدی کن مگر بهتر آید به کار
کسی دار کز دفتر باستانهمی خواندت گونه گون داستان
ببین تا ز کردار شاهان پیشچه به بُد همان کن تو آیین خویش
مده نزد خود راه بدگوی رانه مرد سخن چین دو روی را
همه کار مردان با داد کنسخنشان به هر انجمن یادکن
پژوهندگان دار بر راه روهمی دان نهان جهان نو به نو
بدان کار ده کاو نجوید ستمنه آن را که افزون پذیرد درم
کسی را مگردان چنان سرفرازکه نتوانی آورد از آن پایه باز
ز دانندگان فیلسوفی گزینازو پرس هر چیز و با او نشین
مفرمای کاری بدان کارگرکز آن کار نتواند آمد به در
ممان خیره بدخواه را گرچه خوارکه مار اژدها گردد از روزگار
بکش آتش خرد پیش از گزندکه گیتی بسوزد چوگردد بلند
مکن هیچ بدبینی از دیگرانوگر نیک بینی تو خو کن برآن
خورش پاک از آن خور که نگزایدتبه اندازه وآن گه که به بایدت
پزشکان گزین دار و فرزانه رایبه هر درد دانا و درمان نمای
بسی گرد آمیغ خوبان مگردکه تن سست و جان کم کند روی زرد
چو خواهی کهی را همی کرد مهبزرگیش جز پایه پایه مده
که چون از گزافش بزرگی دهینه ارج تو داند نه آن مهی
چنان کن که همواره برتخت خویشاگر تیغ اگر گرز باشدت پیش
گه بار مگذار و مگمار کسبه شمشیر از افراز سر یا ز پس
به کس راز مگشای در هر پسیچبداندیش را خوار مشمار هیچ
کرا ترس و بیمی کنی گونه گونبه سوگند کن تا بترسد فزون
چو با موبدان رای خواهی زدنبه همشان مخوان جز جدا تن به تن
ز هریک شنو پس مهین برگزینچنان کاین نه آگاه از آن آن از این
به کس روی منمای جز گاه گاهبه هر هفته ای برنشین با سپاه
به ره دادخواهی چو آید فرازبده داد و دارش هم از دور باز
به ناآزموده مده دل نخستکه لنگ ایستاده نماید درست
ز بن با زنان با ستیزه مکوشوزیشان نهان خویشتن دارگوش
به نیکویی آکن چو گنج آکنیبه دانش پراکن چو بپراکنی
ازآن کش روان با خرد بود جفتکسی باد دستی ز رادی نگفت
به نامه درشتی فراوان مگویکه تنگی دل شاه دانند ازوی
فرستادگان را مخوان زود پیشبجوی از نهان پس بخوان نزد خویش
به اندازه کن با همه گفتگویبه ایشان به گفتار پیشی مجوی
که گر بشکنیشان نباشدت ناموگر بشکنندت شود کارخام
فرسته گُسی ساز دانش پذیرنهان بین و پاسخ ده و یاد گیر
کسی کز نهانت نه آگه که چیستور آگه نداند به جز با تو زیست
نه دو روی باید نه پیکار جوینه می دوست از دل نه بیکار پوی
چو دیر آیدت پاسخ نامه باز	بدان کاو فتادست کاری دراز
به هر جای بی دُر و گوهر مگردنه بی اسپ نیک و سلیح نبرد
چو پیدا شود دشمنی کینه جوینهان هر زمان پرس از کار اوی 
چو با او نشاید نبرد آزمودبه چیز فراوانش بفریب زود
سپه را چو دادی به چیزی پسیچرسانشان به زودی و مفزای هیچ
چنان دان که در دادن زر و سیمندانند کز دشمنت هست بیم
بدان سازها جوی هر روز جنگکه دشمنت را چاره ناید به چنگ
پراکنده فرمای شب جای خوابمخور هیچ بی چاشنی گیر آب
طلایه دلاور کن و مهربانبگردان به هر پاس شب پاسبان
به لشکر در از خیل تنها مباشبه خیمه درون هیچ یکتا مباش
گریزان چو باشی به شب باش و بسکه تا بر پی از پس نیایدت کس
ز گردت مکن دور مردان مردکه باشند ایشان حصار نبرد
چو پیروز گردی بترس خدایهمان از کمین مر سپه را بپای
گرفتن ره دشمن اندر گریزمفرمای و خون زبونان مریز
گر آری به کف دشمنی پرگزند 	مکش در زمان بازدارش به بند
توان زنده را کشتن اندر گدازنکردست کس کشته را زنده باز
بود کت نیاز افتد از روزگاربه از دوست آن دشمن آید به کار
بیندیش شب کار فردا نخستبدان رای رو پس که کردی درست
نژاد شهان از بُنه کم مکنمکن خاندانی که باشد کهن
چو بر سیستان پهلوان گشت شاهبراوج سپهر مهی گشت ماه
همه ساز شهرش نکو کرده شدبرو دست فرمانش گسترده شد
زکارش بد و نیک بی گاه و گاههمی شد خبر نزد ضحاک شاه
بدو تیره شد رایش اندر پسیچولیکن نیارستش آزرد هیچ
سوی سیستان رفت تا بنگردیکی پیش آب زره بگذرد
ز نزل و علف آنچه بایست سازسپهبد برون برد و شد پیشباز
چو شه را بدید آمد از پیل زیرگرفتش به بر شاه و پرسید دیر
سپهبد رکابش ببوسید و جستبه دندان پیل اندر آویخت دست
چو چابک سواری به اسپ نبرد	زهامون به پیل اندر آمد چو گرد
نگه کرد شاه آن یلی بال و برزبه کف کوه کوب اژدها سار گرز
به زیر اندرش زنده پیلی چو کوهزبس بار خفتان و ترکش ستوه
به دل چاره ای گفت باید گزیدکه این را کند دشمنی ناپدید
جهان با من ار پاک دشمن بودازآن به که این دشمن من بود
بزد خیمه گرد لب هیرمندبرآسود با خرمی روز چند
هم اثرط ز زوال شدآراستهبسی ساخته هدیه و خواسته
چو یک هفته گرد گلستان و رودببودند با بزم و رود و سرود
به شبگیر کردند رای شکارکه بُد روز نخچیر و گاه بهار
رُخ باغ بُد زابر شسته به نمفشانان ز گل شاخ بر سر درم
ز درد خزان در دل زاغ زیغهوا بسته از لشکر ماغ میغ
شده لاله از ژاله پُر دُر دهنزپیروزه پوشیده گل پیرهن
زمیغ روان چرخ چون پر چرغ 	برآواز رامشگر از مرغ مرغ
تو گفتی هوا نافه کافد همیزمین حله سبز بافد همی
بُد آکنده هامون و گردون همهزمرغان چفاله زغرمان رمه
بُد از گرد اسپاه سیه گشته هوربه خم کمند یلان یال گور
سگ از گرد خرگوش اندر ستیز	دویک گاه در حمله گه در ستیز
به چنگال کاروان یکی دشت خشکیکی خاک بویان چو عطار مشک
گشاده کمین یوز برآهوانچون دزدی گه حمله بر کاروان
زچنگال پرخونش جای کمینشده لاله در لاله روی زمین
ز سم گوزنان زمین جزع رنگوشی گشته ریگ و شخ از خون رنگ
نشسته برآهو عقاب دلیرچو براسپ گردی ناورد چیر
دل تیهو از چنگ طغرل به داغرباینده باز از دل میغ ماغ
زشاهین و چرغ آسمان بسته ابررمان از غو طبل بازان هژبر
از افکنده نخچیر بی راه و راهپر از کشتگان دشت چون رزمگاه
گهی باده بر کف به بانگ ربابگه از ران گوران بر آتش کباب
زهر تیغ که دیده بان با غریوزبس گرد گردان گریزنده دیو
سپهبد پیاده همی تاختیبه راه گوزنان کمین ساختی
چو تنگ آمدندی بجستی زجایگرفتی سرو شان فکندی زپای
سر وی دو ناگه گرفت ازکمینهمی زد ز خشم این برآن آن براین
زبس کوفتن زور تنشان ببردسر و گردن هردو بشکست خرد
چنین پیش ضحاک چندی گرفتبرو آفرین خواند شاه از شگفت
به دل گفت تا زو نبینم گزندازین کشورش دور باید فکند
به باغ آمدند آن گه از دشت و باغکه بود از در شادی و بزم باغ
نخستین شکستند برخوان خمارپس از بزم و رامش گرفتند کار
شد از ناله آن پیر سغدی به جوشکه نافش بخاری برآرد خروش
همان زاغ گون هندون هفت چشمبرآورد فریاد بی درد و خشم
گهی زندواف و چکاوک بهم 	سراینده دستان همی زیر و بم
قدح چون مه اندر کف سرکشانبرآن مه زگل شاخ پروین فشان
بزرگان رده ساخته برچمنمیان سنبل و شنبلید وسمن
دو دیده به خوبان مشکین کلهبه بلبل دو گوش و به کف بلبله
گه خرمی شاه با فر و کامبه یاد سپهدار برداشت جام
به نخچیر و بزم و به نیروی تنفراوانش بستود در انجمن
توی گفت از ایزد دلم را امیدهم از بخت تو فرخی را نوید
به تو دارم ایمن دل خویش رابه گرز تو ترسان بداندیش را
زنام توام کام و آرایشستزرنج توام نام و آسایشست
زبهرم فدا کرده ای خویشتنبه هر سختیی داشته پیش تن
شکستم به تو هر که بدخواه بودبه جنگ ارکنارنگ اگر شاه بود
کنون نیست با من گزارنده کینجز افریقی از بوم خاور زمین
که گوید زشاهان کس ام یار نیستبه مردی چو من نامبردار نیست
چو دورم ز گفتن بود پرفسوس 	چو نزدیک باشم بود چاپلوس
ترا راهزن خواند و مارکشمرا دید مردم خور خیره هش
کنون باید این رزم را ساختنتوانی مگر کین از او آختن
همان دیوکش منهراس است ناممگر کز کمند تو آید به دام
گر این کار بدهد گرو گر ترازشاهی مرا نام و دیگر ترا
سپهبد چنین گفت با شهریارکه اندرجهان مر ترا کیست یار
همی آفتاب فلک فر و تابزتاج تو گیرد چو مه زآفتاب
زمان بنده کردار رنجور تستزمین گنج و خورشید گنجور تست
زسیصد چو افریقی و من هراسبه فرّت نیارد دل من هراس
هم اکنون چو آهنگ راه آورمسر هردوشان پیش شاه آورم
چو از می گران شد سر باده خوارسته گشت رامشگر و میگسار
زبستان پراکنده شد انجمنهمان با گل و می چمان برچمن
نشست از نهان با پدر پهلوانبه تدبیر ره تا شدن چون توان
زمهرش پدر گشت با درد جفتزشاه این نبایست پذرفت گفت
که هرکار کاو با تو گوید همیزترس تو مرگ تو جوید همی
بخوان بر زمهمانت نو گر کهنزسیصد یکی راست مشنو سخن
نباید بُد ایمن به نیروی خویش	که ناید به هنگام هرکار پیش
گرت زور باشد زپیلان بسیبود هم به زور از تو افزون کسی
رهی سخت دشوار ششماهه بیش	همه کوه و دریا و بیشست پیش
سپاهی هزاران فزون از هزار	سپه کش چو افریقی نامدار
هم اندر کف من هراس اژدهاگرافتد به چاره نگردد رها
یکی نره دیوست پرخاشجویکه هرکش ببیند شود هوش ازوی
زگردون عقاب آرد از کُه پلنگزبیشه هژبر و ز دریا نهنگ
چو سه باز یک مرد پهنای اوست	چهل رش درازای بالای اوست
مرا نیز یک باره پیری شکست	شکستی که هرگز نشایدش بست
ربود از سر من سمور سیاهبه جایش نهاد از حواصل کلاه
یکی دست پیری بزد بر برمکه تاج جوانی فکند از سرم
به روز جوانی به زور دو پایچو باد بزان جستمی من ز جای
زپیری کنون گاه خیز و نشست	همی پای را یار باید دو دست
به تیری زدم سخت گشت زمانکزآن تیر شد تیر پشتم کمان
نویدیست پیری که مرگش خرام	فرستست موی سپیدش پیام
کسی را کجا زندگانی بود	زخُردی امید جوانی بود
امید جوان تا بود پیر نیزبه جز مرگ امید پیران چه چیز
سپهبد به مژگان شد ابربهاربه پاسخ دژم گفتش انده مدار
ندار غم از پیش دانش پذیربه چیزی که خواهد بُدن ناگزیر
سر از پیری ارچه شود خشک بید	زیزدان نباید بریدن امید
نه هر کاو جوان زندگانیش بیشبسا پیر ماند و جوان رفت پیش
به خانه نشستن بود کار زنبرون کار مردان شمشیرزن
تن رنج نادیده را ناز نیستکه با کاهلی ناز انباز نیست
نشاید مهی یافت بی رنج و بیم 	که بی رنج نارد کس از سنگ سیم
به دریای ژرف آنکه جوید صدفببایدش جان برنهادن به کف
بزرگی یکی گهر پربهاستورا جای درکام نر اژدهاست
چو خواهی سوی آن گهر دست برداگر مه شوی گر بخایدت خرد
به یک هفته زآن پس همه کار راهبسازید و شد پیش ضحاک شاه
ستودش بسی شاه و چندی نواختببایستِ او کارها را بساخت
بدادش هیون دو کوهان هزارهمه بارشان آلت کارزار
هزار دگر خیمه گونه گونبه برگستوان پیل سیصد فزون
دو صد تیغ و صدبدره دینار گنج 	زدیبا شراع و سراپرده پنج
چهل خادم از ریدگان طرازهزار اسپ جنگی به زرینه ساز
چو پنجه هزار از یلان سپاهببد پهلوان شاد و برداشت راه
ز خویشان یکی را به جایش نشاندسپه زی بیابان کرمان براند
سوی بابل آورد ضحاک رویدگر سو سپهدار شد راه جوی
همه ره به هر شهر و آباد جایبُدندش بزرگان پرستش نمای
چنین تا به نزدیک طنجه رسید 	همه مرز دریا سپه گسترید
شه طنجه بُد سرکشی نامدارهمش گنج و هم لشکر بی شمار
زبر بر زمین سوی خاور درونزیک ماهه ره داشت کشور فزون
چوآگه شد از پهلوان شاد گشتپراکند نزل و علف کوه و دشت
گرامی پسر داشت هشتاد و پنجهمه درخور تاج شاهی و گنج
پذیره فرستادشان سر به سربسی گونه گون هدیه با هر پسر
همه شهر از آذین و دیبا و سازبیاراست چون گارگاه طراز
در ایوانش سازید بر تخت جایمیان بست چون بنده پیشش به پای
دو هفته همی داشتش میهمانبرافشاند گنجی دگر هرزمان
زبس گونه گون نیکویی های اویدل پهلوان شد بدو مهرجوی
چنین گفت کاین کردی از راه راستکه از کاردانان و شاهان سزاست
خوی هرکس از تخمش آید به بارزگل بوی باشد خلیدن ز خار
خوی هرکس از گوهر تن بودزگل بوی و از خار خستن بود
گر از هیچ سو دشمنی کینه جویترا هست جایی به من بازگوی
که گر هست مه چون نبرد آورمزگردون سرش زیر گرد آورم
هرآن کار کآن بر نیاید به زر	برآید به شمشیر و زور و هنر
بدو گفت کایدر به دریا درونپسِ کشورم هفته ای ره فزون
جزیری بزرگست با رنگ و بویدو صد میل ره لاقطه نام اوی
دو ره صدهزار از یلان مرد هستنکو روی لیکن همه بُت پرست
جز از چرم میشان نپوشد چیززبانی دگرگونه گویند نیز
گه رزم دارند خفتان و ترگزندان ماهی و کمیخت کرگ
بود گرزهاشان سر گوسفندزده در سر دستواری بلند
به سنگ فلاخن ز صدگام خواربدوزند در خره میخ استوار
از ایشان یکی وز ما ده به جنگزبونشان بود شیر جنگی به چنگ
نه از بیمشان سوی دریاست راهنه از دستشان کشورم را پناه
به پیکارشان نیستم چاره چیزنه زآهن سلیحی توان برد نیز
که کهشان همه سنگ آهن کشستدری تنگ و ره در میان ناخوشست
درآن ره زکف تیغ و مِغفر زسربپرد به کردار مرغ بپر
همه کوهش از آهن گونه گونسلیحست آویخته سرنگون
یکی مرد فرزانه زایران زمینچنین گفت با پهلوان گزین
که گر سیر برسنگ آهن ربایبمالی ناجنبد آهن زجای
به سرکه از آن پس چو شوییش بازدگر ره کشد نزدش آهن فراز
کنون هرسلیحی که از آهنستاگر خنجر و ترگ اگر جوشنست
به کشتی به سیر اندرون کن نهانچنان کرد پس پهلوان جهان
ده و دو هزار از سپه بر شمردبه هفتاد کشتی پراکنده کرد
دگر نزد عم زاده انجا بماندببرد انچه بایست و کشتی براند
گرفتند از آنجای راهِ درازجزیری پدید آمد از دور باز
یکی مرد پویان ز بالا به پستخروشان گلیمی فشانان به دست
چو دیدند بُد ز اندلس مهتریبه پرسش گرفتندش از هر دری
چنین گفت کز بخت روز نژندمرا باد کشتی بایدر فکند
ازین کُه دمان نره دیوی شگفتبرون آمد و کشتی ما گرفت
دو صد مرده بودیم نگذاشت کسهمه خورد و من مانده‌ام زنده بس
سپهبد مرورا به کشتی نشاستبه کین جستن دیو خفتان بخواست
گرفتند لشکر به یک ره خروشکه او منهراس است با او مکوش
که با خشم چشم ار بر آغالدتبه یک دَم همه زور بفتالدت
دژ آگاه دیوی بد و منکرستبه بالا چهل رش ز تو برترست
به سنگی کند با زمین پست کوهسپاه جهان گردد از وی ستوه
چو غرد برد هوش و جان از هژبرز دندان درخش آیدش وز دم ابر
به جستن بگیرد ز گردون عقابنهنگ آرد از ژرف دریای آب
بدین کوه شهری بدُست استواردرو کودک و مرد و زن بی‌شمار
ز مردم وی آن شهر پرداختستنشمین به غاری درون ساختست
چو بیند یکی کشتی از دور راهبگیرد کند مردمان را تباه
ز دریا نهنگ او به خشکی بردبه خورشید بریان کند پس خورد
چو جان شد به در باز ناید ز پسز مادر دوباره نزادست کس
سپهدار گفت از من آغاز کارخود این رزم کرد آرزو شهریار
ازین زشت پتیاره چندین چه باکهمین دم ز کوهش کشم در مغاک
جز از بیم جان گر دگر نیست چیزچنان چون مرا جان و راهست نیز
به شیری توان شیر کردن شکاربه گرد سواران رسد هم سوار
بسی لابه کردند و نشنید گردپیاده برون رفت و کس را نبرد
همی گشت بر گرد آن کوه برزبه بازو  کمان و به کف تیغ و گرز
به ناگه بدان دیوش افتاد چشمورا دید در ژرف غاری به خشم
یکی جانور گونه پر جنگ و جوشکه هرکش بدیدی برفتی ز هوش
چو شیرانش چنگال و چون غول رویبه کردار میشان همه تنش موی
دو گوشش چون دو پرده پهن و درازبرون رسته دندان چو یشک گراز
ستبری دو بازو مه از ران پیلرخش زرد و دیگر همه تن چو نیل
همی ریخت غاز از غرنبیدنشهمی شد نوان کُه ز جنبیدنش
ز صدرش فزون ماهی خورده بودز پیش استخوان‌هاش گسترده بود
دل شیر جنگی برآورد شوربه یزدان پناهید و زو خواست زور
گشاد از خم چرخ تیری به خشمزدش بر قفا برد بیرون ز چشم
غریوی برآمد از آن نره دیوکه برزد به هم غار و که ز آن غریو
دمان تاخت کآید به بالا ز زیردَرِ غاز بگرفت گرد دلیر
به خنجر یکی پنجه بنداختشدر آن غاز هر سو همی تاختش
به هر گوشه کز غاز سر بر زدییکی گرزش او زود بر سر زدی
فغانی ز دیو و خروشی از اویبه خون غرقه دیو و به خوی جنگجوی
نبودش برون راه کآید به جنگبرو بر شد آن غار زندان تنگ
ز خونش که شد در هوا شاخ شاخهمی لاله رُست از شخ سنگلاخ
خروشش همی برگذشت از سپهردَمش آتش و دود بر زد به مهر
چو بیچاره شد کوه کندن گرفتز بر سنگ خارا فکندن گرفت
به هر سنگ کافکندی از خشم و کینهوا تیره گردید و لرزان زمین
گرفته رهش پهلوان سپاههمی داشت از سنگ او تن نگاه
گهی گرز کین کوفتش گاه سنگدر آن غار کرده برو راه تنگ
سرانجان سنگی گران از برشفرو هشت کافشاند خون از سرش
تن نیلگونش و شی پوش گشتچو کوهی بیفتاد و بی‌هوش گشت
سبک پهلوان پیش کآید به هوشبه غار اندرون رفت چون شیر زوش
دو دست و دو پایش به خم کمندفرو بست و دندانش از بُن بکند
گزید از سپه مرد بیش از شماربه کشتیش بردند از آن ژرف غار
همی غرقه شد کشتی از بار اویسپه خیره یکسر ز دیدار اوی
رسن‌های کشتی جدا هر کسیببستند بر دست و پایش بسی
چو هُش یافت هرگاه گشتی دمانگسستی فراوان رسن هر زمان
زدی نعره‌ای سهمگین کز خروششدی کوه جنبان و دریا به جوش
جهان پهلوان پیش دادآفرینبسی کرد با مهر یاد آفرین
وز آنجای با لشکرش یکسرهبه یک هفته آمد برِ قاقره
خبر زی جزیره شد اندر زمانبیآمد برون لشکر بدگمان
بدیدند هفتاد کشتی به راههمه بادبان بر کشیده به ماه
چو کوهی روان هر یکی بادواربه هر کُه بر ابری ز بر سایه دار
چو در سبز دشتی سواران جنگازو هر سواری درفشی به چنگ
چو بر روی گردون پراکنده میغهمه میغ پر برق و تابان ز تیغ
سبک رزم را لشکر آراستندبه کوشش همه شهر برخاستند
برآمد به خشکی جهان پهلوانبزد صف کین با دلاور گوان
غَو کوس و نای نبردی بخاستزمین گرد شد گشت با چرخ راست
نبد راه ایرانیان زی گریغز پس موج دریا بدون پیش میغ
بکردند رزمی گران بس شتاببه خون بر زمین شد چون کشتی بر آب
صف از رمح دیوار نی بسته شدز هر گوشه پیکار پیوسته شد
به گردون رسید از بس آشوب جنگبه دریا نهیب و به کوه آذرنگ
جهان نعره مرد جنگی گرفتخور از رنگ خون چهر زنگی گرفت
نوند یلان بد عنان دار میغبه کف بر درخش روان بار تیغ
ز پیکان‌ها خون به جوش آمدهکمان گوش‌ها نزد گوش آمده
ز شمشیر شیران پر از ماز ترگز گرز دلیران به پرواز مرگ
سواران ز خون لاله کردار چنگپیاده چو مصقول دامن به رنگ
ز بس تن به شمشیر بگذاشتهچنان ژرف دریا شد انباشته
یکی میغ بست آسمان لاله گوندرخش وی از تیغ و باران ز خون
شه قاقره تاخت از قلبگاهپیاده بَرِ پهلوان سپاه
گران استخوان شاخ ماهی به دستزدش بر سپر خرد بر هم شکست
نیامد به گرد سپهبد گزندسبک جست چو نره شیری ز بند
چنان زدش بر گردن از خشم تیغکجا سرش چون ماغ شد بر به میغ
گریزان شد آن لشکر قاقرهنه شان میمنه ماند و نه میسره
دلیران ایران به خشم و ستیزپی گردشان برگرفتند تیز
بکشتند از ایشان کرا یافتندبه تاراج زی شهر بشتافتند
به غارت همه شهر کردند پاکبه شمشیر کردند خلق‌اش هلاک
گرفتند چندان بی اندازه چیزکه نادید کس هم بنشیند نیز
هم از سیم و گوهر هم از زر و مشکهم از عود ترهم ز کافور خشک
سوی کاخ شه سر نهادند زودبه تاراج بردند از آن هر چه بود
چه جفتش چه خوبان آراستهچه از بی کران گونه گون خواسته
یکی کاخ دیدند نو شاهواربه زر و گهر کرده یکسر نگار
ز عنبر یکی باره دیوار بامزمین سوده کافور و در عود خام
بکندند و بومش بر انداختندهمه کاخ و ایوان بپرداختند
اسیران ایران گره را ز بندگشادند نادیده یک تن گزند
ز شهر دگر هر چه آورده بوداگر خواسته بود اگر برده بود
چهل کشتی از وی بینباشتندوز آنجا ره طنجه برداشتند
خکخ طنجه از شادی آذین زدندبه ره کله از دیبه چین زدند
جهانی به نظاره منهراسگرفته ز دیدنش هرکس هراس
چپ و راست هر سوش دو زنده پیلوی اندر میان همچو کوهی ز نیل
روان چار کوه‌اند گفتی بپایببسته به یک میل جنبان ز جای
دو بازو به زنجیرها کرده بندبه هم بسته در پای پیلان زند
به پیلان بر از زورش آسیب کوسغریوش چو اندر که آوای کوس
ز بانگ و دمش هر کجا شد به راهزمین بود جنبان و گردون سیاه
همه راه تا خانه شهریاربُد از زر و دُر پهلوان را نثار
ز بس گوهر اندر کنار و به خمهمه پشت جنبندگان بُد به خم
بدون هرکس از خرمی سور کردکز ایشان بدِ دشمنان دور کرد
یکی مه سپهبد بر شاه بودکه رفتنش چون سر ماه بود
به شاه و بزرگانش هر گونه چیزببخشید و هر بدره کآورد نیز
دگر پیش یکسر بزرگان و خردخطی کرد بر شاه و او را سپرد
به پیمان که چون باشدش کام و رایفرستد ز گنج آن همه باز جای
وز آن جا سپه برد زی قیروانکه گیرد به تیغ از فریقی روان
بَر مرز افریقیه با سپاهچو آمد شد این آگهی نزد شاه
که ضحاک از ایران سپاهی به جنگفرستاد و اینک رسیدند تنگ
همانا که افزون ز پنجه هزارسواراند کین جوی و خنجر گزار
مه از پیل گردیست سالارشانطرازنده رزم و پیکارشان
دلیری که چون رای جوشن کندز خنجر به شب روز روشن کند
به روبه شمارد گه شور شیردو پیل آرد آسان به یک زور زیر
چو گردد سوار از بلندی سرشاز ابر اوفتد زنگ بر مغفرش
بود با کمند از بر پیل مستچو بر کوه شیر اژدهایی به دست
به سر برزند خنجر مغز کاوبرآهنجد از پشت ماهی و گاو
یکی دیو دژخیم چون منهراسببست و جهان کرد ازو بی هراس
چو دشمن به جنگ تو یازید چنگشود چیر اگر سستی آری به جنگ
نمد زود برکش چو شد ز آب ترکه تا بیش ماند گرانبارتر
جهان زین خبر بر شه قیروانچنان شد که همگونه شد قیروان
بدندش سه سالار فرمانگزاریکی را سپرد از یلان صدهزار
درفش و کله دادش و اسپ و سازفرستاد مر جنگ را پیشباز
بر شهر فاس این دو لشکر به همرسیدند بر منزلی بیش و کم
همان گه فرستاده ای ره شناسز سالار افریقی از شهر فارس
بر پهلوان با پیامی درشتبیامد شتابنده نامه به مشت
چنین گفت کز رای مرد خردرَهِ باد ساری نه اندر خورد
کس از باد ساری دلاور مبادکه بدهد سر از باد ساری به باد
سپه را چو مهتر سبکسر بودشکستن گهِ کین سبکتر بود
ترا جنگ با شاه ما آرزوستگمانی بری کاو زبون چون بهوست
ندانی که چون او شود رزم کوشزمانه به زنهار گیرد خروش
سر خنجرش خون کند آب ابرسم چرمهش داغ چرم هژبر
کدامین دلاور که در کینه گاهبه پیشانی اش کرد یارد نگاه
چو باشد یکی تیغ در مشت اوبه از چون تو سیصد یک انگشت او
تبه کردی از خیرگی رای خویشبه گور آمدستی به دو پای خویش
ولیکن کنون کآمدی با سپاهبه هنگام پیش آی و زنهار خواه
از آن پیش کت بسته زی شهریاربرم پوزشت نآید آن گه به کار
چو بشنید ازینسان سپهدار گردفرستاده را دست دشنام برد
به خنجر زبانش ز بُن بست کردز مویش ز نخ چون کف دست کرد
زبان بدش تیغی به گاه پیامشد آن تیغش اندر زمان بی نیام
بیآمد یکی پیر کافور مویز پس باز شد کودکی خوب روی
چه کردن زبان بر بدی کامکارچه در آستین داشتن گرزه مار
زبان را بپای از بداندیش و دوستکه نزدیکتر دشمن سرت اوست
چنین گفت دانا که با خشم و جوشزبانم یکی بسته شیرست زوش
به بند خرد درهمی بایمشکه بکشدم ترسم چو بگشایمش
فرستاده را چون برینسان براندهمان گه سپه رزم را برنشاند
دهی بُد به راه اردیه نام اوییکی بیشه گردش پر از رنگ و بوی
همه بیشه زیتون و خرما درختدرو لشکر دشمن افکنده رخت
بیامد به هنگام خورشید زردفروکوفت ناگاه کوس نبرد
ز هر سو پراکنده رزمی بساختسپه را ز بیشه به هامون بتاخت
شد از گرد ره شست گردان گرهگران کرد یال یلان را زره
برآمد از ایرانی و خاورینبردی که شد چرخ بر داوری
جهان بیشه شیر غرنده گشتز تیر ابر پر مرگ پرنده گشت
ز توفیدن بوق و از بانگ تیزهمه بیشه بد چون خزان برگ ریز
به خون در نهنگ از شنا داشتنسته گشت و شیر از سر او باشتن
ز خنجر همه دشت خنجیر بودکمند از یلان دام و زنجیر بود
یل پهلوان گرز کوشش به چنگهمی جست تیز و همی جست جنگ
به کین تا شب آمد همی جنگ کردشب تیره هم برنگشت از نبرد
وز آن سو جهان پهلوان با سپاهبیآمد به یک منزلی کینه خواه
به خیمه بپوشید روی زمیندبیر نویسنده را گفت هین
گشای از خرد با سر خامه رازبه افریقی از من یکی نامه ساز
سخن ها درشت آر از اندازه بیشبخوانش به فرمان کمربسته پیش
نویسنده کرد از سخن رستخیزبه انگشت مر خامه را گفت خیز
شد آن خامه چون کش بتی دلپذیرپرستنده دست چابک دبیر
ز دیده همی ریخت باران مشکبه مژگان همی رفت کافور خشک
گهی شد سوی خانه آبنوسگهی روی سیمین زمین داد بوس
نخست از سخن نام یزدان نگاشتکه گشت زمان بر دو گونه بداشت
سرانجام گیتی در آغاز بستروان را به باد روان بازبست
خم چرخ جای خور و ماه کردزمین گوهران را گره گاه کرد
دگر گفت ضحاک شاه جهانشنیدست کردارت اندر نهان
که خوبربد و جنگ و خون کرده ایز بند خرد سر برون کرده ای
مرا مارکش خواندی و بدسرشتورا نام بردی به دشنام زشت
شدی سرکش ایدون که چون اهرمننبینی همی کس بر از خویشتن
کنون کآمدم رزم را خاستیجز آن دیدی آخر که خود خواستی
به چونین سپه رزم سازی همیبه زور تن خویش نازی همی
ز کژی نشد راست کار کسیبه ناموس رستن نشاید بسی
نگه کن که بر منهراس دلیرچه آوردم از گرز و بازوی چیر
گرفتمش تنها چو جنگ آمدمکه در جنگش از یار ننگ امدم
همه کشور روم تا بوم هندبه هم بر زدم تا به دریای سند
نه کس دید یارست برز مرانه برتافت که باد گرز مرا
کنون گر نگیری ره کهترینیایی بر شه به فرمانبری
به خاک آرم از ماه گاه ترابراندازم این بارگاه ترا
تنت پیش جنگال شیران برمسرت بر سنان سوی ایران برم
به قرطاس بر شد پراکنده حرفبسان صف ماغ بر سوی برف
چو نامه ز خامه به پایان رسیدسپهبد فرستاده ای برگزید
دگر داد چندی پیام درشتفرستاده پوینده نامه به مشت
چو آمد به نزد شه قیروانورا دید خندان و روشن روان
در ایوانی از در تابان چو هورزمین جزع و دیوار زر و بلور
دو صد کنگره گردش افراشتهبه یاقوت و در پاک بنگاشته
برابرش یک صفه دیگر ز زرزمین سیم و بامش ز جزع و گهر
چهل تخت زرین درو شاهوارچه از زرش پایه چه از زر نگار
میانش ستون چار بفراختهسپید و بنفش از گهر ساخته
چنان هر ستونی که از رنگ و تابگرفتی ز دیدار او دیده آب
مهین مسجد قیروان را کنونبماندست گویند از آن دو ستون
نهفته به زربفت چینی طرازگشایندشان روز آدینه باز
برافراز تختی ز زر بود شاهبه کف گرز و بر سر ز گوهر کلاه
فرسته چو بایست نامه بدادنویسنده بر شه همی کرد یاد
به چوگان فرهنگ پیر کهنبه میدان درافکند گوی سخن
بگفت آنچه بود از پیام درشتتو گفتی که شمشیر دارد به مشت
برافروخت افریقی از کین و خشمبپرداخت دل بر فرسته ز چشم
بفرمود تا دست سیلی کنندبه سیلی قفاگهش نیلی کنند
درودش سمن برگ پیری ز بنبرید از دهانش درخت سخن
به خواری و دشنام و زخمش برانددو سالار بودش ز لشکر بخواند
دو ره صد هزار از دلیران خویشبدیشان سپرد و فرستاد پیش
فرسته بر پهلوان شست پگاهخبر دادش از کار شاه و سپاه
ز کینه به خون پهلوان شست چنگسبک با سپه شد پذیره به جنگ
دو لشکر برابر چو صف ساختنددرفش از بر مه برافراختند
شد از مهره بر مهر گردون خروشدم نای در گیتی افکند جوش
زمین با مه از گرد انباز گشتز خاور ز بس بیم خور بازگشت
شد از سهم پیچان نهنگ اندر آببه که بچه بگذاشت پران عقاب
دو لشکر به یک ره به هم بر زدندگهی گرز کین گاه خنجر زدند
ز بس کشته چرخ انبه جان گرفتز بس خون دل خاره مرجان گرفت
ز گردان خاور سواری چون ابربرون تاخت با خشت و با خود و گبر
صف خیل ایران پراکنده کردکجا تاخت هامون پرافکنده کرد
چو آمد بر پهلوان سپاهورا دید بر پیل در قلبگاه
بر او خشتی از گرد بنداخت تفتتو گفتی ستاره ز گردون برفت
نیامد گزندی به گرد دلیرهم آن گه ز پیل ژیان جست زیر
گربیانش با دست و خنجر به مشتگرفت و ز زین زد بکشت
هم از جای تن بر سپه برفکندهمه شیب و بالا تن و سر فکند
بدین دست نیزه بدان تیغ تیزبه هر دو همی جست رزم و ستیز
به نیزه ز پیل و به خنجر ز زینیلان را همی زد نگون بر زمین
دو سالار افریقی از جنگ اوبماندند بیچاره در چنگ او
سپه نیز ترسنده گشتند پاکز خون همچو شنگرف شد روی خاک
یکی زآن دو سالار هشیارترخردمند تر بود بیدار تر
به دل گفت کز شاه شد تاج و تختهمین پهلوانست پیروز بخت
کنون پیش از این کاین کآشفته سپاهشکست آرد و کار گردد تباه
بر پهلوان رفت باید مراکز او هر چه خواهم برآید مرا
هر آن کاو به هر کار بیند ز پیشپشیمان نگردد ز کردار خویش
بتر کار را چاره باید گزیدکه آسان ترین چاره آید پدید
سبک با تنی صد سران سپاهبر پهلوان رفت زنهار خواه
بسی چیز دادش جهان پهلوانپذیرفت شاهیش بر قیروان
همان گه به کین با سپه حمله بردهر آن کس که بود از دلیران گرد
ز کشته چنان گشت بالا و پستکه هامون ز مرکز فروتر نشست
به قلب آنکه سالار بد کشته شدبداندیش را بخت برگشته شد
سواران بریدند بر گستوانفکندند خفتان و خنجر گران
یکی خواست زنهار و دیگر گریختدلاور ز بد دل فزونتر گریخت
چنین تا در قیروان ز اسب و مردهمه کشته بد راه پر خون و گرد
ز بس خون که هر جای پاشیده شدزمین همچو روی خراشیده بود
چو آورد چرخ از ستاره سپاهشب قیرگون شد گروس سیاه
مه اندر کمان برد سیمین سپرمیان بست جوزا به زرین کمر
سپهبد بر مرز شهر ودودبزد خیمه تا لشگر آمد فرود
بر افریقی از غم جهان تنگ شددگر ره سوی چاره جنگ شد
همه شب به کار سپه ساختننپرداخت از گنج پرداختن
چو بر تیره شعر شب دیر بازسپیده کشید از سپیدی طراز
فرو شست خور تخته لاژوردز سیمین نقطها به زر آب زرد
به دشت آمد از قیروان لشکریکه بگرفت از انبوهشان کشوری
سپاهی چو آشفته پیلان مستهمه نیزه و تیغ و خنجر به دست
گرفته سپرها ز چرم نهنگبرافکنده برگستوان پلنگ
بپوشیده جوشن سران سپاهز ماهی پشیزه سپید و سیاه
یکی بهره خفتان ز کیمخت کرگهم از مهره ماهیان خود و ترگ
دو لشکر برآمیخت از چپ و راستده و گیر پرخاش جویان بخاست
ز هر سو همی کوس زرین زدنددو سرنای رویین و سرغین زدند
پر از رنگ یاقوت شد چهر تیغپر از اشک الماس شد چشم میغ
هوا پرده ای گشت چون قیر تارز خشت اندرو پود و از تیر تار
ز نعره طپان گشت بر چرخ هوربه دیگر جهان جنبش افتاد و شور
خم چرخ ها پاک بر هم شکستدل کوه و هامون به هم در نشست
ز بس خون روان گشته هر سو به تگزمین چون جگر جوی ها گشته رگ
ز بر مغز کوبنده کوپال بودبه زیر از یلان بر سر او بال بود
شده گرد چون زنگی بی دریغز خون گشته گریان و خندان ز تیغ
از آن کین به دریا درون ماهیانهمی کشته خوردند تا ماهیان
سه روز این چنین بود خون ریختنبماندند گردان از آویختن
نه کس را بد آرامش از جنگ و تابنه در مغز هوش و نه در دیده خواب
کف از زخم سوده میان از کمردل از جان ستوه آمده تن ز سر
شد آکنده بر مرد خفتان ز گردز خوی درع ها گشته زنگار خورد
ز بس جوش پیکار و رنج و نهیبنماند آن زمان پهلوان را شکیب
میان دو صف با کمان و کمندبرون تاخت بر زنده پیلی بلند
به زیر اندرش گفتی آن پیل مستسپه کش دزی بود پولاد پست
دزی بر سر چار پویان ستونز درگاه دز اژدهایی نگون
بسان کهی جانور تیزپویچو کوهی خروشنده کوهی بر اوی
ددش خشت و نخچیر مردان جنگگیاهاش ژوپین عقابش خدنگ
ز کفکش همی جوش بر ماه شدزمین هر کجا گام زد چاه شد
سپهدار با اژدهافش درفشبراو کرده از گرد گیتی بنفش
به افریقی اندر زمان ترجمانفرستاد و گفت ای بد بدگمان
اگر هست چرخ روان یاورتفرشته همه آسمان از برت
زمین گنج داری و دریا پناهزمانه رهی و ستاره سپاه
درختان شوندت دلیران جنگهمه برگشان تیغ گردد به چنگ
شود کوه خفتان و خورشید ترگکند یاری تیغ و خشت و تو مرگ
بکوبم به گرز گران سرت پستکنم رخش از خون برو تیغ و دست
نیرزی تو و هر چه لشکرت پاکبر زخم گرزم به یک مشت خاک
به یزدان گناهیت بودست سختکت امروز پیش من افکند بخت
به زنهار پیش آی و فرمان پرستکه تا پیش شاهت برم بسته دست
و گرنه بیا هر دو از نام و ننگبکوشیم پیش دو لشکر به جنگ
ببینیم تا بر که سختی بودکه را زآسمان چیربختی بود
نباید مگر نیز خون ریختنرهند این دو لشکر از آویختن
دژم گفتش افریقی جنگجویکه رو خیره سر پهلوان را بگوی
تو مشتی نخوردی ز مشت تو بیشهمان زان گران آیدت مشت خویش
جوان کش بود زهره و زور تننبیند کسی برتر از خویشتن
به ماری بسباس دیوی نژندچه جویی بزرگی و نام بلند
که تنها چو خنجر به چنگ آیدمز صد چون تو در جنگ ننگ آیدم
به کین بر زمان پیشدستی کنمبه یک دست با پیل کستی کنم
اگر تنت دریاست ور کوه برزبسوزم به تیغ و بدرم به گرز
تو پنجه تن از لشکرت بر گزینمن از لشکر خویشتن همچنین
ببینیم تا در صفت کارزارکرا زین دو لشکر بود کار زار
چو ایشان ز هم می برآرند گردمن و تو شویم آن گهی هم نبرد
بگفتند و هر دو ز لشکر چو شیرگزیدند پنجاه گرد دلیر
به ده جای کوشش برانگیختندبهم پنج پنج اندر آویختند
هم آورد سوی هم آورد شددر و دشت بر چرخ ناورد شد
گه این جست کین و گه این گفت نامگه آن تیغ بر کف گه آن خم خام
هوا پر تف خشت و شمشیر شددل ریگ تشنه ز خون سیر شد
به کم یک زمان اندر آوردگاهبد افکنده هر سو یکی کینه خواه
به سر بر شده خاک و خون خود و ترگبه کف تیغشان گشته منشور مرگ
چو از نیمه خم یافت بالای روزبه خاور شتابید گیتی فروز
ز خیل فریقی نبد مانده کسیکی بود از ایرانیان کشته بس
خروش درای و غو نای و کوسبرآمد ز ایرانیان برفسوس
شه قیروان رخ پر از رنگ شداز افسوس گرشاسب دلتنگ شد
خروشید کاکنون مرا و تراستبه نزدیک او تاخت از قلب راست
یکی خشت شاهین زو مارپیچبه کف داشت کز پیچ ناسود هیچ
بزد بر سر پیل و برگاشتشبر این گوش و ز آن گوش بگذاشتش
زدش دیگری بر قفا ناگهانکه رستش چو دندان برون از دهان
خروشی بزد پیل و بفتاد پستسبک پهلوان جَست و بفراخت دست
چنان کوفت بر سرش گرز از کمینکه زیرش بلرزید نیمی زمین
برآمیخت مغزش به خون و به خاکسپه روی برگاشت از جنگ پاک
گریزان چنان شد در آن گرد گردکز انبه همی مَرد بر مَرد مرد
چو شب را دونده نوند سیاههمه تن شد ابلق ز تابنده ماه
همه دشت بد رود خون تاختهسلیح و درفش و سرانداخته
کسی رست کاو شد به شهر اندروندگر کشته شد آنکه ماند از برون
سلیح و سلب هر چه بر دشت و کوهبد افکنده از خیل خاور گروه
همه برگرفتند ایران سپاهکس اندر شمارش ندانست راه
چنینست و زینگونه تا بد بسستزیان کسی سود دیگر کسست
یکی تا نیابد غم رفته چیزبدان هم نگردد یکی شاد نیز
زمین تا به جایی نیفتد مغاکدگر جای بالا نگیرد ز خاک
سپهدار از آن پس بر شهر تنگهمی بود سه روز و نامد به جنگ
چهارم چوزد گنبد لاژوردبه کهساربر چتر دیبای زرد
به زاری بزرگان آن بوم و شهربرفتند نزد سپهبد دو بهر
کفن در بر و برهنه پای و سریکی کودک خرد هر یک به بر
و گر گونه گون هدیه آراستندوز او پوزش بی کران خواستند
که افریقی ار گم شد از رای و راهز بدبختی آورد بر خود سپاه
ستم کرده بر ما و بر جان خویشکنون هر چه کرد از بد آمدش پیش
اگر زاد مردی کند پهلونببخشد به ما بی گناهان روان
ور افکند خواهد سر ما ز تنشدیم اینک از پیشش اندر کفن
وز این کودکان گر دلش کینه جویببریم سرشان همه پیش اوی
سپهبد به جان ایمنی دادشانسوی خانه دلخوش فرستادشان
پس آن گرد سالار را خواند پیشکه پذرفته بودش به زنهار خویش
ورا کرد بر قیروان شهریاربه شادی شدندش همه شهر یار
نثار و گهر ریختش هر کسیز هر گونه بردند هدیه بسی
از آن پس که سالار بد شاه گشتبلند افسرش همبر ماه گشت
جهان را چنین پای بازی بسستز هر رنگ نیرنگ سازی بسست
یکی را ز ماهی رساند به ماهیکی را زماه اندر آرد به چاه
یکی چیز گرد آرد از هر دریکشد رنج و  آسان خورد دیگری
نه زو شاید ایمن بدن روز نازنه نومید گشتن به روز نیاز
بسا کس که صد ساله را کار پیشهمی کرد و روزی نبد زنده بیش
بسا سالیان بسته دربند و چاهکه شد روز دیگر خداوند جاه
جهان جاودان با کسی رام نیستبه یک خو برش هرگز آرام نیست 
دهندست لیکن به هر روی وسانبه کس چیز ندهد جز آن کسان
به شادی بداردت بر بیش و کماز آن پس دلت را سپارد به غم
یکی میهمان خوان پر خواستستتو مهمان زمین خوان آراستست
بخور زود ازو میهمان وار سیرکه مهمان نماند به یک جای دیر
چه باید که رنج فزونی بریمبه دشمن بمانیم و خود بگذریم
پس آن خیره سالار بی مغز و هوشکه گرشاسب بینیش ببرید و گوش
ببرد از مهان مرد صد را ز راهچنان ساخت کز بامداد پگاه
چو آید نشیند بر شاه دیرگروهش نهان درع و خنجر به زیر
ببرند ناگه سر شاه پستبگیرند شهر و برآرند دست
کسی بر شه آن راز بگشاد زودشه از ویژگان هر که شایسته بود
سگالید با ریدگان سرایهمه تیغ و جوشن به زیر قبای
درفش شب تیره چون شد نگوندمید آتش از گنبد آبگون
نشست از برگاه بر شاه نومهان ره گشادند بر راه رو
چو پیش آمد آن بدنهان باگروهبرافراخت سر شاه دانش پژوه
بدو گفت کای غمر تنبل سگالهمی خویشتن بر من آری همال
کجا آید از غرم کار هژبرکجا آورد گرد باران چو ابر
چو گل کی دهد بار خار درشتگهر چون صدف کی دهد سنگپشت
نخستینت کو گنج و فّر و مهیکه جویی همی همت تخت و تاج شهی
نه بر جای هر کار ناسازواربود چون پلی ز آنسوی جویبار
تن غنده را پای باید نخستپس آن گاه خلخالش باید جست
چنان دادن که بخت بدت خوار کردجهان خوردت و باز نشخوار کرد
نبد در خور پهلوان این هنرکه گوشت برید و نبرید سر
پس از خشم فرمود و گفتا دهیدهمه دست و خنجر به خون بر نهید
دل و مغز سالار کردند چاکگروهانش را سر بریدند پاک
فکندند تنشان به ره یکسرهسرانشان زدند از بر کنگره
که تا هر که بیند بداند درستکه با شه نباید ز دل کینه جست
رهی را شدن در دم مار وشیراز آن به که بر شاه باشد دلیر
زمانه چنینست ناپایدارگه این راست دشمن گه آنراست یار
دو دستست مر چرخ را کارگربدین تیغ دارد به دیگر گهر
یکی را به گوهر توانگر کندیکی را تن از تیغ بی سر کند
چو زآن کین شد آگه سپهدار گوببد شاد و آمد بر شاه نو
پسندید و گفت از تو چونین سزیدکه زشتیست بند بدان را کلید
سپهریست شاهی ورا مهر گاهبروجش دژ و اخترانش سپاه
عروسیست خوبیش باژ و درمسر تیغ پیرایه کابین قلم
به سهم و سکه داشت باید شهیکه چون این دو نبود نپاید مهی
به کار شهی هر که سستی کندبر او هرکسی چیره دستی کند
نکوکاری ار چه براز خوش خوییستبسی جای زشتی به از نیکوییست
از آن پس یکی ماه دل شادمانبدش با مهان سپه میهمان
نهان گنج افریقی از زیر خاکهمه هر چه گفتند برداشت پاک
همان جا بر قیروان با سپاههمی بود دل شادمان هفت ماه
بزرگان و شاهان خاور زمینز بربر دگر سروران همچنین
جدا گونه گون هدیه ها ساختندیکی گنج هر یک بپرداختند
شده آکنه نزدیکش از باژ و ساوز دینار گنجی چهل چرم گاو
ز خرگاه و از فرش و پرده سرایکه داند شمرد آنچش آمد به جای
طرایف بد از پیل سیصد فزونهم از بار دیبا هزاران هیون
دگر چاره صد بختی و بیسراکبه صندوق ها بار بد سیم پاک
دو صد شاخ مرجان به زر کرده بندکه هر شاخ از آن بد درختی بلند
دو صد درج در و عقیق و بلورهزار و چهل تنگ خز و سمور
ز زنگی و نوبی سیه تر ز قاردگر گونه گون برده بی شمار
هزار استر زینی تیز گامسراسر به زرین و سیمین ستام
هزار از عتابی خز رنگ رنگشتروار صد پوست های پلنگ
ز موی سمندر صد و شست ازارکه نکند بر او آتش تیزکار
زرافه چهل گردن افراشتههمه تن چو دیبای بنگاشته
همه برد از آن جایگه با سپاهبه سوی قراطیه برداشت راه
سوی قرطبه رفت از آن جای شادیکی شهر خوش دید خرم نهاد
به نزدیک او ژرف رودی روانکه خوشیش در تن فزودی روان
از آن شهر یک چشمه مردی سیاهبدان ژرف رود آمدی گاه گاه
ز شبگیر تا نیم شب زیر آببدی اندر او ساخته جای خواب
نهالی به زیرش غلیژن بدیزبر چادرش آب روشن بدی
نه زآب اندکی سر برافراشتینه چون ماهیان دم زدند داشتی
همان کرد پیش سپهدار نیزسپهبدش بخشیدش بسیار چیز
وز آن جا شتابان ره اندر گرفتبه نخچیر کردن کمان بر گرفت
به گلرخش روزی سپرده عنانهمی تاخت بر دم گوری دمان
سرانجام از او گشت نادیده گورشد او تشنه و مانده در تف هور
به کوهی بر آمد همه سنگ و خارتنی چندش از ویژگان دستیار
رهی دید بر تیغ کهسار تنگبر آن ره ستودانی از خاره سنگ
بدو در تن مرده ای سهمناکشده استخوانش از پی و گوشت پاک
سرش مهتر از گنبدی بد بلندگره گشته رگ ها بر او چون کمند
دو دندانش مانند عاجین ستونیکی ساقش از سی رش آمد فزون
به سنگی درون کنده خط ها بسیبد از برش و نشناخت آن را کسی
همی هر که بد لب به دندان گرفتدر آن کالبد مانده زایزد شگفت
سپهدار از آنجا بشد با گروههمی آب جست اندر آن گرد کوه
چو آمد بیابان یکی کازه دیدروان آب و مرغی خوش و تازه دید
در آن سایه بنشست و شد ز آب سیرسر و تن بشست و بر آسود دیر
برهمن یکی پیرخمیده پشتبرآمد ز کازه عصایی به مشت
ز پیریش لاله شده کاه برگز بس عمرش از وی سته مانده مرگ
به نزد سپهدار بنشست شادبه رومی زبان آفرین کرد یاد
پژوهش کنان پهلوان بلندچه مردی بدو گفت و سال تو چند
تو تنها کست جفت و فرزند نیپرستنده و خویش و پیوند نی
از این کوه بی بر چه داری به دستچه خوشیت کایدر گزیدی نشست
بدو گفت سالم به نهصد رسیددلم بودن از گیتی ایدر گزید
دل آنجا گراید که کامش رواستخوش آنجاست گیتی که دل را هواست
بود جغد خرم به ویران زشتچو بلبل به خوش باغ اردی بهشت
شب و روزم ایزد پرستیت راهنشست این که و خورد و پوشش گیاه
گر از آدمی نیست خویشم کسیدگر خویش و پیوند دارم بسی
خرد هست مادر مرا هش پدردل پاک هم جفت و دانش پسر
هنر خال و شایسته فرهنگ عمره داد و دین دو برادر به هم
هوا و حسد هر دو ام بنده اندهمان خشم و آزم پرستنده اند
بر این گونه ام بندگان اند و خویشکه کس ناردم هرگز آزار پیش
نی ام نیز تنها اگر بی کسمکه با من خدایست و یار او بسم
جهان را پرستی تو این نارواستپرستش خدای جهان را سزاست
جهان جان گزایست و او جانفزایجهان گم کنندست و او رهنمای
جهان جفت غم دارد او جانفزایجهان عمر کوته کند او دراز
اگر چه دشمن ترا نیست کسجهان دشمن آشکارست بس
شد آگه جهان پهلوان ز آن سخنکه فرزانه رایست پیر کهن
همی خواست تا بنگرد راه راستکش اندر سخن پایگه تا کجاست
بدو گفت کآی گنج فرهنگ و هوشنه نیکو بود مرد دانا خموش
هر آن کاو نکو رای و دانا بودنه زیبا بود گر نه گویا بود
چه مردم که گویا ندارد زبانچه آراسته پیکر بی روان
نکو مرد از گفت خوبست و خویچو شاخ از گل و میوه باشد نکوی
کرا سوی دانش بود دسترسورا پایه تا دانش اوست بس
هرآن کس که نادان و بی رای و بننه در کار او سود و نی در سخن
درختیش دان خشک بی برگ و برکه جز سوختن را نشاید دگر
بود مرد دانا درخت بهشتمرو را خرد بیخ و پاکی سرشت
برش گونه گون دانش بی شمارکه چندشچنی کم نگردد ز بار
ز دانا سزد پرسش و جست و جویکسی کاو نداند نپرسند از اوی
نخستین سخنت از خرد بد کنونبگو تاخرد چیست زی رهنمون
چنین پاسخ آراست داننده پیرکه روح ازخرد گشت دانش پذیر
تن ما جهانیست کوچک روانورا پادشا این گرانمایه جان
بجانست این تن ستاده به پایچنان کاین جهان از توانا خدای
برون و اندرونش به دانش رهستز هرچ آن بود در جهان آگهست
روانش یکی نام و جان دیگرستولیکن درست او یکی گوهرست
نه جانست این گوهر و نه روانکه از بن خداوند اینست و آن
ولیکن چو دانستی اش راه راستروان گرش خوانی و گر جان رواست
کنیفیست این تن که با رنگ و بویبدو هر چه بدهی بگنداند اوی
در او جان ما چون یکی مستمندمیان کنیفی به زندان و بند
ندارد ز بن دادگر پادشاکسی بی گنه را به زندان روا
پس این جان ما هست کرده ز پیشکز اینسان به بندست در جسم خویش
دگر دشمنان اندش از گونه گونفراوان ز بیرون تن و اندرون
چه گرما و سرما از اندازه بیشچه بدخورنی‌ها نه بر جای خویش
درون تنش هم بسی دشمن اندچه آنچ از وی آمد چه آنچ از تن اند
ز تن ساز طبعش شدن بی نواازو خشم و حجت و رشک و هوا
دگر درد و بیماری گونه گونچه مرگ و چه غمها ز دانش فزون
وی افتاده تنها درین بند تنگز هر روی چندیش دشمن به جنگ
گهش جنگ ساز این و گاه آن دگرمیان اندرو با همه چاره گر
سرانجام هم گردد از جنگ سیربر او دشمنانش بباشند چیر
سپهدار گفتنش سر سرکشانکه از جان مرا خوب دادی نشان
ولیکن چو رفتنش را بود گاهکجا باشدش جای و آرامگاه
ورا گفت بر چارمین آسمانبود جای او تا به آخر زمان
به قندیلی اندر ز پاکیزه نوربود مانده آسوده وز رنج دور
چو باشد گه رستخیز و شماربه تن زنده گرداندش کردگار
گزارد همه کارش از خوب و زشتگرش جای دوزخ بود گر بهشت
ره ایزد ار داند و جای خویش شود باز آنجا که بودست پیش
یکی دیگرش زندگانی بودکان زندگی جاودانی بود
کند هم بود هر چه رای آیدشهرآن کام باید به جای آیدش
وگر زآنکه جانی بود تیره بیننه آرایش داد داند نه دین
بماند چو بیچاره ای مستنمدچو زندانیی جاودانه به بند
خرد مایه ور گوهری روشنستچو جان او و جان مرو را چون تنست
ز هرچ آفریده شد او بد نخستهمه چیزها او شناسد درست
چراغیست از فره کردگاربه هر نیک و بد داور راست کار
روان را درستی و بینایی اوستتن مردمی را توانایی اوست
چو چشمی است بیننده و راهجویکه دادار را دید شاید در اوی
چو شاهی است دین تاجش و دادگاهدل پاک دستور و دانش سپاه
همه چیز زیر و خرد از برستجز ایزد که او از خرد برترست
درختی است از مردمی سایه ورهشش بیخ و دین برگ و بارش هنر
ز دوده یکی آینست از نهانکه بینی در او چهر هر دو جهان
بر آیین الف وار بالای راستبه هر جانور بر بر او پادشاست
ز دادار امید و فرمان و پندمر آنراست کاو از خرد بهره مند
خرمند اگر با غم و بی کس استخرد غمگسار و کس او بس است
بپرسید دیگر که تن را خورشپدیدست هم پوشش و پرورش
خور و پوشش جان پاکیزه چیستکه داند بدان پوشش و خورد زیست
چنین گفت کز پوشش به کزینمدان چیز جان را به از راه دین
شنیدم که رفته روان ها ز تنبنازند یکسر به نیکو کفن
همان پوشش است این کفن بی گمانکه هرگز نساید بود جاودان
خور جان هم از دانش آمد پدیدکه جان را به دانش توان پرورید
بود مرده هر کس که نادان بودکه بی دانشی مردن جان بود
بپرسید بازش که مرگی چه چیزهمان مرده از چند گون است نیز
چنین گفت داننده دل برهمنکه مرگی جداییست جان را ز تن
دوگوناست مرده ز راه خردکه دانا بجز مرده شان نشمرد
یکی تن که بی جان بماند به جایدگر جان نادان دور از خدای
چو جان رفت اگر رست از اندوه و بندزیان نیست گر بر تن آیدگزند
دگر باره پرسید گردگزینکه ای بسته بر اسپ فرهنگ زین
خور جان بگفتی کنون گوی راستچه چیزست جان نیز و جایش کجاست
چنین گفت دانا که جان نزد منیکی گوهر آمد تمامی تن
چه گویا چه بینا چه فرهنگ گیرچه بیداری او را چه دانش پذیر
صفتهاست او را هم از ساز اوکزایشان شود آگه از راز او
چو مرگی ز تن برگشایدش بندز دو گونه افتد به رنج و گزند
گر اندر طبایع فتد گرد گردو گر سوی دوزخ شود جفت درد
ز جان و ز جایش نمودمت راهاگر دانشی نیز خواهی بخواه
سخن اندکی گفتم از هر چه بودولیکن دراو هست بسیار سود
دل پهلوان گشت از او شاد و گفتدگر پرسشی نغز دارم نهفت
چه برناست آبستن و گنده پیرهم از وی بسی بچه گردش به شیر
به ناز آنچه زاید همی پروردچو پرورد بکشد هم آن گه خورد
جهانست گفت این فژه پیرزنبچه جانور هر چه هست انجمن
کرا زاد پرورد و دارد به نازکشد پس کند ناپدیدار باز
دگر گفت کآن گاو پیسه کدامکه هستش جهان سر به سر چارگام
به رنگی دگر نیز هر پای اویبه رفتن نگردد تهی جای اوی
ده و دو ست اندام او هر چه هستهر اندام را استخوانست شست
به پاسخ چنین گفت دانش سگالکه این گاو نزدیک من هست سال
خزان و زمستان تموز و بهاربه هر رنگ پای وی اند این چهار
ده و دو کش اندام گفتی به همبه شست استخوان هریک از بیش و کم
مه سال بیش از ده و دو نخاستشب و روز هر ماه شست است راست
دگر گفت چون جان آشفتگانیکی خوابگه چیست پر خفتگان
دو چادر همیشه برآن خوابگاهکشیده یکی زرد و دیگر سیاه
مر آن خفتگان را کی افتد شتابکه بیدار گردند یک ره ز خواب
چنین گفت کاین خوابگاه این زمیستبرو خفتگانیم هرچ آدمیست
دو چادر شب و روز دان گرد گردکه برماست گاهی سیه گاه زرد
از این خواب اگر کوته ست ار درازگه مرگ بیدار گردیم باز
دگر گفت بر هفت خوان پر گهرچه دانی یکی مرغ بگشاده پر
کجا خورد آن مرغ از آن گوهرستخورش نیز هر چند افزونترست
نه گوهر همی کم شود در شمارنه سیر آید آن مرغ بسیار خوار
برهمن در پاسخش برگشادکه این هفت خوان کشورست از نهاد
گهر جانور پاک دان مرغ مرگکه هستیم با او چو با باد برگ
همی تا خورد جانور بیشترنه او سیر گردد نه کم جانور
ازاین به مرا راه گفتار نیستسخن را کرانه پدیدار نیست
سپهبد پسندید و گفت از خردسخن های نغز این چنین در خورد
کنون از ستودانت پرسم سخنکه کردست و کی بودش آغاز و بن
بدان سان بزرگ استخوانهای کیستفرازش نبشته بر آن سنگ چیست
برهمن ز کس گفت نشنیده اممن اش همچنان استخوان دیده ام
نبشته چنین است بر خاره سنگکه گیتی به کس برندارد درنگ
به مردی منازید و بد مسپریدبدین مرده و کالبد بنگرید
بترسید از آن دادفرمای پاککه چونین کسی را کند می هلاک
ببد خیره دل پهلوان ز آن شگفتببوسیدش وساز رفتن گرفت
به خواهشگری زاو درآویخت پیرکز ایدر مرو امشب آرام گیر
به جای آمد آن چت ز من بود رایتو نیز آنچه رای من آور بجای
چنان دان که رفتن رسیدم فرازبباید شد ار چند مانم دراز
چو پیریت سیمین کند گوشواراز آن پس تو جز گوش رفتن مدار
تن ما یکی خانه دان شوره ناککه ریزد همی اندک اندکش خاک
چو دیوار فرسوده شد زیر و برسرانجام روزی درآید به سر
جوانیم بد مایه خوبیم سودجهان دزد شد سود و مایه ربود
سپهر از برم سال نهصد گذاشتکنون اسپ از آن تاختن بازداشت
قدم کرد چوگان و در زخم اویز میدان عمرم به سر برد گوی
چو فردا ز یک نیمه بالای روزشود در دگر نیمه گیتی فروز
بدان مرز رخشنده زین مرز تارگذر کرد خواهم سوی کردگار
مشو تا تنم را سپاری به خاکچو من جان سپارم به یزدان پاک
سپهبد پذیرفت و آرام کردهمه شب ز بهرش همی خورد درد
گه چاشت چون بود روز دگربیآمد برهمن ز کازه به در
ازو وز گروه خواست پوزش نخستشد آن گه بدان چشمه و تن بشست
بر آیین خویش از گیا بست ازارخروشان شد از پیش یزدان به زار
براند آب دو چشم از آن چشمه بیشهمی خواست از ایزد گناهان خویش
سرانجام چون لابه چندی شمرددو رخ بر زمین جان به یزدان سپرد
سپهدار با خیل او همگنانگرفت از برش مویه غمگنان
به آیین کفن کردش و دخمه گاهوز آن جایگه رفت نزد سپاه
سه منزل پذیره شدش با سپاهزد آذین دیبا و گنبد به راه
بیاراست ایوان چو باغ ارمنثارش گهر کرد و مشک و درم
به شادیش بر تخت شاهی نشاستبسی پوزش از بهر دختر بخواست
بدش نغز رامشگری چنگ زنیکی نیمه مرد و یکی نیمه زن
سر هر دو از تن به هم رسته بودتنانشان به هم باز پیوسته بود
چنان کآن زدی این زدی نیز رودورآن گفتی این نیز گفتی سرود
یکی گر شدی سیر از خورد و چیزبدی آن دگر هم چنو سیر نیز
بفرمود تا هر دو می خواستندره چنگ رومی بیاراستند
نواشان ز خوشی همی برد هوشفکند از هوا مرغ را در خروش
ببودند یک هفته دلشاد و مستکه ناسود یک ساعت از جام دست
سر هفته با پهلوان شاه شادیکی کاخ شاهانه را در گشاد
سرایی پدید آمد آراستهبه از نو بهشتی پر از خواسته
دراو خرم ایوان برابر چهارز رنگش گهرها چو باغ بهار
یکی قصرش از سیم و دیگر ز زرسیم جزع و چارم بلورین گهر
درش بر شبه در و بیجاده بودزمینش همه مرمر ساده بود
دو صد خانه هم زین نشان در سرایسراسر به سیمین ستون ها بپای
به هر خانه در تختی از پیشگاهبر تخت زرین یکی زیرگاه
به هر تخت بر خسروی افسریسزاوار هر افسری پرگری
در آن روشن ایوان که بود از بلوردو بت کرده زرین چو ماه و چو هور
یکی چون از چهره دیگر چو مردز یاقوتشان تاج و از لاژورد
دو صد گونه کرسی در ایوان ز زربتی کرده بر هر یکی از گهر
یکی خادم از پیش هر بت شمنبر آتش دمان مشک و عنبر به من
یکی میل از سیم بفراختهیکی چرخ گردان بر آن ساخته
ز زر برج ها و اختران سپهرروان کرده از چرخ با ماه و مهر
شب و روز با ساعت و سال و ماهبدیدی در او هر که کردی نگاه
به پدرام باغی شد اندر سرایچو باغ بهشتی خوش و دلگشای
برآورده دیوارها از رخامرهش مرمر و جوی ها سیم خام
به دیوار بر جوی ها ساختهبه هر نایژه آب رز تاخته
همه باغ طاووس و رنگین تذروخرامنده در سایه نوژ و غرو
گلی بد که شب تافتی چون چراغبه روزی دو ره بشکفیدی به باغ
دو صد گونه گل بد میان فرزدفروزان چو در شب ز چرخ اورمزد
گلی بد که همواره کفته بدیبه گرما و سرما شکفته بدی
درخت فراوان بد از میوه داربه هر شاخ بر پنج شش گونه بار
قفس ها ز هرشاخی آویختهدر او مرغ دستان برانگیخته
به هر گوشه از زر یکی آبگیرگلاب آبش و ریگ مشک و عبیر
بسی ماهی از سیم و از زر ناببه نیرنگ کرده روان زیر آب
در آن باغ یک ماه دیگر به نازببودند و با باده و رود و ساز
سر مه یکی نامه آمد پگاهز جفت سپهبد به نزدیک شاه
بسی لابه ها ساخته زی پدرکه از پهلوان چیست نزدت خبر
ز هرچ آگهی زو سود ار گزندبدان هم رسان زود نزدم نوند
که هست از گه رفتنش سال پنجمن اندر جداییش با درد و رنج
تنم گویی از غم به خار اندرستدل از تف به خونین بخار اندرست
از آن روز کم روشنی بهره نیستمرا باری آن روز با شب یکسیت
مدان هیچ درد آشکار و نهفتچو درد جدایی ز شایسته جفت
بجوشید مغز سپهبد ز مهربه خون زآب مژگان بیاراست چهر
کهن بویه جفت نو باز کردهم اندر زمان راه را ساز کرد
به شهر کسان گر چه بسیار بوددل از خانه نشکیبد و زاد و بود
بدانست رازش نهان شاه رومشد از غم گدازنده مانند موم
سبک هدیه دختر از تخت عاجبیاراست با افسر و طوق و تاج
هم از یاره و زیور و گوشوارهدو نعلین زرین گوهر نگار
ز دیبا و پرنون شتروار شستز پوشیدنی جامه پنجاه دست
پرستار تیرست و خادم چهلطرازی دو صد ریدک دلگسل
ز زرینه آلت به خروارهاز فرش و طوایف دگر بارها
عماری ده از عود بسته به زرکمرشان بر از رستهای گهر
از استر صد آرایش بارگاهیکی نیمه زآن چرمه دیگر سیاه
همیدون سزاوار داماد نیزبیاراست از هدیه هر گونه چیز
ز دیبا و دینار و خفتان و تیغهم از تازی اسپان چو پوینده میغ
بی اندازه سیمین و زرین ددهدرون مشک و بیرون به زر آزده
روان کوشکی یکسر از عود خامبه زرین فش و بند زرین قوام
یکی ماه کردار زرین سپرکلاهی چو پروین ز رخشان گهر
هم از بهر ضحاک یک ساله نیزبدو داد باژ و ز هرگونه چیز
ببخشید گنجی به ایران سپاهبرون رفت یک روزه با او به راه
ورا کرد بدرود و زاو گشت بازسپهدار برداشت راه دراز
فرستاد کس نزد عم زاد خویشکه در طنجه بگذاشت بودش ز پیش
بفرمود تا نزد او بی هراسبه راه آورد لشکر و منهراس
به طرطوس شد کرد ماهی درنگسپه برد از آنجا به دژهوخت گنگ
چو شد نزد ضحاک شاه آگهیبیاراست ایوان و تخت شهی
سپه پاک با سروان سترگهمان پیل و بالا و کوس بزرگ
زدی دست و اندر تک باد پایچناری به یک ره بکندی ز جای
چو بنهادی از کینه بر چرخ تیربه پیکان در آوردی از چرخ تیر
یکی گو گه زور صد مرد بودسر چرخ در چنبر آورده بود
همان سال ضحاک را روزگاردژم گشت و شد سال عمرش هزار
بیآمد فریدون به شاهنشهیوز آن مارفش کرد گیتی تهی
سرش را به گزر کیی کوفت خردببستش به کوه دماوند برد
چو در برج شاهین شد از خوشه مهرنشست او به شاهی سر ماه مهر
بر آرایش مهرگان جشن ساختبه شاهی سر از چرخ مه برفراخت
بدین جشن وی آتش آراستستهم آیین این جشن از او خاستست
نشستنگه آمل گزید از جهانبه هر کشور انگیخت کارآگهان
فرستاد مر کاوه را کینه خواهبه خاور زمین با درفش و سپاه
که راند بدان مرز فرمان اودل هرکس آرد به پیمان او
دگر نامه ای ساخت زی سیستانبه نزد سپهدار گیتی ستان
نخست از سخن یاد دادار کردکه از نیست هست او پدیدار کرد
بدو پایدارست هر دو جهانز دیدار او نیست چیزی نهان
تن و جان و روز و شب و چیز و جایزمین اختر و چرخ و هر دو سرای
چو کن گفته شد بود بی چه و چونهنوزش نپیوسته با کاف نون
بدین جانور خیل چندین هزاررساند همی روزی از روزگار
نه از دادن روزی آیدش رنجنه هرچند بدهد بکاهدش گنج
دگر گفت کاین نامه دلفروزفرستاده آمد به هرمزد روز
ز فرخ فریدون شه کامکارگزین کیان بنده کردگار
به گرشاسب کین جوی کشورگشایجهان پهلوان گرد زاول خدای
یل اژدهاکش به گرز و به تیرسوار هژبرافکن گردگیر
گزارنده خنجر سرفشانفشاننده خون گردنکشان
ستاننده تاج هنگام رزمنشاننده شاه بر گاه بزم
ز گام سمندش سته رود نیلبه دام کمندش سر زنده پیل
بدان ای دلاور یل پهلوانکه بادی همه ساله پشت گوان
ترا مژده بادا که چرخ بلندبه ما کرد تاج شهی ارجمند
دل هر شهی بسته کام ماستبه هر مهر و منشور بر نام ماست
کسی را سزد پادشاهی درستکه بر تن بود پادشاه از نخست
خرد افسرش باشد و دادگاههش و رای دستور و دانش سپاه
مرا این همه هست و از کردگارشدم نیز بر خسروان شهریار
چو ضحاک ناپاکدل شاه بودجهان را بداندیش و بدخواه بود
ز بهرش به پیکار هر مرز بومبه هم برزدی خاور و هند و روم
چه با اژدها و چه با دیو و شیرزمانی نگشتی ز پیکار سیر
مرا داد یزدان کنون فر و برزازاو بستدم تاج شاهی به گرز
بریدم پی تخمه اژدهاجهان گشت از جادویی ها رها
تو از جان و از دیده بیشی مراهم از گوهر پاک خویشی مرا
به تو دارم امید از آن بیشترکه بر کام ما بسته داری کمر
تو دانی که از دین و آیین و راهچه فرمان یزدان چه فرمان شاه
شنیدم که شد رام رایت زمانرسیدت نوآمد یکی میهمان
که از جان فزونتر همی دانی اشنریمان جنگی همی خوانی اش
درختیست کو شادی آرد همیوز او میوه فرهنگ بارد همی
مهی نو برآمد ز چرخ مهیکه دارد فزونی و فر و بهی
به یزدان چنین دارم امید و کامکه این ماه نو را ببینم تمام
چو نامه بخوانی سبک برگزینبرایوانت خرگاه و بر تخت زین
مزن جز به ره دم برآرای کاربیا و نریمان یل را بیار
به نو زور و دل ده سپاه مرابیآرای بر چرخ گاه مرا
که باید ترا شد همی سوی چینچو کاوه شد از سوی خاور زمین
نوند شتابنده هنجارجویچنان شد که بادش نه دریافت پوی
همه ره همی راند و که می بریدبه یک هفته نزد سپهبد رسید
سپهدار کشور چو نامه بخواندبر آن نامه زر و گهر برفشاند
نریمان بشد شاد و گفتا ممولهمه کارهای دگر بربشول
مکن بر در بندگی بند سستکه فرمان شاه این رسید از نخست
گزین کرد هم در زمان پهلوانده و دو هزار از دلاور گوان
ز گنج آنچه بایست بربست بارز هر هدیه ها گونه گون صدهزار
سپه سوی فرخ فریدون کشیدخبر چون به شاه همایون رسید
مهین کوس و بالا و پیلان و سازفرستاد با سروران پیشباز
نشست از بر کوشک دیده به راهبه دیدار گرشاسب و زاول سپاه
جهان دید پر سرکش زابلیبه کف گرز با خنجر کابلی
سه اسپه همه زیر خفتان کینبرافکنده برگستوان های چین
چو دریا دمان لشکر فوج فوجدر او هر سواری یکی تند موج
به هر موجی اندر نهان یک نهنگز شمشیر دندانش از خشت چنگ
همه نیزه داران گردن فرازنشان بسته بر نیزه موی دراز
به چاچی کمان و سغدی زرهکمند یلی کرده بر زین گره
سنان ها به ابر اندر افراشتهز چرخ برین نعره بگذاشته
سپهبد به خفتان و رومی کلاهزبرش اژدها فش درفش سیاه
به زیر اندرش زنده پیلی چو عاجهمه پیلبانانش با طوق و تاج
نریمان یل پیشش اندر سوارز گردش پیاده سران بی شمار
چو زی کوشک آمد شه از تخت خویشپذیره شدش زود ده گام پیش
گرفتش به بر برد از افراز تختببوسید روی و بپرسید سخت
ز زر چارصد بار دینار گنج به خروار نقره دو صد بار پنج 
ز زر کاسه هفتاد خروار و اند ز سیمینه آلت که داند که چند 
هزار و دو صد جفت بردند نام ز صندوق عود و ز یاقوت جام 
هم از شاره و تلک و خز و پرند هم از مخمل و هر طرایف ز هند 
هزار اسپ که پیکر تیزگام به برگستوان و به زرین ستام 
هزار دگر کرگان ستاغ به هر یک بر از نام ضحاک داغ 
ده و دو هزار از بت ماهروی چه ترک و چه هندو همه مشکموی 
از در و زبرجد ز بهر نثار به صد جام بر ریخته سی هزار 
یکی درج زرین نگارش ز دردرونش ز هر گوهری کرده پر 
گهر بد کز آب آتش انگیختی گهر بد کزو مار بگریختی 
گهر بد کزو اژدها سرنگون فتادی و جستی دو چشمش برون 
گهر بد که شب نورش آب از فراز بدیدی به شمعت نبودی نیاز 
یکی گوهر افزود دیگر بدان که خواندیش دانا شه گوهران 
همه گوهری را زده گام کم کشیدی سوی خویش از خشک نم 
چنین بد هزار و دو صد پیلوار همیدون ز گاوان ده و شش هزار 
 صد و بیست پیل دگر بار نیز بد از بهر اثرط ز هر گونه چیز 
یکی نامه با این همه خواسته درو پوزش بی⁮کران خواسته 
سپهبد بنه پیش را بار کرد بهو را بیاورد و بردار کرد 
تنش را به تیر سواران بدوختکرا بند بد کرده بآتش بسوخت
بدو گفت شاه ای یل پیل زورکه چشم بد اندیش باد از تو دور
چنانی هنر از دل و زور و رآیکه امید ما از تو آید به جای
بگفت این و از جای یازید پیشبدان تا نماید بدو زور خویش
همان پایه بگرفت و برتافت زودچنان باز کردش کز آغاز بود
ز زورش بماندند گردان شگفتبر او هر کسی افرین برگرفت
از آن پس به رامش سپردند گوشبه جام دمادم کشیدند نوش
چو بر هوش و دل باده چیری گرفتسران را سر از بزم سیری گرفت
برفتند ز ایوان فرخنده کیچه سرمست تنها چه با رود و می
همی بود یک هفته تا با سپاهسپهبد شد آسوده از رنج راه
سر هفته شه خواند و بنشاستشسزا خلعت و باره آراستش
زره دادش و ترگ زرین خویشهمان خنجر و جوشن کین خویش
سراپرده خسروی زربفتکشیده ز گرد اندرش باره هفت
به بالا و پهنای پرده سرایز بر یک ستون سایبانی بپای
چهل رش ستون وی از زر زردهمان سایبان دیبه لاجورد
همان اژدهافش درفشی دگرسرش ماه زرین به در و گهر
بی اندازه شمشیر و خفتان جنگهمان خرگه و خیمه رنگ‌رنگ
پری روی ریدک هزار از چگلستاره صد و کوس زرین چهل
صد و شست بالای زرین ستامدو پیل از سپیدی چو کوه رخام
سه ره جام هفت از گهرهای گنجز دینار بدره چهل بار پنج
سزای نریمان یل همچنینبسی هدیه‌ها داد و کرد آفرین
یکی شیر پیکر درفش بنفشبدادش همه زر غلاف درفش
بفرمود تا او بود پیشروسپهبدش خوانند و سالار تو
گزین کرد پنجه هزار از سوارپیاده دگر نامور چهل هزار
ز پیلان جنگی صد و شست پیلسپاهی چو بر موج دریای نیل
سراسر جهان پهلوان را سپردبدو گفت کآی لشکر آرای گرد
ز جیحون گذر کن میاسای هیچسپه برگش و رزم توران بسیچ
برو تا بدان مرز از آن روی آبکز او بردرخشد نخست آفتاب
به لشکر بپیمای توران زمینستان باژ خاقان و فغفور چین
هر آن کاو بتابد ز فرمان و پندبدین بارگاه آر گردن ببند
به فرمانبری هر که بندد میانممان کش به یک موی باشد زیان
چنان ران سپه را کجا بگذردبه بیداد کشت کسی نسپرد
نه بر بی گنه بد رسانند نیزنه از بی گزندان ستانند چیز
به هر جای پشتی به دادار کناز او ترس و دل با خرد یار کن
مبادا به دل رای زفتیت جفتکه هرگز نباید سپهدار زفت
بود زفت هر جا سرافکنده استدلش خسته همواره کوتاه دست
به رادی دل زفت را تاب نیستدل زفت سنگیست کش آب نیست
ز نا استواران مجوی ایمنیچو یابی بزرگی میآر منی
بترس از نهان رشک وز کینه وربه گفتار هر کس دل از ره مبر
گمان‌ها همه راست مشمر ز دورکه بس ماند از دور شیون به سور
به زنهاریان رنج منمای هیچبه هر کار در داد و خوبی پسیچ
ز سوگند و پیمان نگر نگذریگه داوری راه گژ نسپری
چو چیره شوی خون دشمن مریزمکن خیره با زیردستان ستیز
بدو داد منشور شاهان همهکه باشند پیشش به فرمان همه
چو در کشورش پهلوان سپاهدر و دشت زد خیمه بی‌راه و راه
نویسنده را گفت هین خامه گیربه خاقان یکی نامه کن بر حریر
بخوانش به فرمانبری پیش بازبگو باژ بپذیر یا رزم ساز
به دست دبیر اندرون شد قلمیکی ابر زرین کش از مشک نم
همی تاخت اشک گلاب و عبیرز صحرای سیمین ز دریای قیر
چو غواص زی در داننده راههمی‌ زد به دریای معنی شناه
هر آن در که شایسته دیدی درستبسفتی به الماس دانش نخست
چو سفتی برو مشک برتاختیوز اندیشه‌اش رشته‌ها ساختی
همه نامه از در فرهنگ و هوشبیاراست چون تخت گوهر فروش
به نام جهان داور آغاز کردکه از تیره شب روز را باز کرد
گران ساخت خاک و سبک باد پاکروان گرد گردون و آرام خاک
گهرها نگارید و تن‌ها سرشتسپردن رهش بر خردها نوشت
که گیتی به شاه آفریدون سپردبدو سیرت بد ز کشور ببرد
ز ضحاک ناپاک بستند شهیبرای فریدون با فرهی
نبشته شد این نامه دلفروزز گرشاسب فرخ شه نیمروز
به خاقان یغر شاه توران زمینکه مهرست شاهی و نامش نگین
بدان ای سزا پیشگاه بلندکه اختر یکی رای روشن فکند
سپهر از دل هر بربود دردز چهر شهی بخت بزدود گرد
جهان نوعروسی گرانمایه شدشهی تاجش و داد پیرایه شد
زمانه نگاریدش از فر و چهرستاره نثار آوریدش سپهر
زدین جامه کرد ایزد اندر برشفلک زایمنی کله زد بر سرش
چو این نوعروس از در گاه شدفریدون فرخ بر او شاه شد
به فر کیی واختر خوب و بختز ضحاک تازی ستد تاج و تخت
برآمد به مه دین یزدان پاکسر جادویی‌ها فروشد به خاک
از ایران کنون من به فرمان شاهبدین مرز آن برکشیدم سپاه
که آیی به فرمانبری شاه رابوی خاکبوس آن کیی گاه را
نخست از تو خواهیم پرداختنپس آن گه به فغفور چین تاختن
بدین نامه سر تا به سر پند تستبه کار آری ار بخت پیوند تست
چو خواندی ز پیش آی پرداختههمه راه نزل و علف ساخته
سزا باژ بپذیر و هدیه بسازو گرنه به جنگ آر لشکر فراز
گه رزم پیروزی او را سزاستکه بر دین کند رزم بر راه راست
چو پردخته شد نامه را مهر کردفرستاد گردی شتابان چو گرد
فرستاده چون پیش شه شد زمینبه رخسارگان رفت و کرد آفرین
به اسپ سخن داد پیش‌اش لگامبر آهخت تیغ پیام از نیام
به میدان دانش سواری گرفتچو بشنید شه بردباری گرفت
بدو گفت شاه تو از تخم کیستبه‌ نزدیک او رسم ضحاک چیست
چه ورزد از آیین دین کم و بیشچه گوید ز یزدان و از راه کیش
چنین داد پاسخ که شه را نخستخرد باید و رای و راه درست
کف راد و داد و نژاد و گهرنکوکاری و راستگویی و فر
فریدون شه را بدینسان هزارهنر هست و هم یاری از روزگار
فزون‌ زان به‌ کوه اندرون‌ نیست سنگکه در گنج او گوهرست رنگ‌رنگ
رهش دین یزدان کیومرثینژاد و بزرگیش طهمورثی
به دل کیش ضحاک را دشمنستبه‌نزدش چه اوی و چه اهریمنست
بد و نیک از ایزد شناسد درستیکی داندش هم به دین درست
جهان گوید ایزد پدید آوریدهمو بازگرداندش ناپدید
به پل چینود که چون تیغ تیزگذارست و هم نامه و رستخیز
بپرسد خدای از همه خوب و زشتبدان راست دوزخ بهان را بهشت
برش پارسا مرد نامی ترستهم از زر دانش گرامی ترست
چنانست دادش که روباه پیربرد بچه را تا دهد شیر شیر
چو بشنید خاقان پسندید و گفتگراین هست شاه ترا نیست جفت
ولیکن چو پرسیدم از تو بسیبمان تا بپرسم ز دیگر کسی
اگر چند فرزند چون دیو زشتبود نزد مادر چو حور بهشت
هنر آن پسندیده‌تر دان و بیشکه دشمن پسندد به ناکام خویش
نباید که شاهان پژوهش کنندمرا همچو غمران نکوهش کنند
برآسای یک هفته تا روی کارببینیم و پاسخ کنیم آشکار
بفرمود کاخی سزاوار اویبسازند درخور همه کار اوی
برادر بد آن شاه را سروریخنیده به مردی به هر کشوری
پدرشان ز گیتی چو بربست رختشدند این دو جوینده تاج و تخت
زمانی نشدشان دل از جنگ سیرسرانجام خاقان یغر گشت چیر
برادرش کشته شد از پیش اویپسر ماند از او سرکشی کینه‌جوی
دلیری که نامش تکین‌تاش بودهمه ساله با عم به پرخاش بود
نهان هر گهی تاختن ساختیبه تاراج بومش برانداختی
زمانی ز کین پدر توختننیاسودی از غارت و سوختن
یکی بهره بگرفته بد کشورششکسته بسی گونه‌گون لشکرش
همین هفته کآمد سپهبد فرازهمی خواست آمد سوی جنگ باز
در اندیشه خاقان گرفتار بودکش از هر دو سو رزم‌ و پیکار بود
به هم با مهان انجمن کرد و گفتکه گردون ندانم چه دارد نهفت
از این پهلوان وز برادر پسرندانم چه آورد خواهم به سر
ز دو رویه دشمن ندانم برستنه پیداست کاختر کرا یاورست
چنانم که سرگشته‌ای روز تنگرهش پیش غرقاب وز پس نهنگ
کنون چاره جویید تا چون کنیمکه این خار از پای بیرون کنیم
ره آموز و روزه ده و چاره گربوند این سه سر بی پدر را پدر
بسی رای زد هر کس از روی کارسرانجام گفتند کای شهریار
چو آتش نمایدت از دور دوداز آن به که سوزدت نزدیک زود
شهان و بزرگان روی زمینچه فرخ پدرت و چه فغفور چین
همه باژ ضحاک را داده‌اندز کامش برون گام ننهاده‌اند
فریدون از او به به‌ فرنگ و فرهمیدون به داد و نژاد و گهر
گر او را تو فرمان بری ننگ نیستترا با سپهدار او جنگ نیست
هر آن ریش کز مرهم آید به راهتو داغش کنی پیش گردد تباه
همه کاخ و ایوان به بزم و به خوانبیارای و این پهلوان را بخوان
بر او بر شمر هدیه چندان ز گنجکس آسان شود هر چه دیدست رنج
پس آن گه بدو از برادر پسربخوان نامه های گله سر به سر
که او خود ز دشمن کشد کین تونهد بر سپهر برین زین تو
به‌ دست کسان چون توان گشت شیرنباید ترا پیش او شد دلیر
پسندید خاقان و پیش گوانبفرمود پاسخ سوی پهلوان
پس از نام و یاد جهان آفرینز دل بر سپهبد گرفت آفرین
دگر گفت کز باژ و هدیه ز گنجدهم هر چه گویی ندارم به رنج
سزد شاه ایران اگر سر کشستکه او را چو گرد لشکر کشست
اگر خواهد از من شه نام جویفرستم سرم بر طبق پیش اوی
بدین باژ دو دیده گوهر کنمز تن پوستم بدره زر کنم
ولی آرزو دارم از تو یکیکه آری به کاخم درنگ اندکی
بوی شاد یک هفته مهمان منبیارای این میهن و مان من
به جای فریدون اگر دانی امگز این آرزو شاد گردانی ام
فرستاده را باره خویش دادوز اندازه دیبا و زر بیش داد
کسی کردش و شد فرسته چو بادپیام آنچه بد گفت و نامه بداد
سپهدار از آن گفتها گشت رامکه پیغام بد با نوید و خرام
سوی شاه با لشکر آغاز کردوز آن روی خاقان بشد ساز کرد
هزار اسپ از فسیله گزیددوره ده هزار از بره سربرید
ز گاوان فربه همی چهل هزارز نخچیر و مرغ تن فزون از شمار
دو ره صد هزار دگر گوسفندهمه کشت و بر دشت و صحرا فکند
پذیره به پیش سپهدار شدچو یکجای دیدارشان باز شد 
به بر یکدگر را هم از پشت زینگرفتند این شاد از آن آن از این
به یکجای بودند هوش هر دوانهمه راه هم پرسش و هم عنان
سپهدار با هر که بود از سپاهنشستند بر خوان هم از گرد راه
ز هر خوردنی ساز چندان گروهیکی دشت بد گردش اندر دو کوه
پر از گور و نخچیر کوهش همهبه دشت اندر از گور و آهو رمه
به هر گام جامی پر از لعل میطبق‌های نقل و درم زیرپی
رده در رده کاسه و خوان و جامفروزان به مجمر دورن عود خام
به زیر از طوایف نهفته زمینز بر کله در کله دیبای چین
سپاهی ز شهد و شکر ساختههمه نیزه در دست و تیغ آخته
گروهی به پیکار رفته فرازگروهی به نخچیر با یوز و باز
ز حلوا به هر صیفی میوه‌دارهمه برکشان شکر و قند بار
طبق‌ها و جام از کران تا کرانبه مشک و می اندوده و زعفران
سپهریست هر جام گفتی مگرمهش انگبین و ستاره شکر
کمربسته در پیش خوبان پرستهمه باده و باد بیزان به دست
چنان روشن از می بلورین ایاغکز او کور دیده به‌شب بی‌چراغ
دم نای هر جای و چنگ و ربابپراکنده مستان بر آتش کباب
گرفته خورش‌ها همه کوه و دشتکشان پیشکار آب و دستار و طشت
به بوی خورش‌ها ددان تاختهزبر در هوا مرغ صف ساخته
نسشته به خوان یکسر ایرانیانهمه چینیان پیش بسته میان
شب و روز خاقان پرستش نمایکمربسته پیش سپهبد به پای
جدا خوانش هر روز دادی بلاشیکی ابر بد ویژه دینار پاش
سر هفته آمد نوندی فرازکه آورد لشکر تکین‌تاش باز
ز ناگه خروشی برآمد به ابرشد آن بزم بر سان کام هژبر
سپهبد به‌ خاقان یغر گفت چیستچه‌ لشکر رسید و تکین‌تاش کیست
بگسترد خاقان سخن سر به‌ سرگله هر چه بدش از برادر پسر
سپهدار گفت اینست غمری دلیرکز اینسان از سر خویش سیر
من اینجا و او رزمکوش آمدستهمانا که خونش به جوش آمدست
یکست ابلهان را شتاب و شکیبسواران بد را چه بالا چه شیب
ترا دل بدین غم نباید سپردکه تنها بس او را نریمان گرد
گرش صدهزاراند گردان جنگهمه درگه جنگ و کین تیز چنگ
ببینی که چون گویم ای شیر هینکه خونشان ستاند به شمشیر کین
چنان کن که شبگیر با یوز و بازخرامیم مر جنگ را پیشباز
می و بزم کاینجاست آنجا بریمنریمان زند تیغ و ما می‌خوریم
من از ویژه‌گردان گزینم هزارتو بگزین هم از لشکر اندک سوار
بدان تا چو اندک نماید سپاهدلیری کند دشمن آید به راه
مگر ناگهش سر به دام آورموز این کار فرجام نام آوردم
چو پر حواصل برآورد زاغبرافروخت ز ایوان نیلی چراغ
همان نامزد کرد اندک سپاهببردند و راندند یک هفته راه
به‌ بزم و به‌ نخچیر بر کوه و دشتچنین تا به دژی دیدار گشت
بر آن تیغ دژ از بر کوهسارتکین‌تاش با جنگیان ده‌هزار
بگفتند از ایران دلیری سترگرسیدست نو با سپاهی بزرگ
ز خاقان یغر جنگ تو خواستستوز ایران نبرد ترا خاستست
ز تیغ دژ آمد به پایین کوهبزد صف کین با سپه همگروه
نیامدش باک از دلیری که بودچو گرد سپه دید بشتافت زود
سپهدار چون هفته‌ای سور کرداز آن پس شد آهنگ فغفور کرد
همه راه خاقان بپرداختهبه هر جای نزل و علف ساخته 
سه منزل بدش با سپه رهنمای همی ورا کرد بدرود و شد بازجای 
شد شتابان سپهدار گونریمان و زاول گره پیشرو
به مرز بیابانی آمد فراز زمینش که گفتی جهانیست گسترده باز 
همه داغ پای پریزمانه گم اندر وی از رهبری
نه گردون سپرده درازای اونه خورشید پیموده پهنای او
به هر سوش دیوی دژ آگاه بود به هر گوشه صد غول گمراه بود 
همان تار پرنده هزمان ز گرد چو تیر آمدی در نشستی به مرد
بکشتند از آن غول بسیار و مار به ده روز کردند از آنجا گذار 
رسیدند جایی چراگاه گوردرو شیرگون چشمه آب شور
چو نخچیر از تشنگی در گذاربه نزدیک ان چشمه رفتی فراز 
شدی نرم نرم آب آن چشمه زیر پس آشفته گشتی چو غرنده شیر 
بجستی و نخچیر را بی‌درنگهمان گه بیوباشتی چون نهنگ 
پس از یک زمان استخوانهاش پاکبدی گرد آن چشمه بر تیره خاک 
نه بشناخت آن آب را کس ز شیر نه دانست کز چیست نخچیرگیر
دگر سنگ دیدند کوچک بسیکه چون زآن دو بر هم بسودی کسی 
همان گاه بادی شگرف آمدیپس از باد باران و برف آمدی 
ولیکن چو زآن جا به بومی دگر ببردی نبودی ورا آن هنر
دگر سنگ بد نیز کز بیم نمچو ابر آمدی برزندی به هم
سبک زآن هوا ابر بگریختینه روز برف و ژاله نه نم ریختی 
ز مرز بیابان چو برتر کشیدسپه را سوی شهر ساجر کشید 
بزد خیمه با لشکر از گرد شهربرون شد که گیرد ز نخچیر بهر 
در و دشت و که دید زاندازه بیش رم گور و آهو و غژغا و میش 
همان روز بفکند بسیار گوربه‌ خون‌ غرقه هر سو همی‌ تاخت بور 
درختی بر چشمه‌ساری بدید عنان ره انجام از آن سو کشید 
چو نزدیک‌ شد‌ خاست‌ یک بانگ‌ سخت زنی دید ناگه که جست از درخت 
یکی شیرخواره گرفته به برهمی تاخت ز آهو به تک تیزتر
بپرسید کاین زن براینگونه چیست یکی گفت کاین هم چو ما آدمیست
درین بیشها گرد این دشت و کوه بدینسان بی‌اندازه بینی گروه 
چو آهو به تک همچو مردم به روی چو دیوان به‌ ناخن چو میشان به‌ موی 
ز بن هیچ با ما نگرند رامبمیرند زود آنچه گیری به دام 
از ایشان چو بیمار گردد یکیبرندش براین تیغ کوه اندکی 
به شیونگری گردش اندر خروش برآرند و زی ابر دارند گوش 
گرش ابر تیره ز دیده به اشکبشوید درستی گرد بی‌ پزشک 
وگر هیچ باران نبارد ز میغبمیرد به زیر افکنندش ز تیغ
نریمان یکی از درختی ربودبر پهلوان برد و او را نمود
به ره در همه بازویش خسته کردهمی بود تا مرد و چیزی نخورد 
ز نخچیر چون شد سپهدار باز بیآمد کس شاه ساجر فراز
فرستاده با هدیه بسیار چیزبه پوزش پیامی نکو داده نیز
که دانم کز ایران به کین آمدیبه پیکار فغفور چین آمدی
من او را یکی بنده کهترمنگهبان یک مرز ازین کشورم 
سه ماهه ز ما تا بدو هست راه نخستین ازو هر چه باید بخواه
هرآن گه کز او کام تو گشت راست همه بندگانیم و فرمان تراست
به هر شهر ازین مرز دیگر بپوی ز هر شاه باژی که باید بجوی 
سپهبد سخنهاش بر جای دیدپسندید و آن کرد کاو رای دید 
ز زاول گره هر که بودند گردهمان گه به فرخ نریمان سپرد 
به هر شهر فرمود تا با سپاهبگردد ز شاهان بود باژخواه
بدو گفت پیش از شدن هوش دار نگر تا چه گویم به دل گوش دار
جوان را اگر چه سخن سودمندز پیران نکوتر پذیرند پند
تو لشکر نبردی دگر زی نبردندیدی ز گیتی بسی گرم و سرد 
نهاد سپه بردن و تاختنبیآموز با صف کین ساختن
چو خواهی سپه را سوی رزم بردمکن پیشرو جز دلیران گرد
 سپه پیش دار و بنه باز پسز گرد بنه گرد بسیار کس
چنان تاختن بر که اسپان ز کارنباشند سست ار بود کارزار
به دشواری اندر مرو با سپاهنه بی‌رهنمونان به نادیده راه
همان دیده‌بان دار بر تیغ کوهبه هامون طلایه گروها گروه
چو پیدا شود کینه خواهی بزرگ که باشد قوی با سپاهی بزرگ 
به هر گوشه کارآگهان برگمارنهانش همی جوی با آشکار
ز نخچیر و از می به پرهیز باش به‌شب دیر خسب و به‌گه خیز باش 
چو لشکرگه آید برابر فرازشبیخون نگه دار و لشکر بساز 
بگرد سپه سربه‌سر کنده کنطلایه ز هر سو پراکنده کن 
هم از کنده و چاه پوشیده سربپرهیز و آسان شبیخون مبر
به نوبت ز جاندار وز پاسبانکسان دار هم گرد و هم مهربان 
سپه پاک با ترگ و خفتان کین شب و روز میدار و اسپان به زین 
به گه که آراست خواهی مصاف منی بفکن از سر گه نام و لاف 
بداد و دهش دل بیارای و رایپذیرش کن از نیکوی با خدای 
به دشت گل و خار و کند آب و چاه مکن رزم کافتد به سختی سپاه
همیدون میآرای از آن سو نبردکه در دیده باد آورد خاک و گرد 
وز آن روی کز تیغ کوه آفتابدو چشم ترا تیره دارد ز تاب
به جایی گزین رزمگاه استواربه آب و علف راه نزدیک وخوار 
ز پس دار در استواری بنهبرش لشکری رزم را یک تنه
پیاده به پیش ار صف ساختهسپر در سپر تیغ و خشت آخته 
پس از هر سپر هم پی بدگمانخدنگ افکنی در کمین با کمان
چنان کن که هرنیزه وز روز جنگ سپردار باشد کمانی به چنگ
به نیزه درون ره چنان ساختهکزو ناوکی گردد انداخته
به هر ده دلاور یک آتش فکن نهاده به پیکار و کین جان و تن 
سوارانشان در قفا صف زدهپس پشتشان زنده پیلان رده
صفی ‌راست بر راه و صفی‌ به‌ خم صفی چارسو درکشیده به هم 
پیاده چو دیوار بر جای پیش سواران درآمد شد از جای خویش 
گروهی به کوشش میان بسته تنگ گروهی در آسایش از بهر جنگ 
پس پشت لشکر سری با سپاهکمین را ز هر گوشه بربسته راه 
گشاده ره پیل تا در شکستاز ایشان نگردد سپه پای خوست 
پر انبوه صندوق پیل نبردز چرخی و از آتش انداز مرد 
سران را سزا جای دیدار کن درفش از چپ و راست بسیار کن 
فراوان ز گردان گردنفرازز بهر پسین حمله را دار باز
نخستین به از دشمنت دار گوش پس آن‌گاه بر زخم دشمن بکوش 
گردون روان قلعه‌ها کن بلندبر آنسان کز آتش نیاید گزند
همه برج آن قلعه بالا و زیرپر از گونه‌گون رزم ساز دلیر 
ز هر یک چنان ساخته بانگ تیز کزاو پیل و اسپ اوفتد در گریز 
چنان ساز قلبت که از چپ و راست رسد زود یاور چو فریاد خاست 
ممان کارد از قلب کس پیش پای مگر قلب دشمن بجنبد ز جای
چو داری پیاده سپه یکسرهبود جای پیکار کوه و دره
سوی رزم باید شدن همگروهگرفتن سر تیغ و پایان کوه
وگر دشت ساده بود رزمگاهبه هم حلقه باید که بندد سپاه
وگر خیل دشمن پیاده بودصف رزم بر دشت ساده بود
سوارانت را بر یکی جا بدارکه تا مانده گردند ایشان ز کار
چو بر جنگ پیلانت باشد شتاببه هامون برافکن پراکنده آب 
که تا پیل گردد هراسیده دلنیارد نهان پی از بوی گل
چو آید گه حمله کت بسپردرهش باز ده زود تا بگذرد
به پیکان الماس چشمش بدوزدگر تخت و صندوقش ازبر بسوز 
همه تیر بر پای و ناخن زنشمراو را فکن گرز بر گردنش
وگر خیل بدخواه از آن تو بیش توجایی گزین تنگ بر گرد خویش 
مجوی از دو سو رزم کآید گزند ز یک روی بگشای و دیگر ببند 
بسازی دگر جوی هر روز کین کمین نه نهان و همی بین کمین 
سپاه ترا دل ده اندر نبردهمی گرد هر جای با دار و برد 
کسی گر به پیکار نام آوردسر جنگجویی به دام آورد
مراو را به نیکی و خلعت رسانکه تا زور گیرند دیگر کسان
به جنگ آنکه سست آید از آزمون ورا نام بفکن ز دیوان برون
ز دشمن چو بینی سواری دلیر میان دو صف بر یلان تو چیر 
سواران جنگی بر او بر گمارستوه آورش هر سوی از کارزار
ز بدخواه در آشتی ساختنبترس از شبیخون و از تاختن
نگه کن کمینش به گاه ستیزهم از بازگشتنش گاه گریز 
از او تا نپردازی اندر شکست سپه را مده سوی تاراج دست
چوبینی که دشمن زپس رخت‌ و ساز همی اندک اندک فرستند باز
گر از درد باشند بیمار و سست گر از خستگی‌ها به تن نادرست 
وگر کم بود کس که جنگی بودوگر از علف راه تنگی بود 
ور از رزمگه کاهل آیند پیشحمله‌هاشان نه بر جای خویش 
بدین وقت‌ها رای آویختنفزون کن که خواهند بگریختن
چو زنهار خواهند زنهار ده که زنهار دادن به پیکار به
چنانشان مگردان ز بیچارگی که جان را بکوشند یکبارگی 
ز بن بر گریزندگان ره مگیر مریز از کسی خون که باشد گزیر 
چو تنوان گرفتن گریبان جنگ سوی دامن آشتی یاز چنگ
به هر کار در زور کردن مشور که چاره بسی جای بهتر ز زور 
چو ثابت نباشد به جنگ و ستیز از آن به نباشد که گیری گریز 
به جنگ ارچه رفتن زه بهروزیست گریز به هنگام پیروزیست
چو گویند کز جنگ برگاشت پشت از آن به که گویند دشمنش کشت 
بدم گریزندگان شب مپوی چو دشمن شد آواره بیشش مجوی 
وگر کار کوشش بباشد دراز نگردد همی دشمن از جنگ باز 
ممان کز علف هیچ یابند بهرنهان آبخورشان بیاکن به زهر 
فکن تخم بد در چراگاهشانخسک ریز و چه ساز در راهشان 
همه یاد دار آنچت آموختمکه من کین بدین چاره‌ها توختم 
بدو پاک بسپرد زاول سپاهنریمان به شبگیر برداشت راه
چو شد هفته‌ای شهری آمدش پیش کهی نزدش از مه بلندیش بیش 
همه که دل خاره سنگین ز آببسان گیا رسته زو زر ناب
از آن شهریان هر که زآن زر برد جز اندک نبردند از آن زر خرد 
چو بسیار بردندی اندر زمانبمردندی و جمله دودمان 
همه شهر درویش بودند سختگیا بودشان پوشش و فرش و رخت 
ندید اندر ایشان ازین سود و رفت برآمد به کوهی شتابنده تفت 
بدو گفت رهبر که گر زین سپاهکند بانگ یک تن درین تنگ راه
ز باران چنان سیل از افراز و شیب بخیزد که از عمق باشد نهیب
همیدون چنین گفت است کوهی دگر که آهن چو ساییش بر سنگ بر 
همه این جهان پر ز باران شود هوا دیده سوکواران شود
کسی کاو بدآن کوه پوید سوار گرد در نمد نعل اسپ استوار 
وگرنه ز باران یکی سیل سختبخیزد که از بن برآرد درخت
بر آنسوی که تنگ کوهیست نیز دو میل اندرو رستنی نیست چیز 
در آن تنگ هر کس که دارد خروش گرد سنگباران ز هر جای جوش 
چنین گوید آن کاو ز دانا گروه که دیوان همی افکنندش ز کوه 
سپهدار خاموش ازو برگذشتدگر پیشش آمد یکی پهن دشت
درو چشمه آب چون خون به رنگ بر چشمه کرده گوزنی ز سنگ 
در آن بوم و بر هر گوزنی که درد برو چیره گشتی، بماندی ز خورد 
دوان تاختی پیش او چون نوندتن خویش سودی در او بار چند 
چو روزش بدی مانده گشتی درست چو مرگی بدی گشتی افتاده سست 
دگر دید شهری نو آیین به راهکهی نزد او سرش بر اوج ماه 
همه سینه کوه بید و خدنگیکی بیشه گردش زریر و زرنگ 
سر تیغ آن که همه خاک بودگیاه و گلش پاک تریاک بود 
کسی کآن گیا با می خوشگوار بخوردی نکردی برو زهر کار 
شهش داشت آن را نگهبان بسینماندی که بی هدیه بردی کسی
چو بشنید کآمد نریمان گردشد و هدیه بیکران پیش برد
ز تریاک و از گونه‌ گونه گهر ز زربفت چینی و از سیم و زر 
سپهبد به جاهش بسی برفزودفرو آمد آنجا و یک هفته بود
بدان شهر گلزار بسیار بود یکی چشمه به میان گلزار بود 
به پهنا فزون از دو میدان زمینهمه آب آن چشمه چون انگبین
چو خورشید گیتی بیاراستی یکی بانگ ازآن چشمه برخاستی 
همه سنگش از زیر هم در شتاب دویدی ستادی برافراز آب
چوکردی نهان خور فروغ از جهان همان سنگ‌ها بازگشتی نهان
از آن چند برد از پی آزمونسپه راند یک هفته دیگر فزون 
یکی بیشه و خوش چراگاه بودهمه بیشه پرنده روباه بود 
چو مرغان به پرواز در هر کنار چه‌بر شخ و هامون چه‌بر کوهسار 
به هر درد پرش بدی سود و بال ولیکن بدی شوم بانگش به فال
بی‌اندازه زان روبهان سر بریدوز آن جا بشد نزد شهری رسید 
بدان شهر بد ژرف چاهی مغاک درو چشمه آب چون سیم پاک 
چو چشمه در هر که یک تنگ بار درافکندی از یک رطل تا هزار
کوه آبش از موج بفراختیز پس باز بر خشکی انداختی 
به خون و به دزدی چو آن مردمان شدندی به دل بر کسی بدگمان
ببستی شه او را سبک دست و پای در آن چشمه انداختی هم به جای 
شدی گر گنهکار بودی تباهفتادی برون گر بدی بی‌گناه
دگر دید دشتی همه کند منددر آن دشت سهمن درختی بلند
تنش سبز و شاخش همه چون زریر به زیرش یکی چشمه آبی چو قیر 
چو پیچان رسن برگ‌های درازفروهشته زو تا به هامون فراز
زنخچیر هرچ اندر آن دشت و کوه به بیماری اندر بماندی ستوه
ویدی بشستی در آن چشمه تن ز پیش درخت آمدی چون شمن 
خروشان پرستیدن آراستینشستی گهی گاه برخاستی
درست ار شدی در زمان باز جای و گر نه بمردی فتادی به جای
ز نخچیر کز گرد او مرده بوددو پرتاب ره چرم گسترده بود 
نه بر بیخ و شاخش نه بر برگ و بارنکردی ز بن آتش تیزکار
همه دشت با شیر و گرگ و پلنگبد از گرد او غرم و آهوی و رنگ
نه با آهوان یوز را بد ستیزنه از شیر مرغوم را بد گریز
به شهری دگر نزد رودی رسید به هر سوش مردم پراکنده دید
میان غلیژن زبر وز فرودهمه پشم جستند از آن ژرف رود 
کز آن هر که دارد چو زابر بلند برو آتش افتد نباید گزند
همه بنده‌وار آمدندش ز پیشببردند از آن پشم از اندازه بیش 
همان جایگه دید مردی دورنگسپید و سیه تنش همچون پلنگ
سه چشمش یکی بر فراز و دو زیر به‌ دندان چو خوکان به‌ ناخن چو شیر 
ز گردش رده مردمان بی‌شمار بسی کژدم زنده از پیش و مار 
همی خورد از آن کش گزندی نبود وزآن هر چه او را بزد مرد زود 
سبک زآن پلنگینه دیو نژندبه خنجر سر و دست بیرون فکند 
به جای دگر دید دو بیشه تنگازاین‌ سو طبر‌خون و زآن سوخدنگ 
بر هر دو بیشه یکی برز کوهبرآن کوه کپی فراوان گروه 
به گردش بسی چشمه نفت و قیر فرازش چو دریا یکی آبگیر
به دشت اندرون شهری آراستهچو گنجی پراکنده از خواسته
همه مردمش را فزون از شماراز آن کپیان برده و پیشکار
ز زیور همه غرق در سیم و زر بسا کی ز گل برنهاده به سر
به بازار چون بنده فرزند نیزدر آن شهر بفروختندی به چیز
هم اندر زمان کس بر شاه کردز کاری که بایستش آگاه کرد
نبد شاه را ز اختر نیک بهر به پیکارش آورد لشکر ز شهر 
نریمان بیاورد لشکر به جنگزمانه بدان پادشا کرد تنگ
به کم یک زمان زان سپاه بزرگ بد افکنده بسیار گرد سترگ
گرفتندش و لشکر آواره گشتهمه شهر با خاک همواره گشت 
ز تاراج آن شهر وز گنج شاهتوانگر ببودند یکسر سپاه
بدین سان دو ماه اندر آن مرز شاد همی گشت و بسیار درها گشاد 
بسی شهر و بتخانه تاراج کردبسی شاه را بی‌سر و تاج کرد
بسی مرد گردافکن پهلوانکه از گرز بشکستشان پهلوان
و زآن سو همان روز کاو رفته بود سپهبد نبیسنده را گفت زود
یکی نامه آکنده از خشم و کینبیارای نزدیک فغفور چین
بگو باژ و ساو آنچه باید بساز چو خاقان یغر پیش آی باز 
وگرنه به پای اندر آرم سرتنهم بر سر از موج خون افسرت 
چو گریان بتی گشت کلک دبیرز سیمش تن و سر ز مشک و عبیر 
به نوشین دو لب بر زد از مشک دمز پر سرمه دیده ببارید نم
سرشکش همه گوهر و قیر شدگهر دانش و قیر زنجیر شد
تو گفتی که تند اژدهایی ز زرکه بر گنج دانش نهادست سر
از آن گنج یاقوت و در خردهمی از بر سیم برگسترد
از آغاز چون کلک در قار زد رقم بر سرش نام دادار زد
خداوند دانای پروردگارز دیده نهان وز خرد آشکار
جهان چون یکی پادشاهیست راست بر این پادشاهی مر او پادشاست 
زمین هست گنجش همیشه به جای زرش رستنی چرخ گردان سرای 
هوا و آتش و آب فرمانبرانشب و روز یک و سپاه اختران 
بر هر یکی دانشش را رهستوز ایشان هر آنچ آید او آگهست 
دگر گفت کاین نامه نغز گویز گرشاسب زاول شه نامجوی
به نزدیک فغفور فرخ نژادکه‌ ماچین ‌وچین سربه‌سر زوست ‌شاد 
بدان ای ز شاهان توران زمیندلت کرده بر اسپ فرهنگ زین 
که تخت شهی دیگر آیین گرفتزمانه ره فره دین گرفت
فریدون فرخ به گرز نبردز ضحاک تازی برآورد گرد
ببردش به کوه دماوند بست به جایش به تخت شهی برنشست 
بیاراست از داد و خوبی جهان به فرمانش گشتند یکسر شهان
فرستاد مر کاوه را رزمکاوبه خاورزمین از پی باژ و ساو 
وزین سو مرا گفت برکش سپاه به فغفور شو باژ و ساوش بخواه 
شنیدی که در کاول و مرز سندچه‌ کردم چه‌ در خاور و روم و هند 
چه باشیر و پیل و چه بادیو و گرگ چه با اژدها رفته در کام مرگ
چه کس را نبد تاب من روز کین ترا هم نباشد به دانش ببین
مکن آنچه زو رنج کشور بود پس از جنگ فرجام کیفر بود
بمالدت دست زمان گوش بختچو از ما رسد مالشی برتو سخت 
به فرمان شاه آی با باژ پیشچنان کن که خاقان وز آن نیز بیش 
پیام آنچه گفتن ز بر تا فرودچو فرمان بری باد بر تو درورد 
به کوره خرد در دبیر کهنهمی کرد پالوده سیم سخن 
خطش گفتی و خامه در بارکه از مشک مورست و از رز مار 
همه دانه مور از او گهرهمه زهر مارش عبیر و شکر
چو قرطاس پوشید مشکین زره بزد بر کمربند زرین گره
سپهبد زبان آوری نغز گویبرون کرد و بسپرد نامه بروی 
نشست شه چین به جندان بدی که شهری نبودی که چندان بودی 
هزاران هزار از یلان سپاهبه درگاه برداشت بی‌گاه و گاه 
وز آن جز که دستور و سالار بار ندیدی به سالی ورا یک دو بار
بد آراسته شهرش از گونه‌گونز شش میل ره گردش اندر فزون 
همه خانها برهم افراشتهبه صد رنگ هر خانه بنگاشته
سپاهی و شهریش با دسترسنبود اندر آن شهر درویش کش
چو ششماهه ره بوم توران زمینبه شاهی ورا بود زیر نگین
سرایی بدش سر کشیده به ماهدرازا و پهنا دو فرسنگ راه
ز خاراش دیوار و بوم از رخامدر او کوشکی یکسر از سیم خام
هر ایوان در آن کوشک از لازوردزبر جزع و بومش همه زر زرد
ز یاقوت و از گوهر آبدارهر ایوان پر از صد هزاران نگار
کشیده میان سرای از فرازمنقش یکی پرنیان پهن باز
چو بر وی فکندی فروغ آفتابز گوهر گرفتی جهان رنگ و تاب
در ایوانش از زر تختی که شاهنشستی بر آن شاد در پیشگاه
یکی گرزن از گوهر آمیختهز بالای تختش درآویخته
بر افراز گرزن ز یاقوت و زریکی نغز طاووس بگشاده پر
زمان تا زمان بانگ برداشتیز بالای شه بال بفراشتی
به تاجش بر از کام در خوشابفشاندی و از دم بر او مشک ناب
چو از ره فرستاده سرفرازبیامد بر شاه توران فراز
ز دروازه تا درگه شه دو میلدو رویه سپه دید و بالا و پیل
کشیده به درگاه گرگ و نهنگبه زنجیرها بسته شیر و پلنگ
ز دهلیز تا پرده شهریارفروزنده شمع از دو رو صد هزار
فرستاده چون چهره شه بدیدزمین بوسه داد آفرین گسترید
یکی کارگه ساخت از هوش و مغزز دیبای دانش به گفتار نغز
ز جان پود کرد و ز فرهنگ تارز اندیشه رنگ و ز معنی نگار
همی بافت در یکدگر تار و پودبگفت آنچه بود از پیام و درود
ز پوزش چو پرداخت نامه بداددبیر آنچه بود اندرو کرد یاد
چنان گشت فغفور از آن نامه تندکه از حدتش گشت الماس کند
کمان دو ابرو به هم بر شکستبه تیغ زبان برد دشنام دست
بدو گفت شاهت گه نام و لافکه باشد که راند زبان بر گزاف
زمین نیست گرد سپاه مرانه خورشید یک بارگاه مرا
اگر گنج سازم بیابان خشککنم سنگ او گوهر و ریگ مشک
سوارن گردم هزاران هزارپراکنده را کس نداند شمار
زخویشان هزار و صدو شصت و پنجبه نزدم شهان اند با تاج و گنج
از ایشان دو صد راست زرینه کوسکه دارند بر چرخ گردان فسوس
چو خواهد جهان خور به زرآب شستز گیتی بر این بوم تابد نخست
در این شهر بتخانه دارم هزارکه هر یک به از گنج او شست بار
همه کشورم کان سیمست و زرکُهشن معدن لاژورد و گهر
درختش طبر خون و بیشه خدنگگیا سنبل و عود و بیجاده سنگ
پری چهرگانش بُت دلنوازددش یوز و مرغانش طوطیّ و باز
یلانش کمند افکن و گردگیرسوارانش دوزنده سندان به تیر
ز خاکش روان سیم خیزد چو آبفتد ز آهوش نافهٔ مشک ناب
برویدش زرّ چون گیا از زمینببارد ز میغش سرشک انگبین
طرایف همیدون ز گیتی فزونهم از خسروی دیبهٔ گونه گون
دگر جوشن و ترگ و درع گوانسپرهای مدهون و برگستوان
زما چین و چین تا به جیحون مراستبزرگی ز هر شاهی افزون مراست
به رزم اژدهای سرافشان من امبه بزم آفتاب درفشان من ام
خدایست کز من مه و برترستدگر هر که او مر مرا کهترست
پسر را فرستاده ام رزمسازکه از هر سویی لشکر آرد فراز
چو او در رسد ساز ایران کنمهمه بوم تا روم ویران کنم
فرستاده گر کشتن آیین بُدیسرت را کنون خاک بالین بدی
زبان یافت گوینده اندر سخنچنین گفت کای شاه تندی نکن
بسی راندی از گفت بی سود و خنجاگر پاسخ سرد یابی مرنج
مزن زشت بیغاره ز ایران زمینکه یک شهر او به ز ما چین و چین
به هر شه بر از بخت چیر آن بودکه او در جهان شاه ایران بود
به ایران شود باژ یکسر شهاننشد باژ او هیچ جای از جهان
از ایران جز آزاده هرگز نخاستخرید از شما بنده هر کس که خواست
ز ما پیشتان نیست بنده کسیو هست از شما بنده ما را بسی
وفا ناید از ترک هرگز پدیدوز ایرانیان جز وفا کس ندید
شما بت پرستید و خورشید و ماهدر ایران به یزدان شناسند راه
ز کان شبه وز کُه سیم و زرز پولاد و پیروزه و از گهر
هم از دیبه و جامهٔ گون گونبه ایران همه هست از ایدر فزون
سواران ما هم دلاورترندیکی با صد از چینیان همبرند
شما را ز مردانگی نیست کارمگر چون زنان بوی و رنگ و نگار
هنرتان به دیباست پیراستندگر نقش بام و در آراستن
فروهشتن تاب زلف درازخم جعد ر ا دادن از حلقه ساز
سراسر به طاووس مانید نرکه جز رنگ چیزی ندارد هنر
خرد باید از مرد و فرهنگ و سنگنه پوشیدن جامه و بوی و رنگ
اگر خور بر این بوم تابد نخستچه باشد نه تنها خور از بهر تست
وگر بر کران جهانی رواستزیان چیست کاندر میان شاه ماست
ز تن جای ناخن به یک سو برستدل اندر میانست کاو مهترست
ز پیرامن چشم خونست و پوستمیان اندرست آنکه بیننده اوست
تو گر چه بزرگی و با تاج و تختفریدون مِه از تو به فرهنگ و بخت
نشان بر فزونیّ گنج و سپاههمین بس که هست او ز تو باژ خواه
اگر شب دو صد ماه گیتی فروزنتابد همان چون در خشنده روز
هنر ها سراسر به گفتار نیستدو صد گفت چون نیم کردار نیست
نباید ترا شد به پیکار اوکه اینک خود آمد سپهدار او
اگر کوهی از کوهه در رزمگاهبه نیزه ربایدت چون باد کاه
چه نازی به چندین بت و بتکدهکه فردا بود پاک بر هم زده
دگر باره فغفور شد تیز خشمبرافراخت تاج و برافروخت چشم
بر اندش به خواری و زخم درشتبدرّید و بنداخت نامه ز مشت
دو ره صدهزار از یلان برشمردبه مهتر پسر داد خاقان گرد
پذیره فرستاد پرخاشجویپسر سوی پیکار بنهاد روی
فرستاده زی پهلوان شد ز پیشز فغفور گفت آنچه بُد کم و بیش
خبر داد دیگر که لشکر به جنگفرستاد و اینک رسیدند تنگ
سواران کین توز بی حدّ و مرفرستاد همراه با یک پسر
نریمان سپاه از ره آورد بودهمان گاه خواندش سپهدار زود
یل زاولی ده هزار از شمارگزین کرد وز ایرانیان شش هزار
بدو داد و کارش همه کرد راستبدو گفت کاین رزم دیگر تراست
نریمان یل رفت و لشکر کشیدبرابر چو نزدیک خاقان رسید
بزد خیمه و صد سوار از سرانگزین کرد کین جوی و کند آوران
به رسم طلایه برفت از سپاههمی کرد مر چینیان را نگاه
سواری هزار از دلیران چینطلایه بدند اندر آن دشت کین
به هم باز خوردند و رزمی بخاستکه گیتی به زیر و زبر گشت خواست
همه درع گردان شد از ریز خونچه بر چشمه نو حله لاله گون
نریمان میان بست مر جنگ راعنان داده مه نعل شبرنگ را
گرفت از دلیران یکی را کمربرآورد و زد بر سواری دگر
بکشت آن دو را و دگر ره به کیندو تن را گریبان گرفت از کمین
به هم بر سر و گردن هر دو گردهمی کوفت تا مغزشان کرد خرد
همی تاخت زینسان چو غرنده میغنه بایست گرزش نه خشت و نه تیغ
به چشم مه اندر همی گرد زدز زین مرد بربود و بر مرد زد
گریبان سی مرد زینسان به مشتگرفت و چهل تن بدان سی بکشت
بماندند بیچاره ترکان ز کارندیدیم گفتند از ینسان سوار
چو زینسان کشد مرد جنگی به مردچه آرد به شمشیر و گرز نبرد
یکی نیمه شد کشته بی تیغ تیزنهادند دیگر سراندر گریز
خبر یافت خاقان سبک بر نشستدژم شد چو دید از طلایه شکست
همه گیتی از خون در آغاز بوداگر کوه اگر دشت اگر غار بود
ندید از بنه رزم را رای و رویکه بنهفت شب روی گیتی به موی
نریمان ز سوی دگر باز گشتببودند تا تیره شب در گذشت
چو گشت آینه رنگ روی سپهردراو مهر رخشنده بنمود چهر
گرفتند هر دو سپه تاختنکمین کردن و صف کین ساختن
ز منجوق و از گونه گونه درفششد آذین زده روی چرخ بنفش
به ابر اندر از کوس فریاد خاستز هر سو چکاچاک پولاد خاست
همه آسمان گرد لشکر گرفتهمه دشت خنجیر و خنجر گرفت
ز خون عیبه ها لاله کردار شدسنان ارغوان تیغ گلنار شد
به هر گوشه بد گنبدی خاستههوا را به گلشن بیاراسته
همه گنبد از گرد گردنکشانگلشن قطره خنجر سر فشان
ز بس ترگ پاشیده هامون به چهردرفشان چو در شب ستاره سپهر
زده کله بر کشته کرکس در ابرطمع کرده روبه به مغز هژبر
ز که دیدبان دیده بگماشتهبه هامون یلان نعره برداشته
بدینگونه تا شب نیامد فرازنچیدند کس دامن رزم باز
چو آن آتشین گوی را تیره شبفرو خورد چو هندی بوالعجب
دو لشکر ز جنگ آرمیدند و جوشطلایه همی داشت هر گوشه گوش
تن خسته بستند و شستند پاکنهفتند مر کشته را زیر خاک
سته بود دشمن ز جنگ و ستیزگرفتند هم در دل شب گریز
نیارست بودن در آن دشت کسنشستند یک روزه ره باز پس
بر آن مرز شهری دلارام بودکه آن شهر را خامجو نام بود
در شهر لشکر بیاراستندز هر گوشه دیگر سپه خواستند
چو زد آتش از کوره سبز تابشد آن تازه گلهای گردون گلاب
طلایه رسانید زود آگهیکه از چینیان گشت گیتی تهی
ز چندان سپه نیست بر جای کسمگر خیمه ای چند بر پای و بس
خروش از دلیران ایران بخاستپس گردشان برگرفتند راست
به روز دگر ناگهان گرمگاهرسیدند در لشکر کینه خواه
طلایه نخستین به هم برزدندپس آن گه بر انبوه لشکر زدند
چنان سخت شد جنگ هر دو گروهکه در لرزه افتاد از آن دشت و کوه
جهان شد ز صندوق پیلان جنگپر از آتش انداز و تیر خدنگ
همی زهر زخم پرند آورانبرآمیخت با مغز کند آوران
شد از تف خنجر دل خاره مومز زهر سنان باد گیتی سموم
فروهشت دامن ز خورشید گردبلا بر نوشت آستین نبرد
در ایران بد آشوب و در روم جوشبه چین خاست گرد و به خاور خروش
چو دریای خون شد سپهر بریندرو کوه کشتی و لنگر زمین
تو گفتی شبست از سیاهی زمانسنان ها ستارست گرد آسمان
نریمان برون تاخت از صف سمندبه یکدست تیغ و به دیگر کمند
چو دیوی که گردد ز دوزخ رهابدین دستش آتش بدان اژدها
چپ و راست هامون نوشتن گرفتبه گرد هم آورد گشتن گرفت
سر تیغش از دل دم آشام شدکمندش بر اندامها دام شد
گهی کشت یک یک از اندازه بیشگهی خیل خیل اندر افکند پیش
ز کشته همه دشت پر پشته کردیلان را ز بس زخم سر گشته کرد
بدانست خاقان که یک یک به جنگندارند در رزم با او درنگ
دو صد تن گزید از دلیران چینبه یک سوی لشکر شد اندر کمین
سواری بفرمود تا جنگجویشدش پیش و بنداخت خشتی بروی
پس از وی گریزان سر اندر کشیدبیآمد چو نزد کمینگه رسید
همان گاه خاقان کمین بر گشادسپه زی نریمان به کین سرنهاد
ز گردش چو دیوار پولاد بستگرفتند و بروی گشادند دست
ببارید چندان برو گرز و تیغکه در سال باران نبارد ز میغ
نترسید و خنجر برآهخت گردبه خاقان نخست از همه حمله برد
تنش را به یک زخم ماند از کمینیکی نیمه بر زرین یکی بر زمین
از آن پس تن افکند بر دیگرانهمی زد به تیغ و به گرز گران
همه دشت از ایشان سرافکند و دستبه یک بار بر قلبشان بر شکست
دلیران ایران پس گرد چیرهمی حمله کردند غران چو شیر
سر کشته خاقان ز پیش سپاهببردند بر نیزه تا قلبگاه
به ترکان غریو اندر افتاد پاکفکندند یکسر تن از زین به خاک
کلاه و کمرها بینداختندخروشیدن و مویه بر ساختند
فکندند منجوق و کوس نبردگریزان برفتند پر خون و گرد
 دو بهره شده کشته و دستگیردگر خسته خنجر و گرز و تیر
در شهر بستند یک باره تنگز دروازه بردند بر باره جنگ
ز پیرامن شهر صف زد سپاهنهادند هر سو یکی رزمگاه
ببد باره پر دایره سر به سرز بس جوشن و گونه گون سپر
بپوشید باران سنگ آفتابز پیکان فرو ریخت پر عقاب
چنان نوک ناوک همی مغز دوختکه بر سر همی ترگ ازو برفروخت
ز پولاد بد پنجه ها بی شمارکمندی ز هر پنجه در استوار
کجا باره ز انبه بپرداختندخم پنجه در باره انداختند
به دو مرد جنگی به دیوار برهمی تاخت چون غنده بر تار بر
نریمان سپر زود بر سر گرفتبر در شد و گرز کین برگرفت
همی کوفت تا در همه پاره شدتن افکند در شهر و بر باره شد
بپرداخت دیوار از انبوه مردفرو زد به باره درفش نبرد
نهادند لشکر به تاراج سرهمه شهر کردند زیر و زبر
بکشتند چندان از آن جایگاهز کشته بد از بوم و بر بام راه
همه کاخ و بتخانه ها گشت پستشکسته بت و سرنگون بت پرست
به هر کس یکی گنج آراستهرسید از بت و گونه گون خواسته
چو بردند پاک آنچه بایسته بودزدند آتش اندر همه شهر زود
به هر کاخی اندر هوا باد تفتشراعی زد از دیبه زر بفت
جهان پاک از آتش چنان بر فروختکه زیر زمین گاو و ماهی بسوخت
بر آمد ز هامون به چرخ بنفشدفشنده هر سو درفشان درفش
چو باغی شد آن شهر پر نو سمنعقیقین درختان و سیمین چمن
به زیرش زر و پوش سوسن نشان زبر ابری از مشک بسد فشان
چو جوشنده دریایی از سندروسبخارش همه زیره آبنوس
تو گفتی زمین زر گدازد همیهوا زرد بیرم طرازد همی
چو از شهر جز خاک چیزی نماندنریمان دگر روز لشکر براند
به یک روزه ره بر فرو آرمیدببد تا جهان پهلوان در رسید
وز آن روی چون گشت خاقان تباهشد این آگهی نزد فغفور شاه
فکند افسر از سر به سوک پسربه زیر آمد از تخت بر خاک سر
همی خورد یک هفته بر سوک دردپس آن گه بر آراست کار نبرد
سپهبد بدش سرکشی یل فکنقلا نام آن گرد لشکر شکن
سواری که در چینش همتا نبودبه زور و دلش کوه و دریا نبود
بدادش صد و سی هزار از سرانتکینان لشکرش و نام آوران
به جرماس پور برادرش زودنوندی بر افکند چون باد و دود
که آمد سپهدار جنگی قلابه دریای کوشش نهنگ بلا
فرستادمش تا بود یاورتگه جنگ تنها بس او لشکرت
تو با او به پیکار ایرانیانببند از پی کین خاقان میان 
بدین رزم اگرت آید از بخت راستیکی نیمه از چین به شاهی تراست
قلا رفت و هم یار جرماس شدبه هم خشمشان زهر و الماس شد
دو ره صد هزار از سران سترگکشیدند در هم سپاهی بزرگ
به شهر کجا پیش رفتند بازخبر یافت گرشاسب ز آن رزم ساز
نریمان و زاول گره را به جنگفرستاد و کرد او همان جا درنگ
به مرز کجا نزد یک روزه راهرسیدند یک جای هر دو سپاه
برابر کشیدند صف نبردبر آمد ز جنگ آوران دار و برد
دل کوس کین تندر آواز شدسر تیغ با برق انباز شد
زمین را دل از تاختن گشت چاکبیاکند کام نهنگان به خاک
ز درع نبرد و ز گرد کمینزمین گشت گردون و گردون زمین
ز برگستوان دار پیلان مستهمه دشت بُد کوه پولاد بست
همی تیغ خندید بر خود و ترگبر آنسان که خندد بر امید مرگ
ز دریا به دریا شد از جنگ جوشز کشور به کشور رسیده خروش
ز زخم یلان تیغ کین سردروسپاه یلان را سنان پیشرو
سواران به گرداب خون اندرونگوان غرقه گه راست گه سرنگون
ز جنبش زمین پاک ریزان شدهچو مستان که افتان و خیزان شده
بمانده دل شیر گردون دو نیمچو روبه شده شیر هامون ز بیم
گرفته سوی چرخ جان ها گذارز خنجر دمان خون چو ز آتش بخار
سه روز اینچنین بود پیکار سختنگشت از دلیران یکی چیر بخت
چهارم چو شد کار پیکار دیرسر آمد سران را سر از جنگ سیر
نریمان زد اندر میان دو صفبه کف گرز و از خشم پاشنده کف
بر انگیخت تند ابرش زودرسهمی زد چپ و راست وز پیش و پس
به هم زخم برگاشت با اسپ مردبه هر حمله انباشت گردون به گرد
ز ترگ سواران و از مغز پیلهمی رفت آواز گرزش دو میل
زره پوش در صف شدی رزم کوش برون آمدی باز مصقول پوش
کفش چون کف میفشاران شدهچکان خون از او همچو باران شده
قلا دید در لشکر افتاده نوفاز آن زخم و آن حمله صف شکوف
بر افراخت از قلب یال یلیبرون زد چمان چرمه جزغلی
به دستش یکی برق کردار تیغچو الماس بارنده بیجاده میغ
خروشید کای مرد جنگی بایستکه از جنگ برگشتنت روی نیست
سرآمد جهانت به سیری ببین که روزت همین است روی زمین
چه نازی بدین اسپ و این خود و ترگکت این تخت خونست و آن تاج مرگ
نهنگی گهربار دارم به کفکه گیتی چو آتش بسوزد ز تف
دمش زهر تیزست و الماس چنگخورش خون و دریاش میدان جنگ
هم اکنون نگون زاسپ زیر آردتبه یک دم ز تن جان بیوباردت
نریمان بخندید و گفت از گزافچه شوری هنر باید اینجا نه لاف
نترسم من از کبک یافه درایکه اشتر نترسد ز بانگ درای 
هم اکنون ز مغز تو ای نیم تورکنم کرکسان را بدین دشت سور
ترا گر نهنگیست در جنگ چیراز آن به عقابیست با من دلیر
عقابی که تا او شدست آشکاربچه مرگ دارد روان ها شکار
هوا رزمگه کوهش این ابر شستدرختش کمان آشیان ترکشست
هم اکنون ز زینت آورد زیر گلبه چنگال مغزت به منقار دل
بگفت این و ابرش به خشم و ستیزبه گردش در انداخت چون چرخ تیز
دو خم کمان نون و زه دال کردخدنگش عقاب سبکبال کرد
به تیری که پیکان او بید برگفرو دوخت بر تارگ ترک ترگ
به خاک اندر از زین نگون شد قلاببارید بر جانش ابر بلا
بشد تا مگر نام گیرد به جنگبشد جانش و نام نآمد به چنگ
دل و پشت ترکان شکست از نهیبگریزان گرفتند بالا و شیب
پس اندر دلیران ایران به کینگشادند بر خیل ترکان کمین
فکندند چندان گروه ها گروهکه از کشته شد پشته هر سو چو کوه
گرفتار آمد ده و شش هزارسلیح و ستوران گذشت از شمار
همه دشت بد ریخته خواستهز کشته جهان گند بر خاسته
سوی بیشه جرماس تنها برفتهمی تاخت تند اسپ چون باد تفت
درختیش پیش آمد اندر گریزبرون داشته زو یکی شاخ تیز
بر افتاد حلقش بر آن شاخ سختبرفت اسپ و او کشته شد بر درخت
سپاهش نبود از وی آگاه کسکه هرکس غم خویش دانست بس
هر آن گه بیآمد زمانه فرازنگردد به مردی و اندیشه باز
کرا چشم دل خفت و بختش غنوداگر چشم سر باز دارد چه سود
نریمان چو پردخت از آن رزمگاهبه گرد کجا خیمه زد با سپاه
بد اندر کجا نامور مهترینگهبان آن مرز نیک اختری
چو بر چینیان دید کآمد شکنمهان هر چه بودند کرد انجمن
د‍ژم گفت هر کاو سر انجام کارنبیند بپیچاندش روزگار
سپاهی چنین رزم ساز ایدرستز پس بیست چندین دگر لشکرست
به خاقان و جرماس و جنگی قلانگر کاین سپهبد چه کرد از بلا
به هر شهر کش جنگ و پیکار بودشد آن شهر با خاک هموار زود
ستیز آوری کار اهریمن استستیزه به پرخاش آبستن است
همان به که زنهار خواهیم از اویبدان تا نباشد ز ما کینه جوی
چنین گفت هرکس که فغفور چیننباید که دارد دل از ما به کین
فغستان خاقان و گنج ایدرستبدان گر رهیم این سخن در خوراست
چو مهتر به هم رایشان دید راستسزای نریمان بسی هدیه خواست
شدش پیش با خیل مه زادگانتن خویش کرد از فرستادگان
پرستش کنان آفرین کرد و گفتکه بادت به مهر اختر نیک جفت
همی مهتر شهر گوید که منترا بنده ام واین بزرگ انجمن
شدست آن که فرزند شاه کجاستتو کشتی پدر او ندانم کجاست 
درستست دیگر به نزدت خبرکه فغفور شه راست این بوم و بر
ازو باز پرداز و از چین نخستپس آنگه تن و جان ما پیش تست
به پیمان که ایمن بود بت پرستبه بتخانه ها کس نیازند دست
سپهدار گفت ایستادم بر اینمرا با شما نیست پیکار و کین
نیارم فغستان خاقان به رنجسپارید هرچ ایدرش هست گنج
سوی شهر بسته مدارید راهکه تا هر چه خواهد بخرد سپاه
براین دست بگرفت و خطش بدادبیاراست آن شهر یکسر به داد
یکی گرد گرد سپه برفکندخروشید هر سو به بانگ بلند
که با شهر کس را به بد کار نیستچو باشد مکافاش جز دار نیست
همه گنج خاقان که بد در نهانبر آورد بیش از بهای جهان
به پشت هیونان بختی هزارهمی هفته ای رخت بردند و بار
پراکنده بتخانه گونه گونبدان شهر در بود سیصد فزون
همه چون بهشت نو آراستهبه گوهر در و بام پیراسته
گوی بد هنرمند نامش قباداز اهواز گردی فریدون نژاد
همی گشت با چاکران گرد شهرکه گیرد ز دیدار آن شهر بهر
به بازار بتخانه ای نغز دیدکه بود از بلندی سرش ناپدید
زمین جزع و دیوار ها لاژورددرش زر و بیحاده بر زر زرد
به دهلیز گه طاقش از آبنوسکه برجش همی ماه را داد بوس
همه خم طاق از گهر پرنگاردراو بسته قندیل زرین هزار
بر در ز مرمر دو دکان زدهبه هر یک بر از بت پرستان رده
به مجمر فروزان همه مشک نابشده دود چون میغ بر آفتاب 
شد از بس گهر خیره چشم قبادبینباشت مغزش ز بس مشک باد
در آن خانه شد خواست نگذاشتندشمن هرچه بد بانگ برداشتند
که نزد خدایان ما بار نیستنه هم کیشی ایدر ترا کار نیست
قباد هنرجوی بد تند و تیزبرآهخت خنجر به خشم و ستیز
بدان چاکران گفت یکسر دهیدز خون بر سر هر یک افسر نهید
از آن بت پرستان بیفکند هفتهمه چاک زد پرده زربفت
همه شهر از آن درد بریان شدندبه فریاد نزد نریمان شدند
فرستاد گرد سپهبد به جاییکی سرور از خادمان سرای
بدو گفت بردار کن هر که هستبشد خادم و دید بتخانه پست
همه شهر با گریه و سرد بادخروشان گرفته قبای قباد
شده چاکرانش از گهر بارکشبتی زر پیکر کشان زیر کش
نیارست بد کرد کاو از سپاهبد از ویژگان فریدون شاه
چه شورست گفت این که انگیختیکه خاک از بر تارکت ریختی
سپهبد ترا دار فرمود جایبرو نزد او زود و پوزش فزای
قباد از بزرگی بر آشفت و گفتبه ایران و توران مرا کیست جفت
فریدون درشتم نگوید سخنکه یارد مرا گفت بردار کن
ز تو بی بهاتر کجا خواست کسکه ببریده پیشی و بدریده پس
کیی تو که با من بوی همزبانکه نز خیل مردانی و نز زنان
سپهدار را داد خادم خبرکه هست آن قباد فریدون گهر
اگر چه مرا دست دشنام بردترا نیز هم چندیی بر شمرد
ببخشی گناهش به از دار و بندنباید که گردد شهنشه نژند
نریمان بر آشفت و دشنام دادبه خادم دگربار پیغام داد
که گر فریدون خود شه فرخ اوستز دار اندر آویزش آهخته پوست
ندا کن که آن کس که بر مهترشکند سرکشی این رسد بر سرش
ورا با گروهش به هم هرکه بودهمان جا کشیدند بر دار زود
خوی زشت فرجام کار این کندهمه آفرین باز نفرین کند
خوی زشت دیوست و نیکو پریسوی زشتخوی نگر ننگری
همیشه در نیک و بد هست بازتو سوی در بهترین شو فراز
چو بشنید گرشاسب کار قبادپسندید و گفت این بود راه پیمان داد
نریمان نبودی مرا هم گهراگر کردی از راه پیمان گذر
چه رفتن ز پیمان چه گشتن ز دینکه این هر دو مه ز آسمان و زمین
چو یار گنهکار باشی به بدبه جای وی از تو بپیچی سزد
در آن هفته نخچیروانی ز دشتبدان سو که جرماس بد بر گذشت
بدیدش ز شاخی در آویختهز سر مغز و خون بر زمین ریخته
چو شاه کجا آگهی یافت راستفرستاد کس وز نریمان بخواست
نهفتش به دیبا و کافور و مشکتنش سوخت در آتش عود خشک
بر شه فرستاد خاکسترشبگفت آنکه بر سر چه راند اخترش
چه باید به گیتی چنین رنج بردکه آنکس که بی رنج بد هم بمرد
جهان آن نیرزد بر پر خردکه دانایی از بهر او غم خورد
گرت غم نماید تو شو کام جویمی آتش کن و غم بسوزان بروی
از آن پخته می لعل کن جام راکه پخته کند مردم خام را
کرا با خمار گران تاب نیستورا چون کباب و می ناب نیست
همی می خور از بن مخور هیچ دردکه می سرخ دارد دو رخسار زرد
جهان باد دان باده برگیر شادکه اندر کفت باده بهتر ز باد
لب ترک و شادی و رامش گزینکت اندر جهان رای به نیست زین
گرت رای آن نیست بیدار باشپرستنده پاک دادار باش
همان خواه بیگانه و خویش راکه خواهی روان و تن خویش را
چنان زی که مور از تو نبود به دردنه بر کس نشیند ز تو باد و گرد
نریمان از آن پس چو یک مه نشستهر آنچ آمدش گنج خاقان به دست
به سالار شهر کجا برشمردبنه نیز هرچ آن نشایست برد
بدو گفت چون عمم آید فرازهمیدون بدو پاک بسپار باز
وز آنجا دو هفته بیابان و دشتسپرد و ز مرز کجا بر گذشت
به شهر فغنشور شد با سپاهبزد خیمه گردش هم از گرد راه
فرستوه شاه فغنشور بودکز اختر به شاهیش منشور بود
بفرمود پیکار و بر باره شدهمه شهر با او به نظاره شد
نریمان همان روز در مرغزارهمی گشت بر گرد لشکر سوار
چو پیل دونده یکی گاو میشهمی تاخت خیلی در افکنده پیش
چپ و راست حمله برآراستههمه باره زو خنده برخاسته
نریمان چو دیدش پس از اسپ جستسروهاش بگرفت هر دو به دست
به یک زور گردنش بر تافت تفتسرش را بکند و بیفکند و رفت
شد از بیم بر چشم شه تیره هوربه دل گفت با این که شورد به زور
بشد جان جرماس و جنگی قلاچرا من شوم خیره پیش بلا
چو تازه گل روز پژمرده شدچراغ سپهر از پس پرده شد
بسازید صد تخت زیبا ز گنجز دینار چین بدره پنجاه و پنج
ستاره سرا پردهٔ زرّبفتبه بر گستوان و زره پیل هفت
چهل خیمه ساده ز چرم پلنگستاره ده از دیبهٔ رنگ رنگ
هزار اشتر از بختی و جنگلیدو صد اسپ تاتاری و جز غلی
صد از ریدگ ترک و دلبر کنیزسلیح و طرایف ز هر گونه چیز
چو خورشید بر شیر بنهادگاهمیان پیشش اندر بخم کرد ماه
همه برد پیش نریمان گردبه مهر آفرین کرد و بر وی شمرد
بدو گفت ما پیش تو بنده ایم که و مه دل از مهرت آکنده ایم
به شهر اندرون هر چه خواهد سپاهبه داد و ستد برگشادست راه
از آغاز کن کار فغفور راستپس آنگه ز ما هر چه خواهی تراست
سپهبد پسندید و بگشاد چهربپیوست با او به یک جای مهر
به بزم و به نخچیر و چوگان و گویزمانی نبودی جدا هیچ ازوی
چنین گفت یک شب فرستوه شاهکه دارم یکی خوب نخچیر گاه
که و دشتش آهو گله به گلههمان یال پرورده گور یله
گوزنان و غرمان شده تیز دنبه شورش درون شیر با کرگدن
چو فردا شود چاک روز آشکارسزد گر بدان جای جویی شکار
می و بزم و نخچیر در هم زنیمدمادم نبید دمادم زنیم
به هر باده ز آغاز شب تا به بناز آن دشت نخچیرشان بُد سخن
ببودند مست و بخفتند شادبه آرامگه جمله تا بامداد
چو از دیدهٔ روز پالود خوابدرنگ شب قیرگون شد شتاب
پگه دشت نخچیر برداشتندز گردون مه گرد بگذاشتند
خزان بد گه برگ ریزان رزانجهان سبز بیرم به زردی رزان
ز در و گهر تاک رشته نمایزمین زر گداز و هوا سیم سای
سر که سپید و رخ دشت زردخم باده لعل آبدان لاژورد
رسیده به جای سمن بادرنگسترده ز چهر سمن باد رنگ
کلنگان ز پر ساخته دستبندخروشان زده صف در ابر بلند
شکاری برآمد ز بالا و زیرصف غرم و آهو بد و گرگ و شیر
ز شاخ گوزنان رمه در رمهزمین بیشه ای گشته عاجین همه
ز باران هوا همچو ابر بهارز خون تذروان زمین لاله زار
دمان یوز بازان بر آهو بره نگون ساخته چرخ بر کو دره
به ناورد هر جای خرگوش و سگستوران به خوی غرقه مانده ز تگ
گرفته سوی کبک شاهین شتابز خون کرده چنگل عقیقین عقاب
فتاده غو طبل طغری در ابرگریزان ز گرد سواران هژبر
ز که دیده بان نعره برداشتهکمین آوران گوش بفراشته
چو گردی شده یوز کش در نبردبود ترگ زرین و خفتانش زرد
همه زرد خفتانش در رزمگاهز خون گشته پر نقطهای سیاه
نهاده بر آهو سیه گوش چشمجهان چون درخش از کمینگه به خشم
سر گوش قیرین چو نوک قلمنشان پی اش بر زمین چون درم
سپهدار در حمله بر شیر و گرگبه پیکان همی ریخت الماس مرگ
گه افکند نخچیر بر دشت و راغگهی زد به غالوک در میغ ماغ
سر گور بود از کمندش به دامدل شیر شمشیر او را نیام
بیفکند شش گرگ و جنگی دو شیردل تشنه هامون ز خون کرد سیر
نشستند از آن پس میان فرزدهمی بر گرفتند کار از میزد
به زیر آب و زافراز بارنده برگمیانشان سر شیر و دندان کرگ
به کف جام و در گوش بانگ رباببر آتش سرین گوزنان کباب
همان جا که مرز فرستوه بوددزی جای دزدان نستوه بود
دزی سرش بر اوج رخشنده مهرره پر خمش نردبان سپهر
ز بالاش گفتی که در ژرف چاهفلک چشمه و چشم ماهیست ماه
به سالی شدی مرغ از او بر فرازبه ماهی رسیدی از او زیر باز
نریمان بپرسید کاین دز کراستفرستوه گفت ای دز راه راست
یکی دزد رهدار با مرد شستدرین دز بر این کوه دارد نشست
ز گاوان و از گوسفندان همهز شهرم ربودست چندین رمه
زمان تا زمان کاروان ها بردپیی جز به تاراج و خون نسپرد
بر این کوه ره نیست از پیش و پسهمین یک تنه راه تنگست و بس
همه ساله خیلی برین کوهسارنشینند و ندهند کس را گذار
سپهدار گفتا رهانمت ازینکنم راست این کوه و دز با زمین
کمین را دو صد گرد سرکش بخواندبه بیغولها در نهان در نشاند
ز هر گوشه ای گفت دارید گوش چو من زین سر که بر آرم خروش
شما سر همه سوی بالا نهیدمترسید از راست وز چپ دهید
همان گه بپوشید خفتان کینز بالا قبا کرده زربفت چین
به دستار شاره بپوشید ترگنهان زیر در گرز بارنده مرگ
بیآمد چو شد تنگ با تیغ کوهزدند از برش بانگ تند آن گروه
کزاین سان براین که چه پویی دلیرمگر هستی از سرت یک باره سیر
برین رای تو چیز دزدید نیستو یا رای این کوه و دز دیدنست
چنین گفت کز دشت نخچیر گاهبه سالارتان نامه دارم ز شاه
از آن شاره سربند و چینی قباینهانش نیاورد کس را بجای
چو آمد بر تیغ کهسار و برز بزد نعره تند و بفراخت گرز
سپه یکسر آواش بشناختندخروشان سوی تیغ که تاختند
ز دز نیز دزدان همه پیش بازدویدند و پیوست رزمی دراز
ز تف تبر و آتش تیغ و تاببرون تاخت از خاره آهن چو آب
چنان هر کمر جوی خون در گرفتکه که چادر لعل در سر گرفت
بر آن راه داران چو شد کار تنگبرفتند در دز گریزان ز جنگ
سپه صف زد از گرد دز چار سودل مهر و مه رزم کرد آرزو
ز پیکان کین آتش انگیختندبه هر جای لاتو در آویختند
هوا گشت زنبور خانه ز تیرشد از سنگ باران رخ خور چو قیر
همی جنگ عراده از هر کرانببارید بر مغز سنگ گران
همان ابر که بار پیکار سازکه بارانش از زیر بد بر فراز
درختیست گفتی روان قلعه کنازآهن ورا برگ و شاخ از رسن
براو آشیان کرده مرغان جنگچه مرغان کشان مرگ منقار و چنگ
هرآن مرغ کز وی به پرواز شدز زخمش سر کوه پر ماز شد
بن باره سر تا سر آهون زدندنگون باره بر روی هامون زدند
به رخنه سپه سر نهادند زودز دزدان بکشتند هر کس که بود
به سالار دزدان چو بشتافتندبه کنجیش در خانه ای یافتند
تنی ده ز یارانش با او به همبه دشنه دریدند دل در شکم
نریمان یل هر چه چیزی شگفتدر آن دز بد از خواسته بر گرفت
دز آن گه فرستوه را داد بازکشیدند زی شهر با کام و ناز
وز آن روی جرماس و جنگی قلاچو ماندند بی جان به چنگ بلا
ز هر در خبر نزد فغفور شددژم گشت و ز آرام دل دور شد
یکی هفته با درد و با سوک بوداز آن پس تکین تاش را خواند زود
دوباره چهل بار بیور هزارگزین کرد گردان خنجر گذار
برایشان ز خویشان دو سالار کرددو صد پیل با هر یکی بار کرد
شتابنده فرمود تا رزم سازهمه پیش گرشاسب رفتند باز
دگر لشکری بی کران بر شمردکه آید به جنگ نریمان گرد
بد اندر کجا پهلوان سپاهکه آمد نوند نریمان ز راه
خبر داد کز نزد فغفور چینسپاهی بی اندازه آید به کین
درازای لشکرگه آن سپاهبه نزد عقاب ار بپرد دو ماه
بیابان یکی گام بی مرد نیستهمه چرخ یک برج بی گرد نیست
سوی من دگر لشکری رزم سازبرون کرد خواهم شدن پیش باز
ز دو روی پیشست پیکار سختبکوشیم تا مر کرا یار بخت
به پاسخ سپهدار گفتش که هیچمبر غم تو رزم آر و مردی پسیچ
به هر کار بیدار و بشکول باشبه شب دشمن خواب فرغول باش
دو چندان اگر لشکر آید به جنگبه یک حمله شان بیش ندهم درنگ
کنم کارزای به روز ستیزکز او باز گویند تا رستخیز
ده و شش هزار دگر نامجویبه یاری فرستاد نزدیک اوی
یکی نامه شاه کجا در نهانبیآورد زی پهلوان جهان
که سالار فغفور چین داده بودنهفته پیامش فرستاده بود
که چون با سپه گردن افراختهبیایم کنم صف کین ساخته
تو زآن سو بزن بر بنه با سپاهبه شمشیر از ایرانیان کینه خواه
سپهبد ورا گشت از آن مهر دوستبدانست کز دل هواخواه اوست
بسی دادش امید و چندی نواختهم آنجا که بد کار لشکر بساخت
که بد شهر با لشکری یار اوهمه خشنو از خوب کردار او
چو بدخواه با لشکر اندر رسیدبرابر ستاره به مه بر کشید
یکی پیل بدش از سپیدی چو عاجببست لز برش تخت صندوق ساج
گزین کرد گردی هزار از سرانبرافراخت از کوهه گرز گران
سوی چینیان رفت تا بنگرددرفش سران یک به یک بشمرد
جهان دید یک سر رده در ردهشراع و درفش و ستاره زده
ز هر سو سرا پرده از رنگ رنگهمان خرگه و خیمهای پلنگ
طلایه چو دیدش سبک تاختندبه یک جای پیکار برساختند
سپهبد برانگیخت پیل از نخستز ترکش خدنگی دو شاخه بجست
یکی را زد افتاد بر گردنشسرش را چو گویی ربود از تنش
دگر دید تازان سواری دلیرسبک جست با خنجر از پیل زیر
زدش بر سر و ترگ و خفتان کینبه دو نیم شد مری با اسپ و زین
طلایه چو دیدند بگریختندکس از بیم جان در نیاویختند
جهان پهلوان نیز برگشت بازکه شب تنگ بد نبد رزم ساز
تن کشتگان هر دو زآن دشت کینبه سالار بردند ترکان چین
دل هر دو سالار از آن خیره شدجهان پیش چشم یلان تیره شد
بر افکند هر یک نوندی به راهیکی نامه با کشتگان پیش شاه
که گفتند گرشاب سست است و پیرببین زخمش اینک به تیغ و به تیر
به پیکان سر از تن رباید همیبه تیغش ز یک تن دو آید همی
از ایران سپاهست بسیار مرهمه جان فروشان پیکارخر
سوارانش چونان که روز نبردز دریا به گردون برآرند گرد
به نوک سنان روم بر چین زنندبه گرد مه از نیزه پرچین زنند
پیاده چو بندند درهم سراینه پیچند اگر موج خیزد ز جای
تو گویی که دیوار صف بسته انداگر چون درخت از زمین رسته اند
به آهون زدن در زمان از شتابسبکتر ز ماهی روند اندر آب
اگر در بیابان بر ریگ و سنگنشان سازی از حلقه خرد تنگ
به زودی ز صد میل ره بیشتربر آن حلقه ز آهون برآرند سر
سپهکش چو گرشاسب گرد دلیرکه نخچیر او گرگ و دیوست و شیر
ز هامون به پیل اندرون روز کیندرآید چو چابک سواری به زین
یکی نیزه زآهن به چنگ اندرونتو گویی که هست آسمان را ستون
کجا کوفت برکوه گرز گراندر آن زخم که بگذرد کاروان
پیاده کند بیش جنگ و نبردبر آرد ز گردان گه حمله گرد
ولیکن به بخت تو شاه بلندپس نامه نزد تو باشد به بند
چو شب تیغ مه برکشید از نیامبه ادهم برافکند زرین ستام
ز هر دو سپه خاست بانگ جرسطلایه همی گشت بر پیش و پس
همه شب دلیران ایران و چیندر آرایش رزم بودند و کین
چو زد روز بر تیره شب دزدوارسپیده برآمد چو گرد سوار
هوا نیلگون شد چو تیغ نبردچو رخسار بد دل زمین گشت زرد
دو لشکر به پرخاش برخاستندبرابر صف کین بیاراستند
برآمد دم مهره گاودمخروشان شد از خام رویینه خم
زمین ماند از آرام و چرخ از شتاببه که خون گشاد از دل سنگ آب
دم بد دلان و تف تیغ و تیربرآمیخت چون آتش و زمهریر
سر نیزه را شد ز دل مغز و ترگزبان کشته شمشیر و گفتار مرگ
تو گفتی هوا بد یکی سوکوارزمین کشته زارش اندر کنار
غو کوس بودی غریوش به دردسنان ها مژه اشک خون جامه گرد
به هر گام بد مغفری زیر پیپر از خون چو جامی پر از لعل می
شده تیغ در مغز سر زهرسایسنان از جگر بر دل اکحل گشای
دل و چشم بد دل به راه گریزدلیران شده مرگ را هم ستیز
زخم کرده خرطوم پیلان کمندبه یال یلان اندر افکنده بند
یکی را به دندان برافراختهیکی را به زیر پی انداخته
همی تاخت گرساشب بر زنده پیلهمی دوخت دل ها به تیر از دو میل
چنان چرخ پرگرد و پر باد کردکه گردون که بد هفت هفتاد کرد
بدش پنجه بر نیزه آهنینشدی در میان سواران کین
بدان نیزه از پیل درتاختیز زینشان به ابر اندر انداختی
به هر سو که از حمله کردی هواچو پرنده مردم بدی در هوا
سوی قلب ترکان به پیکار شدبه کین جستن هر دو سالار شد
به نیزه یکی را هم اندر شتابربود از کمین همچو آهو عقاب
زدش زابر بر سنگ تا گشت خردبیفکند از این گونه بسیار گرد
همه هر سوی از حمله بر پشت پیلبینباشت از چینیان رود نیل
چنین بود تا روز بیگاه شدز شب دامن رزم کوتاه شد
چو دریای قار از زمین بردمیددرو چشمه زرد شد ناپدید
دو لشکر ز پیکار گشتند بازطلایه همی گشت شیب و فراز
همه شب ز بس بیم ایرانیاننیارست ترکی گشادن میان
همی هر کس از ترس آتش فروختیکی خسته بست و یکی کشته سوخت
چو چشمه ز دام دم اژدهابرافروخت وز بند شب شد رها
از او چرخ بر تیغ کُه رنگ زدتو گفتی که دینار بر سنگ زد
دو لشکر دگر ره به کین آمدنددلیران ز بستر به زین آمدند
برآمد ز کوس و تبیره غریوز بیم آب شد زهره نره دیو
پر از شیر و شمشیر شر رزمگاهاز آهن قبا و ز آهن کلاه
دمید از دل عیبه آتش برونز چشم زره چشمه بگشاد خون
زخشت و شل و ناوک سرکشانز بر چرخ گفتی شد آتش فشان
ز خون از در و دشت بنشت گرد شنا برد در خون همی اسپ و مرد
ز خرطوم پیلان همه دشت و غاربه هر گام چون پوست افکنده مار
گراینده بازوی کندآورانهمی ریخت زهر پرند آوران
سپاه آهنین باره ای بد دو میلهمه برج آن باره از زنده پیل
ز بس خنجر و ترگ در تیغ تیغز هر قطره خون بشد میغ میغ 
چنین بود یک هفته پیوسته جنگجهان گشت بر چینیان تار و تنگ
بد از خیلشان جاودان بی شمارگرفته بی اندازه پرنده مار
به افسونگری بر سر تیغ کوهشدند از پس پشت ایران گروه
همی مار کردند پران رهانمودند ابر اندرون اژدها
تگرگ آوریدند با باد سختپس از باد سرما که درد درخت
بد از سوی توران زمین آفتابوز این سو ز سرما همی یخ شد آب
چنان گشت کز باد بفسرد شخهمه دشت و که برف گسترد یخ
درخش جهنده جهان برفروختسیاه ابر با چرخ دامن بدوخت
بر ایرانیان خواست آمد شکستکه بیکار شدشان ز پیکار دست
خبر یافت از جاودان پهلوانفرستاد چندی دلاور گوان
برایشان ز ناگه کمین ساختندسرانشان به خنجر بینداختند
همان گه ز سرما جهان پاک شدهمه تنبل جاودان پاک شد
بر کار یزدان کیهان خدیوچه دارد بها کار جادو و دیو
همه گیتی ار دشمن تست پاکچو ایزد نگهدار باشد چه باک
سپهدار بر پیل هم در زمانخروشید و پیش صف آمد دمان
که گرتان دلیریست جنگ آوریدنه در جنگ نیرنگ و رنگ آورید
همی اژدها زابر سازید و سنگچنان کودکان را نمایید رنگ
بر ما دمان اژدهای نبردکمند یلان است در تیره گرد
همان خشت و تیرست مار بپرفسونگر سواران پرخاشخر
تگرگ فشاننده باران تیردم بد دلان زان شده ز مهریر
به نام خدای سروشی سرشتبه شهریور و مهر و اردیبهشت
به فر فریدون و ارجش به همبه گاه و گه شاه هوشنگ و جم
که از من رهایی در ین کارزارنیابید کس ناشده کار زار
بزد خشت سالارشان را ز زینفکند و به ایرانیان گفت هین
کرا بر سر آید دم رستخیزبه ایران نخواهید بردن گریز
سر از کین ابر کوهه زین نهیدبه تیغ و به گرز و تبرزین دهید
مرا گو نه پیری ببستی به جایبه تنهایی آوردمیشان ز پای
دو لشکر نهادند دل ها به مرگببارید تیر از دو سو چون تگرگ
چو بد جنگ چندی به تیر خدنگپس از تیر با نیزه کردند جنگ
پس از نیزه زی تیغ کین آختندپس از تیغ کشتی فرو ساختند
زده دست از کینه بر یکدگریکی در گریبان یکی در کمر
به دشنه یکی گشته سینه شکافبه خشت آن دگر باز دریده ناف
سرانجام شد روز ترکان درشتبه ناکام یکسر بدادند پشت
یکی ترکش انداخت دیگر کلاهگریزان برفتند بی راه و راه
پس اندر نشستند ایرانیانگشاده به کین دست و بسته میان
همه ره بد افکنده پنجاه میلگرفتند تیرست و پنجاه پیل
ز خرگاه و از خیمه رنگ رنگز شمشیر و از ترکش پر خدنگ
ز دیبا و از آلت گونه گونهمه گرد کردند یک مه فزون
چنان توده ای گشت بر چرخ و ماهکه دیدی ازو دیده یکماهه راه
ز پیرامنش زرد و سرخ و بنفشزده گونه گون پرنیانی درفش
تو گفتی که کوهیست پر لاله زارشکفته درخت اندرو صد هزار
سپهدار از او بهر شه برگزیددگر بر گرفت آنچه او را سزید
ببخشید بهر دگر بر سپاهسوی جنگ فغفور برداشت راه
دهی دید در راه در دشت و راغبی اندازه پیرامنش کشت و باغ
مه ده پذیره شدش با گروهبیاراست بزمی به فر و شکوه
ورا میهمان داشت با مهترانپراکنده نزل و علف بی کران
به هر کس چنان هدیه دادن گرفتکزاو ماند گرد سپهبد شگفت
چه مردی بدو گفت کاین دستگاهشهان را بود بر فزونی و گاه
چنین داد پاسخ که دهقان به کارچو از کشت شد وز گله مایه دار
براو بی زیان بگذرد سال پنجبیابد بر از هر چه برداشت رنج
نباشد شگفت از ره باستانکه از سیم و زر باشدش آستان
توانگر چو من نیست ایدر کسیندارم کس و چیز دارم بسی
خورم خوش همی هر چه دارم به نازنپایم که گیتی نپاید دراز
توانگر که او را نه پوشش نه خوردچه او و چه درویش با گرم و درد
همه شادی آنراست کش خواستستکرا خواسته کارش آراستست
بسان درختیست گردنده دهرگهی زهر بارش گهی پای زهر
به چشم سر آیدت حور بهشتبه چشم دل از دیو دارد سرشت
یکی خانه آباد هرگز نکردکه از ده فزون بر نیآورد گرد
درو خوش دو تن راست چون بنگریبه غم نیست این هر دو را رهبری
یکی آنکه از رای و دانش تهیستدگر آنکه باچیز و با فرهیست
مه ده منم و این ده ایدر مراستاز ایران پدر مادرم از کجاست
خداوند این کشتورز و گلهبه من شاه چین کرد این ده یله
مرا شادمان داشت فغفور چینبر او کردم اندر جهان آفرین
سپهدار نیز ارش باشد پسندز تاراجم ایمن کند وز گزند
هر آنچش هوا بد سپهدار دادوز آنجا سپه راند هم بامداد
به منزل سراپرده چون برکشیدز دهقان یکی نامه اندر رسید
که زنهار شاها بدین مرد پیرببخشای و من بنده را دست گیر
کنیزی بدم چنگساز از چگلفزاینده مهر و رباینده دل
به مشکوی سرو بهاری سرای به بزم اندر آوای بلبل سرای
به پیری جوان بودم از ناز اوشده دل به دستان و آواز او
بر او بر کسی ز آن سپه شیفتستز پنهانش بردست و بفریفتست
جهان پهلوانش گر آرد به دستفرستم به جایش پرستار شست
اگر یابم آن زاد سرو روانتن مرده را داده باشی روان
دژم شد جهان پهلوان چون شنیدبسی در سپه جست و نامد پدید
سرایی یکی دید کش پرده بودپس خیمه اندر نهان کرده بود
به چین هر دو بگریختن خواستندنهانی چو ره را بر آراستند
شد این آگهی زی سپهبد درستسبک هر دوان را گرفت و بجست
کنیزک پدید آمد اندر قبایمیان بسته چون ریدگان سرای
زره کرده پوشش به جای حریرکمر همچو دربسته مژگان چو تیر
دو مشکین کمند از بر گرد ماهگره کرده در زیر پر کلاه
مراو را ز صد گونه خوبی و نازفرستاد نزدیک به مرد باز
همان جا به درگاه دهقان پیرببارید بر بنده باران تیر
سرش را ز تن برد و بردار کردتنش را خور گرگ و کفتار کرد
وز آن جا به شهر فغفور شدبر آسود و از رنجگی دور شد
به بدرود کردن فرستوه شاهدر آن هفته بد با نریمان به راه
همان روز کآمد سپهبد فرازوی آمد هم از راه زی شهر باز
ز نزل و علف هر چه بودش توانبیاراست و آمد بر پهلوان
بسی هدیه های نوآیینش دادهمیدون یکی گاو زرینش داد
نگارش ز یاقوت و در خوشابدرونش بیاکنده از مشک ناب
ز نو ارغوان وز سپرغم به بریکی افسرش برنهاده به سر
بدو گفت داریم ما هر کسیدر این گاو مروای فرخ بسی
ورا سال گیریم از اختر به فالبدو فرخت باد گوییم سال
به زرش چنان کاو نکاهد زرنگمکاه و مسای از فراوان درنگ
به گوهرش بادی گرامی چنویبدین بوی گیتی ز تو مشکبوی
بدینسان سپرغم چو آن ارغوانسرت سبز و رخ لعل و بختت جوان
پذیرفت از او پهلوان سترگبر آن فال بر ساخت بزمی بزرگ
سه روز از می ناب برداشت بهربه روز چهارم بیامد به شهر
همه کوی و بازار گشتن گرفتبه هر جای بتخانه ای بد شگفت
یکی بتکده دید ساده ز سنگچهل ناخشه هر یک ار بیر رنگ
به هر ناخشه بر چهل لاد نیزز جزع و رخام و ز هر گونه چیز
درو گنبدی آبنوسی بلندز گوهر نگار وی از زر بند
چراغ فروزنده گردش هزاربه آلت همه سیم و بسد نگار
ستونی میانش در از لاژوردخروسی بر او کرده از زر زرد
ز هر سو در آن گنبد آبنوسزدی هر زمان یک خروش آن خروس
چو مردی چراغی شدی او فرازبه منقار بفروختی زود باز
یکی حوض زیر ستون از رخامبرش بسته دکانی از سیم خام
بتی بر وی از سنگ بنشاستهبه پیرایه و افسر آراسته
به پیکر چو مردی نشسته به جایسرافراخته گرد کرده دو پای
شمن گرد وی خیل از چینیانسترده ز نخ پاک و بسته میان
دویدند زی پهلوان هر که بودجدا هر کسش نو پرستش نمود
در آن انجمن دید پیری کهنبپرسیدش از کار آن بت سخن
به پاسخ چنان گفت پیر آن زمانکه هست این خدای آمده ز آسمان
به دل هر چه داریم کام و هواچو خواهیم ازو زود گردد روا
برآورد گرشاسب از خشم جوشچنین گفت کای گمره تیره هوش
یکی نا توان چون بود کردگارنه گویا نه بینا نه دانا به کار
خدای جهان کردگارست و بسکه بر ما توانا جز او نیست کس
یکی کز سپهر روان تا به خاکجهان یکسر او آفریدست پاک
نه چون کرد رنج آمدش زو به چیزنه گر بر گرد رنجی آیدش نیز
به یک بنده بدهد سراسر جهانندارد به کاهش زمان جهان
بدان تا بداند دل راهجویکه ارجی ندارد جهان پیش اوی
ره بت پرستی هم از شیث خواستکه از مرگ چون گشت با خاک راست
به شاگردی اش هر که دلشاد بوددل و دانش و دینش آباد بود
چنان پیکری را نهادند پیشپرستیدنش ره گرفتند و کیش
کنون نیز هر جا که شاهی بوددگر دانشی پیشگاهی بود
چو میرد بتی را به هم چهر اویپرستش کنند از پی مهر اوی
ز دوزخ ندان جاودان رستگارکسی را که این باشدش کردگار
دگر ره شمن گفت کای نیکنامخدای تو چندست و دینش کدام
چنین داد پاسخ که پیدا و رازیکست ایزد داور بی نیاز
سپهر او برآورد و این اخترانهمو ساخت بنیاد این گوهران
تن و جان ما را به هم یار کردخرد را بدین هر دو سالار کرد
گوا کرد بر بنده گوینده راستدو گیتی براو مر یکی بی گواست
چو از پادشاهیش یاد آیدتدگر پادشاهی به باد آیدت
ره دینش آنست کز هر گناهبتابی و فرمانش داری نگاه
به هستیش خستو شوی از نخستیکییش ز آن پس بدانی درست
به پیغمبرش بگروی هر که هستنیاویزی از شاخ بیداد دست 
بدانی که انگیز شست و شمارهمیدون به پول چینود گذار
عنان سخن هر کسی کاو بتافتسر رشته پاسخش کس نیافت
بماندند خیره دل از پیش اویگرفتند بسیار کس کیش اوی
سوی لشکرش پهلوان رفت بازبه پیکار فغفور بر کرد ساز
وز آن سو سپه را چو فغفور شاهفرستاد زی پهلوان کینه خواه
به در بر همیشه هزاران هزارسپه داشت گردان خنجر گزار
هزار و صد و شصت شه پیش اویبدند از سپاهش همه خویش اوی
ازو چارصد را به پرده سرایزدندی همه کوس و زرینه نای
بدش رسم هر روز فرشی دگرز شاهانه دیبای چینی به زر
یکی دست زیبای او جامه نیزیکی خوب دوشیزه دلبر کنیز 
بد از شهر ها سیصد و شست و پنجز گردش سراسر چو آکنده گنج
خراج یکی شهر هر بامدادرسیدی بدو از ره رسم و داد
هر آن کار و رایی که انداختیبگفت ستاره شمر ساختی
بخوان برش هر روز چون شش هزاربدی مرد در بزم هم زین شمار
به جایی که رفتی برون با سپاهبه رزم ار به بزم ار به نخچیرگاه
ز خویشان و از ویژگان هفت کسبدندی ز پیرامنش پیش و پس
چنان یکسر از جامه و اسپ سازبدان تا کس از بن نداندش باز
بدش کوشکی یکسر از آبنوسبدان کوشک از زر هفتاد کوس
چو از شب شدی روی گیتی دژممر آن کوس ها را زدندی به هم
همه شهر از آواز آن سر به سرکس از خانها شب نرفتی به در
که هر سو کس شاه بشتافتیبکشتی روان هر که را یافتی
به رزم نریمان چو شد کار سختدر گنج بگشاد و بر بست رخت
هیونان بختی ده و شش هزاربه هم ساخت با آلت کارزار
چهل گاو گردون ز زر بار کرددو صد دیگر از دیبه انبار کرد
بفرمود تا هر که در کشورششهی بود با لشکر آمد برش
ببستند بر پیل صندوق و کوسز گرد آبگون چرخ گشت آبنوس
سپاهی فراز آمد از چین ستانبه رزم از یلان هر یکی کین ستان
نه از مرگشان باک نز تیغ تیزنه از آب بیم و نه زآتش گریز
به مردی یگانه به کوشش گروهبر زخم سندان بر حمله کوه 
به دل شیر تند و به تن پیل مستبه کین برق تیز و به تیر ابردست
فزون ز ابرشان ناوک انداختنهم از بادشان تیزتر تاختن
بد اسپ از گیا بیش وز ریگ مرداز اختر سپاهش بد از چرخ گرد
ز رنگین سپرها در و دشت و راغچنان گشت کز گل به نوروز باغ
ز هر پیکری بود چندان درفشکه از سایه شد روز تابان بنفش
یکی نیستان بود پر پیل و کرگز نیزه نی اش پاک وز تیغ برگ
ز پیروزه تختی به زر کرده بندنهادند بر چار پیل بلند
بر آن تخت بنشست فغفور شاهز بر چتر و بر سر ز گوهر کلاه
فرازش درفشی درفشان چو شیدبه پیکر طرازیده پیل سپید
سرش طغری و تنش یکسر ز زرز یاقوت چشم از زبرجدش بر
بتی بودش از زر گوهر نگارفراوان بر او برده لؤلؤ به کار
ببردش که تا گر شود کار سختکندش او گه رزم پیروز بخت
ز پیش سپه پیل تیرست و شستشده زیر پی شان سر کوه پست
همه پشت پیلان رویینه تنپر از ناوک انداز و آتش فکن
ز لشکر همی خواست گرد سواربر آن سان که خیزد ز دریا بخار
ز جندان به ده روزه راه درازبیآمد بر ژرف رودی فراز
ستاره شمر گفت از آن سوی رودمرو لشکر آور هم ایدر فرود
که گر کودکی زان سوی رود پایمرو لشکر آواره گردد ز جای
بد از یک سوی رود فغفور شاهدگر سو نریمان به یک روزه راه
شه آگه ز فغفور کآمد به جنگبیار است لشکر چو شد کار تنگ
به ایرانیان گفت گردان چینهراسیده اند از شما روز کین
نباید که امشب شبیخون کنندبه کین از شما دشت پر خون کنند
چو آید شب آتش مسوزید کسنه آواز باید نه بانگ جرس
بوید از کمین دیده بگماشتهزره در بر اسپان به زین داشته
به آذرشن و ارفش شیرفشسپرد از دو لشکر کینه کش
فرستادشان بر چپ و دست راستکمین کرد خود هم بدان سو که خاست
چو پوشید شب عاج گیتی بشیزپراکند بر سبز مینا پشیز
تو گفتی که بر تخت پیروزه پوشگهر ریخت هندوی گوهر فروش
ز ترکان شهی بود فرمانگزارسپه داشت از جنگیان سی هزار
سوی رزم ایرانیان با شتابشبیخون سگالید و بگذشت از آب
بیآمد بی آگاهی شاه چینکمین کرد و آگه نبود از کمین
سپه دید در خیمها بی هراسنه جایی طلایه نه آواز پاس
بزد کوس و تن بر سپه برفکندخروش یلان شد به ابر بلند
درآمد ز چپ ارفش کابلیسوی راست آذرشن زابلی
پس اندر نریمان و ایرانیانگرفتند بدخواه را در میان
شب قیرگون شد ز گرد سپاهچو زنگی که پوشد پرند سیاه
جهان پاک چون تیره دوزخ نموددر او تیغ چون آتش و شب چو دود
دلیران دشمن به بند کمندچو دیوان شب تیره گردن به بند
ز ترکان نرستند جز اندکینشد باز جای از دو صدشان یکی
چو از دامن ژرف دریای قارسپیده برآمد چو سیمین بخار
گیاها بد از خون تبرخون شدهدل خاره زیر تبر خون شده
گریزندگان نزد فغفور بازرسیدند با رنج و گرم و گداز
ستاره شمر شد غمی ز آن شتابکه لشکر گذر کرد نا گه ز آب
بدانست کافتاد خواهد شکستسبک نزد شه رفت زیجی به دست
بدو گفت بر تیغ این که یکیشوم بنگرم راز چرخ اندکی
بدین چاره بگریخت شد ناپدیددگر تا شه چین بد او را ندید
به دم گریزندگان بر دمانبیآمد نریمان هم اندر زمان
دو ره گرد بودش ده و شش هزاربرآراست از گرد ره کارزار
ببد تند فغفور هم در شتاببیآمد به پیکار ازین سوی آب
دو لشکر رده ساختند از دو رویجهان گشت پر گرد پرخاشجوی
غو کوس با مهره بر شد به همز شیپور و از نای برخاست دم
بپوشید پهنای هامون ز مردببد خشک دریای گردون ز گرد
ز خون گشت روی زمین پرنگارز پیکان دل و چشم کیوان فکار
زمین آنکه از بر بد از زیر شدجهان را دل از خویشتن سیر شد
ز بس گونه گونه درفش سپاهبهاریست گفتی همه رزمگاه
ز تیغ اندرون برق و باران ز تیرز گرد ابر تیره ز خون آبگیر
چنان رود خون بد که بر کوه و دشتسوار آشناوار بر خون گذشت
ز بس نعل پاشیده بر دشت کینزره داشت پوشیده گفتی زمین
سواران به کین گردن افراختهیلان نیزه بر نیزه انداخته
ز که تا که از گرد پیوسته میغز کشور به کشور چکاچاک تیغ
سنان را دل زنده زندان شدهبر امید ها مرگ خندان شده
ز خون پرندآوران پشت پیلچو شنگرف پاشیده بر کوه نیل
همی تا بشد خور پس تیغ کوهبدین گونه بُد رزم هر دو گروه
چو موج درفشان فرو برد سرپراکنده بر روی دریا گهر
نمود از سر کوه خمیده ماهچو از زر زین بر سیاه اسپ شاه
فروهشت شب دامن از روی جنگسپه بازگشت از دو سو بی درنگ
ببستند راه شبیخون به پیلطلایه پراکنده شد بر دو میل
ز بس کز دو رو آتش افروختندشب تیره را دیده بر دوختند
همی هر کسی مردم خویش جستیکی کشته برد و یکی مرده شست
چو روز از جهان کارسازی گرفتدمید آتش و زر گدازی گرفت
سپیده دمش گشت و کوره سپهرهوا بوته زر گدازیده مهر
دگر باره هر دو سپه ساختهکشیده صف و تیغ و خشت آخته
ز پولاد ده میل دیوار بودبدو بر ز خشت و سنان خار بود
زمین پاک جنبان از آشوب و شورزمان خیره از نعره خنگ و بور
هوا از درفشان درفش سرانچو باغ بهار از کران تا کران
چو زلف بتان شاخ منجوق بادگهش برنوشت و گهی برگشاد
تو گفتی که هر یک عروسیست مستنوان و آستینها فشانان به دست
گرفتند رزمی گران همگروههوا گرد چون قیر شد کوه کوه
چنان کشته بر هر سوی انبار گشتکه هر جا که بد دشت دیوار گشت
ز بس نعره هر کوه نیمی بکاستبه هرکشور از خون دو صد چشمه خاست 
زمانه شب و تیغ مهتاب شددل مرد چشم و سنان خواب شد
برافروخت از نعل اسپان گیابگردید بر که ز خون آسیا
بغرید کوس و بدرید کوهزمین گشت تار و زمان شد ستوه
بجوشید گردون بپوشید ماهبشورید قلب و بجنبید شاه
یلان را جگر بد ز کین تافتهشده بانگ سست و لبان کافته
ز سر سوده تیغ و ز کین زیر ترگ ز تن جان ستوه و ز جان سیر مرگ
همه کوه درع و همه دشت نعلدل خور کبود و رخ ماه لعل
درفشی فراز مه افروختهدرفشی به خاک اندر انداخته
ز بس خشت گردان پیکار سازشده پیل چون در نیستان گراز
به قلب اندر استاده فغفور چین به گردان لشکر همی گفت هین
به هر کاو فکندی یکی کینه خواههمی زر بدادی به ترگ و کلاه
نریمان چپ و راست اندر نبردهمی تاخت بر گرد گردان چو گرد
زمین گفتی از وی بگردد همیسمندش جهان بر نوردد همی
از اسپش همه دشت آوردگاهز ناورد بد چرخ و از نعل ماه
به تیغ از یکی تا بپرداختیبه نیزه سرش بر مه انداختی
به کین پاشنه خیز کرده سمندبر قلب شد با کمان و کمند
بیفکند ده پیل و سیصد سوارسوی شاه چین حمله برد ابروار
سوارانش را یکسر آواره کرد درفشش به نیزه همه پاره کرد
شد افکنده چندان ز گردان چینکه بیش از گیا کشته بد بر زمین
ز بس جان که از مرگ پالوده شدتنش سست و چنگال فرسوده شد
ز کشته چه گویم بر آن کس که زیستببخشید چرخ و ستاره گریست
همه شاه را خوار بگذاشتندگریزان ز پس راه برداشتند 
پدر بد که خسته پسر را به پایسپردی همی چشم و ماندی به جای
زره دار بد کز تن خویش پوستهمی کند و پنداشتی درع اوست
تنش بنگریدی که بر پای هستبه سر دست بردی که بر جای هست
چو دل جستی از تن سنان یافتیپر از ناوک تیردان یافتی
دم خون چو رو مهین هین گرفتز غم چهره شاه چین چین گرفت
بتش را که آورده بد پیش باز به صد لابه هر گاه بردی نماز
همی خواست پیروزی اندر نبردنبد هیچ سودش فزون لابه کرد
چو لشکرش بگریخت او نیز تفتدر اسپ نبرد آمد از پیل و رفت 
به جندان شد و هر چه باید به کاربیاراست از ساز جنگ و حصار
ز ترکان ز صد مرد ده رسته بودوزآن ده که بد رسته نه خسته بود
همه کوه و غار و در و دشت و تیغبد افکنده ترگ و سر و دست و تیغ
مر افکنده را گرگ دل کرد پاشگریزنده را غول گفتی که باش
سرا پرده و خیمه و ساز چنگهمان جوشن و ترکش و نیملنگ
بت و تخت فغفور و پیلان رمهگرفتند گردان ایران همه
چنین است بخش سپهر روانیکی زو توانا دگر ناتوان
یکی جفت تخته یکی جفت تختیکی تیره روز و یکی نیک بخت
جهان را ز تو خوی بد راز نیستهمی گویدت گرچش آواز نیست
نهان با تو صد گونه رنگ آوردزبون گیردت گر به چنگ آورد
به خواری کشد چون به مهرت ببستبه پای افکند چون کشیدت به دست
چو میشت دهد پوشش و خورد و سازپس آن گه چو گرگان به دردت باز
از آهوش تا بیشتر آگهیمبه مهرش درون بیشتر گمرهیم
از آن پس نریمان چو شد چیره دستپس از رزم در بزم و شادی نشست
ببد تا بیآمد جهان پهلوانگرفتند شادی ز سر هردوان
سخن چند راندند از آن رزمگاهوزآنجا به جندان گرفتند راه
ده و شهر و دز هر چه دیدند پاکبکندند و با خون سرشتند خاک
تو گفتی زخوبان و از خواستهبهشتیست هر خیمه آراسته
همی برد هر شیر جنگی شکارگرفته به بر آهوی مشکسار
ز بازوش گرد میان کرده بندز گیسوش در دست مشکین کمند
فراوان بتان زینهاری شدندفراوان به دزها حصاری شدند
رسیدند زی شهر جندان فرازسپه خیمه زد دشت شیب و فراز
به چرخ از همه شهر بر شد خروشز جوشن وران باره آمد به جوش
به یک سو نریمان به کین دست بردبرآمد دگر سو سپهدار گرد
به هر گوشه عراده برساختندهمی دیگ جوشیده انداختند
کز آن دیگ چون آب جستی برونهمی سوختی جانور گونه گون
دگر بد روان قلعهای نبردبراو رزم سازنده مردان مرد
سر نیزه ها کرده چون چنگ شیرکه مردم کشیدندی از باره زیر
گرفتند گردان ایران و چینکمان های زنبوری و چرخ کین
ز شاهین و طیاره بر هر گروههمی سنگ بارید چون کوه کوه
ز پاشیدن آتش از هر کرانهمی ریخت گفتی ز چرخ اختران
رخ مه ز گرد ابر پر چین گرفتسر باره از نیزه پرچین گرفت
همه ترگ هاون شد از زخم سنگسر و مغز چون سرمه از گرز جنگ
بد از تیر و پیکان های درشتهر افکنده ای چون یکی خارپشت
جهان پهلوان کوشش اندر گرفتگراینده گرز گران بر گرفت
چو بر باره مردم غمی شد ز جنگجهان پهلوان رفت گرزی به چنگ
در از آهن و باره از سنگ بودبه کین کرد سوی در آهنگ زود
همی زد چنان گرز کز زخم سختدر و قفل و زنجیر شد لخت لخت
به شهر اندر افکند تن با سپاهفروزد به باره درفش سیاه
به هر گوشه تاراج و پیکار خاستخروشیدن بانگ زنهار خاست
همه بوم زن بد همه کوی مردهمه شهر دود و همه چرخ گرد
ز خون بسته شد بر کف پای گلنه بر پای تن بد نه بر جای دل
کجا خانه ای بد به خوبی بهشتاز آتش دمان دوزخی گشت زشت
بتان را به خاک اندر افکنده تنبه خون غرقه پیش بت اندر شمن
به هر کوی جویی چنان خون گذشتکه از شهر یک میل بیرون گذشت
دو هفته چنین بود خون ریختنجهان پر ز تاراج و آویختن
چو چاره نبد شهری و لشکریگرفتند زنهار و خواهشگری
از ایشان گنه پهلوان درگذاشتسپه را ز تاراج و خون باز داشت
نریمان همی رفت تا کاخ شاهز گردش پیاده سران سپاه
همه چاک خفتان زده بر کمرگرفته به کف تیغ و خشت و سپر
هزاران پیاده به پیش اندرونکشیده همه خنجر آبگون
پس پشت از ایران و زابل گروهسواران برگستوان ور چو کوه
چو آمد سوی کاخ فغفور چینابا این بسنده دلیران کین
جهان دید پرخیل دلبر فغانهمه برده از پرده بر مه فغان
دو گلنارشان غرقه در خون شدهدو نرگس به مه بر دو جیحون شده
ز گل کنده شمشاد پر تاب رابدو رشته در خسته عناب را
به بتخانه ای بود فغفور چیننهاده سر از پیش بت بر زمین
همی خواست یاری به زاری و دردز ناگه نریمان بدو باز خورد
بیازید و بگرفت دستش به شرمبسی گفت شیرین سخن های گرم
که تاج شهی خار بنداختیبر از پایگه سر کشی ساختی
شه ار چه به پایه ز هر کس فزوننشایدش از اندازه رفتن برون
بیاورد بالای تا بر نشستپیاده همی شد رکیبش به دست
جهان پهلوان بود بمیان شهربه گردش بزرگان لشکر دو بهر
یکی تخت زیرش ز یاقوت و زربه دیبای چین سایبانی ز بر
چو فغفور را دید شد پیش بازنشاند از بر تخت و بردش نماز
بسی خواست زو پوزش دلپذیرکه این بد که پیش آمد از من مگیر
تو دانی که پیش فریدون شاهمن از دل یکی بنده ام نیکخواه
نشاید به جز کام او کردنمکه فرمانش طوقیست بر گردنم
کسی را که روزیت بر دست اوستتوانایی دست او دار دوست
ترا بود از آغاز پنداشتیکه پند مرا خوار بگذاشتی
کنون گر ز من گشت آشفته کارهم از من نکو گردد انده مدار
اگر چند از مار گیرند زهرهم از وی توان یافت تریاک بهر
نگهبان گمارید چندی بر اویوزآنجا به تاراج بنهاد روی
پس پرده در کاخ مشکوی شاهنه او شد نه کس را ز بن داد راه
ز گنجش هم اندر زمان ده هزارشتروار هر چیز برداشت بار
چه از زر چه از دیبه رنگ رنگچه آرایش بزم و چه ساز جنگ
بگفتند کاین گنج کمترش بودبگو تا نماید دگر گنج زود
به نیکی ورا گفت دادم نویدمبادا کزآن پس شود ناامید
اگر چند خواری کند روزگارشهان و بزرگان نباشند خوار
ز جندان و از گنج فغفور چینز تاراج آن بوم و بر همچنین
فراز آورید آنچه بد در سپاهگزین کرد ازو پنج یک بهر شاه
بفرمود تا نام هر یک بهمزدند از پی یادگاری قلم
شتر سی هزار از درم بار کرددگر نیم ازین بار دینار کرد
ز زرینه آلت به خروارهاز سیمینه چندانکه انبارها
شمرده شد از نافه سیصد هزارصد از سله زعفران شصت بار
ز در چار صد تاج آراستهگزیده همه یک یک از خواسته
ز یاقوت سیصد کمر بیغویز گوهر چهل گرزن خسروی
دو صد خوان ز زر وز جزع و جمستوز آلتش خروار تیرست و شست
ز زر پیرهن سی و شش بافتهبه هم پود با تار برتافته
طراز همه در بر زر نابگریبان و یاقوت و در خوشاب
ابا هر یکی افسری شاهوارهم از گونه گون طوق با گوشوار
چهل درج پر در و یاره همهکه بد نامشان در واره همه
هزار و چهل بت ز هر پیکریبه کردار آراسته لشکری
ز زر بفت صد تخت بر رنگ رنگکه بد کمترین جامه سی من به سنگ
صد و سی هزار از خز و پرنیاندو صد رزمه نو حله چینیان
کنیزان دگر سی هزار از چگلپری چهره خادم هزار و چهل
دو ره ده هزار از بتان سرایهمه با ستور و سلیح و قبای
صد و سی هزار از ستور یلهکه بر دشت و که داشت چوپان گله
ده و شش هزار اسپ نو کرده زینهمه زیر بر گستوان های چین
هزار اسپ دیگر به زرین ستاماز ارغوان و از تازی تیزگام
ز خفتان و از جوش کارزارز درع و کژ آکند نو سی هزار
صد و بیست گردون همه تیغ و ترگدو چندان سپرهای مدهون کرگ
ز زر خشت تیرست و سی بار پنجکه مردی یکی بر گرفتی به رنج
نود بار صد جفت چینی کمانبه زر نیزه و تیر بیش از گمان
هزار و صد و سی جناغ پلنگز هر گوهر آراسته رنگ رنگ
پرند آور هندویی شش هزارتبرزین و ناخج فزون از شمار
صد و سی سپر گونه گونه ز زرغلافش ز دیبا نگار از گهر
بی اندازه منجوق و زرین درفشهمان چتر ها زرد و سرخ و بنفش
شراع و ستاره دو صد زر بفتز دیبا سراپرده هفتاد و هفت
دو صد خرگه اندر خور بزم و جامنمد خز و چوبش همه عود خام
هم از بیکران خیمه گونه گوناز اندازه شان فرش و آلت فزون
دگر خیمه میخ او شش هزارسراسر ز دیبای گوهر نگار
ز زر اندرو صد ستون ستیخاز ابریشمش رشته و ز سیم میخ
ز دیبا یکی فرش زیبای اودو پرتاب بالا و پهنای او
درفشان درفشی دگر از پرندز گوهر چو زاختر سپهری بلند
که بر پیل کردندی آن را بپایبه صد مرد برداشتندی ز جای
بر او پیکر گرگی افراشتهبه نوک سرو پیل برداشته
فراوان گهر زآن درفش بنفشکشیدند در کاویانی درفش
سه گردون زرین شتالنگ بودز هر دارویی هفتصد تنگ بود
فراوان دد و مرغ و نخچیر و گورطرازیده از زر و سیم و بلور
ز عنبر یکی گنبد افراختهبه یک باره هر سو روان ساخته
بدودر چو کافور تختی ز عاجفرازش فروهشته از مشک تاج
سرایی به بند و گشای آبنوسهم از زر تیرست و هفتاد کوس
هزار و چهل جفت دندان پیلز پیروزه سی تخت همرنگ نیل
سروهای کرگ از هزاران فزونهمه چون خمانیده زآهن ستون
ختو هشتصد بار کز زهر بویچو آید فتد هر زمان خوی ازوی
ز کیمخت گردون دو صد بسته تنگهمیدون طبر خون و چینی خدنگ
پر از نقره صندوق تیرست و شستز زرش همه قفل و زنجیر بست
پر از زر رسته چهل جفت نیزچهل بد طرایف ز هر گونه چیز
بیا کنده سی درج نو جفت جفتز هر گوهر سفته و نیم سفت
دو ره چارصد تنگ قرطاس چینپلنگینه چرم سفن هم چین
ز هر موی روباه سیصد هزارز سنجاب و قاقم فزون از شمار
دوصد باره موی سمندر دگرکه آتش نباشد براو کارگر
دمان هفتصد پیل چون کوه نیلبه زر بسته دندان هر زنده پیل
دو ره چارصد یوز بد میش گیربه تن همچو پاشیده بر قیر شیر
سیه گوش تیرست هریک به بندپلنگان آمخته هشتاد و اند
فراوان سگ تند نخچیر دربه جل ها پرند و به زنجیر زر
دو صد باز و افزون ز سیصد خشینصد و شصت طغرل همه به گزین
ده و شش هزار استر بارکشبه مهد و نمدزین دو صد بار شش
دو ره سی هزاران ز تازی هیونز فرش و نمد بارشان گونه گون
ز گاوان صد و سی هزار از شمارز میشان دوشا هزاران هزار
چو پنجه هزار دگر برده بودکه هریک به صد ناز پرورده بود
سپهبد گزید این همه چار ماهیکی نامه فرمود نزدیک شاه
نویسنده قرطاس بر برگرفتسر خامه در مشک و عنبر گرفت
بر آمد ز شاخ آن نگونسار سارکه بر سیم بارد ز منقار قار
سواری سه اسپه پیاده روانتنش رومی و چهره از هندوان
همان شیرخواره کش از قیر شیرز گهواره بر جست گویا و پیر
همه تنش چشم و همه چشم گوشهمه گوش دل ها همه دل خروش
دویدندش با سرنگونی به راهسخن گفتنش بر سپیدی سیاه
نگارید نام خدای از نخستکه بی نام او دین نیاید درست
خداوند هرچ آشکارست و رازاز آهو همه پاک و دور از نیاز
بری از گهر بی گزند از زمانفزون از نشان و برون از گمان
دگر آفرین کرد بر شاه نوکه بادش بلند افسر و گاه نو
خدیو زمانه کی فرمندگشاینده گیتی و ضحاک بند
شه خاور و خسرو باخترکیومرثی تخم و جمشید فر
فرستاده از دین به کشور درودگذارنده بی کشتی اروند رود
دهد شاه را بنده مژده ز بختکه بنوشتم این دیو کش راه سخت
به خون بداندیش ز الماس کینبشستم همه بوم ماچین و چین
ز جیحون شدم تا بد آن جا که مهربر آن بوم تا بد نخست از سپهر
به هر شاه بر باژ کردم نخستجز از کام شه کس نیارست جست
به فغفور در سرکشی کار کردنشد رام و آهنگ پیکار کرد
بسی پند دادم برش خوار بودنپذرفت کش بخت بد یار بود
دل خیره در رای فرهنگ تاببپیچد همی چون سرش ز آفتاب
فرستاد پیشم سپه چند بارپراکنده بیش از هزاران هزار
همان جادوان ساخت تا روز جنگنمودند هرگونه افسون و رنگ
ز سرما و آوای دیو و هژبرز مار بپر و اژدهای در ابر
برآمد به هم بیست رزم گرانشد افکنده سیصد هزار از سران
سرانجام هم بخت شه بود چیردرآمد سر بخت بدخواه زیر
همه بوم چین گشت بر هم زدهبتان برده بتخانه آتشکده
دگر سی هزار از گرفتاریانجز از بردگان اند و زنهاریان
به بند اندرون بسته هشتاد شاهکه با کوس زرین و گنج اند و گاه
مگر شاه فغفور کش نیست بندکه شه بود و بندش ندیدم پسند
ز گنجش یکی بهره برداشتیم دگر دست نابرده بگذاشتم
مگر شاه با مهر پیش آیدشببخشید گناه و بخشایدش 
نریمان یل مژدگان آورستکه مر شاه را بنده کهترست
به هر رزمگه در بدادست دادچو آید کند هر چه رفتست یاد
نشستست بنده دو دیده به راهبدان تا نمایش چه آید ز شاه
چه فرمان دهد دیگر از رزم سختکرا دارد ارزانی این تاج و تخت
به عنوان بر از بنده شاه گفتکه از فر او هست با ماه جفت
همه کار فغفور زیبای اوبیاراست آن رسم دربای او
صد و ده شتر را درم بار کردچهل دیگر از بار دینار کرد
دگر چارصد دست زربفت چینگزید آنچه پوشیدی از به گزین
سرا پرده و خیمه پیشکارعماری و پیل و کت شاهوار
کنیزان دوشیزه تیرست و شستبه رخ هر یک آرایش بت پرست
به دستور او یک به یک برشمردسخن راند پس با نریمان گرد
که در ره چنان دار کارش به برگکه نبود نیازش به یک کاه برگ
مکن کم ز خوردش همه رسم و سازوز او مردمش را مدار ایچ باز
از آن پس چهل جفت یاره ز زرگزین کرد و صد گوشوار از گهر
دو  صد دانه یاقوت و لعل آبدارز در و زبر جد دو ره صد هزار
بفرمود کاین با تو همراه کنچو رفتی نثار شهنشاه کن
گره شد ز غم بر رخ شاه چینز کاهش چو افتاد بر ماه چین 
ز خسته دل زار و چشم دژمسرشت آتش درد بآب بقم
همی گفت کای پادشاهی دریغکه ماهت نهان شد به تاریک میغ
بدی باغ آراسته پرنگاردرختانت کندند یکسر ز بار
سپهری بدی روشن از تو جهانشدند اختران و آفتابت نهان
عروسی نو آیین بدی گاه راربودند ناگه ز تو شاه را
ندانم که کی بینمت نیز بازابا روز شادی و آرام و ناز
دو جزعش ز لؤلؤ شده ناپدیدهمی زد ز خون نقطه بر شنبلید
برآرد جهان سرکشان را زکارکند نرمشان گردش روزگار
سپهر روانرا ببد دستبردبسست این چنین چند خواهی شمرد
یکی دایره ست آبگون چنبریفراوان درین دایره داوری
نه مر پادشاه و نه مر بنده راشناسد نه نادان نه داننده را
تو ای دانشی چند نالی ز چرخکه ایزد بدی دادت از چرخ برخ
نگر نیک و بد تا چه کردی ز پیشبیابی همان باز پاداش خویش
چو از تو بود کژی و بی رهیگناه از چه بر چرخ گردان نهی
ز یزدان شمر نیک و بدها درستکه گردون یکی ناتوان همچو تست
نریمان چو دید اشک فغفور و دردرخش گشته ماننده برگ زرد
بدو گفت مندیش چندان به راهشکیب آر تا من سوم پیش شاه
به یزدان که بنشینم آن گه ز پاینگر کامت آرم سراسر به جای
شد و برد پیش آن همه خواستهاسیران و خوبان آراسته
همه راه پیوسته پنجاه میلستور و شتر بود و گردون و پیل
ز گردون به گردون شده بانگ و جوشجهان پر درای و جرس پر خروش
شه چین جدا با فغستان و رختهمی رفت بر پیل با تاج و تخت
ورا جای بر زنده پیلی سپیدمهان بر هیونان عودی هوید
سخن جز به دستور سالار بارنگفتی به ره در نهان و آشکار
خور و پوشش و فرش و خوبان به همنکرد ایچ از آن رسم کش بود کم
ازین مژده چون آگهی یافت شاهبر افروخت از ماه برتر کلاه
هزار اسپ بالای زرینه سازفرستاد با لشکر از پیشباز
دو ره پیل سیصد چو دریا به جوشز برگستوان دار و از درع پوش
ز صندوق پیلان خروشنده نایغریوان شده زنگ و کوس و درای
دو صد پیل در دیبه رنگ رنگز برشان درفش دلیران جنگ
همه پیلبانان به زرین کمر ز در تاجستان گوشوار از گهر 
پلنگان به زنجیر زرینه بندهمان گرگ و شیر ژیان در کمند
شد آمل بهشتی نو آراستهدرم ریز و دیبا فشان خواسته
سه منزل سپه داده زی راه رویدورویه زده صف به کردار کوی
تبیره زنان پیش و بازیگرانسران می دهنده به یکدیگران
سپر در سپر گیل مشکین کلهخروشان همه چون هژبر یله
ز رنگین سپرها چنان بد زمینکجا چرخ در چرخ دیبای چین
همه مردم شهر بی راه و راهزده صف به دیدار فغفور شاه
طرازیده بر پیل اورنگ اویز گوهر گرفته جهان رنگ اوی
یکی چتر طاووس رنگ از برشابر سر ز یاقوت و در افسرش
بر درگه شه چو آمد فرازچنان کش همی دید شاه از فراز 
ز پیل زیان آوریدند زیرزمانی بماندند بر جای دیر
ببردند زی کاخ شاه بلندنهادند بر پایش از زر بند
فریدون نیاورد ازو هیچ یادنپرسیدش از بن نه امید داد
برش نیز یک هفته نگذاشت کسبباد فرهش بد همین کرد بس
نریمان بر شه شد از گرد راهگرفت آفرین داد نامه به شاه
نخست از نثار آنچه بد پیش بردپس آن گه دگر هدیه ها برشمرد
به یک هفته در هفتصد بار ششبد از پیش شه مردم بارکش
همی گفت چون کشور چین که دیدکه چندین شگفت از وی آمد پدید
نه در گنج ماند و نه در کاخ جاینه در باغ و ایوان و نه در سرای
کشنده سته مانده بی پای و پیشمارنده از رنج خون گشت خوی
از آن پس نریمان به پای ایستادفروبست دست و زبان برگشاد
به بوسه نشان کرد مر خاک راگرفت آفرین خسرو پاک را
ز فغفور و آرایش کشورشسخن راند و از گنج و از لشکرش
که شاهی سزا افسر و گاه راندیدم چو او جز شهنشاه را
اگر بر خرد خیره بیداد کردشدش گنج و رنجش همه باد کرد
نپیچد شه از مردمی رای خویشفرستدش دلخوش سوی جای خویش
نباید بد ایمن به بخت ارچه چیرکه دولت نماندست یک جای دیر
که داند که این چرخ بدساز چیستنهانیش با هر کسی راز چیست
به رنجست آنکش هنرها مهستنکوکاری و نیکنامی بهست
که ماند نکونامی ایدر به جایبود با تو نیکی به دیگر سرای
شمر یافه تر زندگانی تو آنکه نکنی نکویی و داری توان
بود دوری از بد ره بخردیبهی نیکی و دوریت از بدی
به تلخی چو زهرست خشم از گزندولیکن چو خوردیش نوشست و قند
ببخشود شه ز آن سخن ها و گفتبزرگی فغفور نتوان نهفت
ورا این بزرگیش بی راه کردکه با ما به کین دست بر ماه کرد
ازین نیست باد فره اکنونش بیشکه یک هفته شد تا نخواندمش پیش
ببر خلعت و بند بردار ازویبه پوزش دلش پاک از انده بشوی
بگویش گناه از تو آمد نخستکه فرمان ما داشتی خوار و سست
کمان گاه ضحاک بنداختیچو گاه من آمد به زه ساختی
من این بد مکافات آن ساختمنه زآن کاره تو شاه نشناختم
کنون بودنی بود مندیش هیچامید بهی دار و رامش پسیچ
مر این خانه را خانه خویش دانمرا گرچه بیگانه از خویش دان
به تو گر بدی کردم از آزمونبه هر بد کنم صد نکویی فزون
ز دیدار تو شرم دارم همیبدین کرده ها پوزش آرم همی
ز خواری و رنجی کت آمد مشیبکه گیتی چنینست بالا و شیب
سپهر روان با کسی رام نیستز نیک و بد ماش آرام نیست
چو پرنده مرغیست فرخنده بختجهان باغ و ماها سراسر درخت
به باغ اندرون مرغ پران ز جاینشیند بر آن شاخ کآندیش رای
بر آن باش فردا که هر دو به کامنشینیم یک جای و گیرم جام
نریمان شد و برد خلعت پگاهبپوشید و شد شاد فغفور شاه
گرفت آفرین پشت را داد خمز شادی به چشم اندر آورد نم
چو شاه فروزندگان از سپهرز پیروزه گون تخت خود دید چهر
فریدون پگه کرد سوری پسیچکز آن سان نبد دیده فغفور هیچ
به گلشن گهی کز دو سو داشت درنمودند دیدار با یکدیگر
ز هر در درآمد یکی تا ز جاینه برخاست باید یکی را به پای
به بر یکدیگر را گرفتند شادبه پوزش سخن چند کردند یاد
نخستین گرفتند بر خوان نشستپس از آن گه به بگماز بردند دست
نشستنگهی بود ایوان چهارز هر گونه آراسته چون بهار
میان اندرون خانه رنگ رنگز مینا گل او ز بیجاده سنگ
همه بومش از صندل و چوب عودبدو اندر از زر سیصد عمود
معلق بدو چارصد کنگرهز جزع و بلور و گهر یکسره
بساطش سراسر زبرجد نگارهمه شفشه زر بد پود و تار
ابر پیشگه تختی از لاژوردگهر در گهر ساخته سرخ و زرد
دو صد طاس پر عنبر از پیش تختزده در میانشان ز مرجان درخت
ز زر بی کران نار و نارنج بودکه هر یک بهای یکی گنج بود
همه دانه نار یاقوت و درز کافور نارنج ها کرده پر
طبق های نقل از عقیق یمنپر از مشک کرده بلورین لگن
ز هر سو یکی باد بیزن ز برفروهشته از پر طاووس نر
ز کافور شمامها ریختهتل عود و آتش برآمیخته
پر از در و یاقوت هر جای جامخمی پخته می هر سوی از سیم خام
به هر گوشه جز عین یکی آب گیرگلاب آب و در سنگ و ریگش عبیر
ز سیم و ز زر مرغ و پیل و ددهبه نیرنگ کرده روان بر رده
چو نخچیرگاهی به وقت بهاردر او هم گلستان و هم گل به بار
هزار از بزرگان خسرو پرستتکوک بلورین و بالغ به دست
بتان سرایی میان بسته تنگبه کف جام وز جامه طاووس رنگ
همه سرو سیمین به زرین کمرهمه میگسار آهوی مشک سر
به شمشاد پوینده عنبر فروشبه یاقوت گوینده در خنده نوش
فروزان به مجمر یکی عود خشکفشانان به باد آن دگر گرد مشک
می زرد بد در بلورین ایاغچو در آب پاک از نمایش چراغ
نوا پیشگان بر گرفتند رودهمی جام می داد جان را درود
بدینسان فریدون مهی بیشترهمی ساخت هر روز بزمی دگر
همه یاد فغفور چین خواستیبه شادیش با جام برخاستی
ز هر تحفه چندانش آورد پیشکه هم چین شدش خوار و هم گنج خویش
از آن پس نریمان یل را نواختز بهرش بسی خسروی هدیه ساخت
صدش بدره بخشید دینار گنجز هر دیبه رخت پنجاه و پنج
دو صد ریدگ ترک با اسپ و سازپری چهره سی خادم دلنواز
ز شمشیر و ترگ و سپر بی شمارز خفتان و از درع و جوشن هزار
ز گستردنی بار سیصد هیونشراع و ستاره ده از گونه گون
زرنج و همه غور و زابلستانهم از بلخ تا بوم کابلستان
بدو داد پیوسته تا مرز سندنبشته همین عهدها بر پرند
سزا هر که را بود با او بهمگهر داد و بالا و زر و درم
دگر هر چه بد اندر آن بزمگاهز خوبان و از فرش وز تخت و گاه
ببخشود یکسر به فغفور چینیکی کرسی نغز دادش جز این
ز زر بر سرش کودکی میگساربه کف جامی از گوهر شاهوار
هر آن گه که شه دست بفراشتیوی آن جام می پیش او داشتی
چو خوردی به آواز گفتی که نوشازو بستدی باز بودی خموش
شراعی که از پر سیمرغ بودبدادش پر از گوهر نابسود
دگر تاجی از گوهر شاهوار که شب شمع با او نبودی به کار
بدادش ز بیجاره تختی دگرطرازیده بر پشت شیری ز زر
که هر ساعت آن شیر جستی ز جای زدی نعره آن گه نشستی ز پای
به کام اندر آتش دمیدی ز دورشدی زو هوا پر بخار بخور
دو یاقوت دادش دگر لعل رنگ صد و بیست مثقال هر یک به سنگ
چهل در دیگر همه نابسودکه هر یک مه از خایه باز بود
به مثقال سی سرخ گوگرد پاکبه یکپاره چون اختری تابناک
دگر هر چه از چین بد آورده چیزسراسر بدو باز بخشید نیز
به درگاه او باز فغفور شاهببخشید یک یک همه بر سپاه
جز آن افسرین گوهر شاهواردگر آنچه در راهش آمد به کار
شه گیتی از بهر گرشاسب بازبسی هدیه گونه گون کرد ساز
هم از کوس و منجوق وز تخت زرهم از پیل و بالا و تیغ و کمر
قبا و کلاه گهربفت خویشدگر هدیه هر چیز در گنج بیش
همه بوم ماهان و جای مهانهم از قهستان تا در اصفهان
بدو داد تا مرز قزوین و رییکی عهد بر نامش افکند پی
مهانی که بودند با او به چینسزا هدیه ها داد نو هم چنین
نبشت آن گهی پاسخش باز و گفترسید آن سخن های با مهر جفت
یکی نامه گویا چو فرخ سروشکه از در معنی صدف کرده گوش
پیام آورش مژده را مایه بودخرد را سخنهاش پیرایه بود
روان ها شد از مژده شادی سرشتبه هر دل دری بگشاد از بهشت
ترا تا گشادست دست بلندبود بی گمان پای دشمن به بند
تو شیری و تیغ تو ز الماس ابرروان بار ابر و عنان دار ببر
هوا نیست نز گرد تو تیره فامزمین نیست نسپرده اسپت به گام
ز خون کف شیران به کفشیر تستدل و رزم و کین جفت شمشیر تست
هنرها چنین از تو نبود شگفتدلیری و رزم از تو باید گرفت
تو رنجی و من بر خورم از جهانهمانا که تو دستی و من دهان 
بیآمد به مژده نریمان گردهمه هر چه گفتی یکایک شمرد
اگر چند فغفور کژی گزیدز ما راستکاری و خوبی سزید
بدو چون ترا نیکویی بود رایبه نیکی فرستادمش باز جای
چو آید بدو باز بسپار چینبه چینش از رخ بخت بزدای چین
بر او باژ و ساو همه چین نخستنبشت و ستد عهدی از وی درست
به نزل و علف هر که بودند شاهبفرمود کآیند پیشش به راه
دو منزل شدش همره و گشت بازسپه راند فغفور با کام و ناز
به بزم و به خوان هم بدان رسم پیش همی زیست در ره چو در شهر خویش
بزرگان بدین مژده برخاستندهمه چین و جندان بیاراستند
زمین سر به سر دیبه چین گرفتهوا از درم ریز پروین گرفت
همی هر سوی آذین دیبا زدندز شادی ثری بر ثریا زدند
همه خاک ره گل شد از بس گلابز گل گل دمید از نرمی لعل ناب
صدف گشت هامون ز بس در نثارشد از نافه ابر آهوی مشک بار
چنان بد ز بس گرد اسپ سپاه که از بر ندیدند کس مهر و ماه
جهان پهلوان با بزرگان چینپذیره شدش چند منزل زمین
چو فغفور بنهاد در کاخ پایبیامد سر خادمان سرای
ز گرشاسب آزادی آورد پیشهمان نیز خاتون از اندازه بیش
که بر ما ز تو مهر به داشتستپس پرده بیگانه نگذاشتست
ز دروای ما هر چه بایست نیزهمی داد خرم ز هر گونه چیز
ازین مژده فغفور شادی گرفتچنین کار ازو گفت نبود شگفت
کند هر کس آن کآید از گوهرشکه هر شاخ چون تخمش آرد برش
دگر روز شبگیر با فرهیچو بنشست برگاه شاهنشهی
بزرگان چین سر برافراختندبر شاه چین آمدن ساختند
سلب هر چه شان بد کبود و سیاهفکندند یکسر ز شادی شاه
چنان پادشاهی بر او راست شدکا گاهش بر از مه همی خواست شد
نخست از همه کس که بد نامدارجهان پهلوان برد پیشش نثار
خراجی که در چین ز هر سو فرازستد بد بدو نیز بسپرد باز
بدو داد باز آن همه شاه چینبسی هدیه بخشید نیزش جز این
از آن پس به نزدیک شاه کیانیکی نامه فرمود بر پرنیان
گه رفتنش با مهان سپاهبرون رفت پیشش دو منزل به راه
ورا کرد بدرود و برگشت شادجهان پهلوان سر سوی ره نهاد
وز آن سو نریمان چو یک مه ببودبه درگاه شه رفت شبگیر زود
کمر بسته راه و بر سر کلاهز بهر شدن خواست فرمان شاه
دگر گفت کز چین چو برخاستمبر شهریار آمدن خواستم
مرا عم من پهلوان داد پندکه چون باز خانه رسی بی گزند
یکی جفت شایسته کن در خورتبپیوند ازو در جهان گوهرت
که خواهد نژادی بزرگ از تو خاستکه گیتی بدارد به شمشیر راست
درختی ز تخم تو سر برکشدکه بر آسمان شاخ او می‌ کشد
همه پهلوانانش باشند یاردلیران رزم و بزرگان بار
کنون شهریار آشکار و نهفتشناسد که نگزیرد از روی جفت
به گیتی خداوند از آن شد پدیدکه هر چیز را پاک جفت آفرید
جهان از دو حرف آمدست از نخستسخن کم زد و حرف ناید درست
خطی ناورد خامه ای بی دو سرچو مرغی نگیرد هوا بی دو پر
یگانه گهر گرچه زیبا بودنکوتر چو جفتیش همتا بود
بزرگیست در بلخ بامی سرستمرا نیز در تخمه هم گوهرست
جز از دخت او نیست زیبای منبدو شاه روشن کند رای من
مگر بنده ای زو دهد کردگارکه اندر رکیب شه آید به کار
نوندی هم آن گاه شه برنشاند به سوی شه بلخ و او را بخواند
بسی مژده داد از بلند اخترشسخن راند باز آن گه از دخترش
مر او را ز بهر نریمان بخواستهمه دست پیمان او کرد راست
ز گنجش بسی هدیه بخشید و چیزهمه بلخ بامی بدو داد نیز
فرستادش آن گه سوی بلخ بازکه رو کار دختر بجوی و بساز
سوی سیستان شد نریمان گردبر او شه بسی هدیه ها برشمرد
که شادان شو و جفت خود را ببینسوی سیستان آر و آنجا نشین
که آن شه که بر شهر کابل سرستز خویشان ضحاک بدگوهرست
به دل دشمنی جوی و بدخواه ماستکز اهریمنی تخمه اژدهاست
بدان مرز هر سو نگهدار باشاز آن دشمن بد تو بیدار باش
نریمان به دامادواری چو بادسوی سیستان رفت پیروز و شاد
به آوردن جفت کس رفت زودفرستاد چیزی که شایسته بود
شه بلخ چندان برافشاند گنجکه ماند از کشیدن جهانی به رنج
چه از فرش و آلت چه از سیم و زرچه از در و دیبا و سنگ و گهر
عماری بیاراست با مهد شستکنیزک دو صد جام و مجمر به دست
به جام اندرون در از اندازه بیشبه مجمر همه عود سوزان ز پیش
دگر چارصد ریدگ دلنوازچهل خادم ترک شمع طراز
جهان پر ز خوبان چون ماه کردچنین هدیه با دخت همراه کرد
زمین از گرانی ببد سرگرایکه بیچاره گشت از پی چار پای 
ز بلخ آنچنان بار دربار بودکه تا سیستان ره چو دیوار بود
نریمان پذیره شد آراستهجهان گشته سور سران خاسته
ببارید تند ابر شادی ز بردل شادمان از برآمد به در
در آیین دیبا زده کوی و بامفروزان به هر سو تلی عود خام
چنان درفشان بود و عنبرفشانکه درویش زر بد به دامن کشان
همه راه آذین و گنبد زدهبه هر گنبدی گل فشانان رده
به پرواز مرغان برانگیختهز هر یک دگر شعری آویخته
ز دیبا در و دشت طاووس رنگدم نای هر جای و آوای چنگ
بزرگان همه راه با کوس و بوق فشانان به طشت آب مشک و خلوق
نظاره دد از کوه مرغ از هواگه این لهو سازنده گه آن نوا
هم از راه در شاه با ماه خویشدر ایوان نشستند بر گاه خویش
ز مشک و گهر تاج بد شاه راز یاقوت و در افسری ماه را
به هم هفته ای شاد بگذاشتندبر از کام و آرام برداشتند
سرشک خرد چون از ابر هنرصدف یافت آن در شد مایه ور
گرانمایه مهر جهان کردگارگرفت از نگین خدایی نگار
تن ماه چهره گرانی گرفتروان زاد سروش نوانی گرفت
گلش هر زمان گشت بی رنگ ترهمان بار درش گران سنگ تر
چو بد گاه زادنش بیمار گشتبر او انده بار بسیار گشت
چنان سخت شد کار زادن بر اویکزاو زندگی خواست برتافت روی
به مشکوی مشکین بتان سرایهمه سر پر از خاک و زاری فزای
پزشکی بد از فیلسوفان هندکه گرشاسب آورده بودش ز سند
بیاراست هر دارو از بیش و کمبدو داد با تخم کتان به هم
همان گه شد آسان بر آن ماه رنجپدید آمدش در گویا ز گنج
جدا گشت تیغ شهی از نیامبرون شد خور از میغ تاریک فام
چراغی بد از خود ز خوبی و فربرافروخت از خود چراغی دگر
پسر زاد ماهی که از چرخ مهرز خوبی بدو آرزو کرد مهر
به دیدار گفتی پدر بود راستبرین برگوا کس نبایست خواست
نریمان یل نام او سام کردبه مهرش روان و دل آرام کرد
نوندی به نزد فریدون شاهبه مژده برافکند پویان به راه
پرندین چنان کودکی ساختندچو گردانش بر اسپ بنشاختند
کمند و کمان درفکنده به یالیکی گرز شاهان گرفته به بال
یکی نیزه بر دست و خنجر به چنگسپر باز پشت و کمر بسته تنگ
فرستاد با نامه ای بر حریربه گرشاسب گردنکش گردگیر
برآن نامه از دست کودک نشانز مشک و گلاب و می و زعفران
فرسته همی شد چو مرغ بپربه هر منزلی بر هیونی دگر
به ره نامه مر پهلوان را سپردز شادی جوان شد سپهدار گرد
برآن پیکر شیر بچه شگفتفروماند وز دل نیایش گرفت
درآمد ز زین گشت غلتان به خاکهمی گفت کای راست دادار پاک
تو کن روزی بنده آن روزگارکه بینمش در صف همیدون سوار
فرستاده را داد بسیار چیزهمان جامه و یاره خویش نیز
وز آن ره که بد زی بر شاه شدفریدون شه زو چو آگاه شد
پذیره فرستادش از چند میلسپه یکسر و کوس و بالای و پیل
برون از در کوشک از جای خویشچو نزدیک شد رفت ده گام پیش
بر خویش همبرش بنشاند شادبپرسید و از رنج ره کرد یاد
همی داشت یک مهش دل شاد خوارگهی بزم و بازی و گاهی شکار
سر ماه دیبا و زر و درمسلیح و دگر هدیه ها بیش و کم
ببخشید چندانش از گونه گونشده توده یک کوه بالا فزون
سوی خانه فرمود تا شد به کامبه دیدار فرخ نریمان و سام
چو شد پهلوان بسته ره را کمرقباد آن کجا کاوه بودش پدر
به درگه چنین گفت پیش مهانکه این شه ندارد نهاد شهان
پدرم از جهان جز مر او را نخواستبه شمشیر گیتی ازو گشت راست
از اورنگ برکند ضحاک راسپرد افسرش زیر پی خاک را
ز گرشاسب ما بیش بردیم رنجبدو بیش بخشد همی شهر و گنج
شد این آگهی نزد شه آشکارنهان داشت تا بود هنگام بار
چو شد بر سران بارگاه و سرایبرآورد سر شاه دانش سرای
چنین گفت کای نامدار انجمننیوشید یکسر ز دل پند من
به یزدان پناهید تا از گزندبودتان به هر دو جهان سودمند
منازید از آن شادمانی و نازکه آرد سرانجام درد و گداز
بی اندرز هرگز مباشید کسببینید هر کار را پیش و پس
مبندید با رشک و با آز رایکه این غم فزایست و آن جانگزای
مجویید دانش ز بی دانشانکه نادان ز دانش ندارد نشان
کنید آزمون ها به دانش فزونکه هست آینه مرد را آزمون
همیشه دل از شاه دارید شادبه ویژه که دارد ره دین و داد
بنازید اگرتان نوازد به مهربترسید چون چین آرد به چهر
مگویید شه را به از بی رهیکه تان بد رسد چون رسد آگهی
اگر چه باشید از دور بازبود دست شاهان به هر سو فراز
بود گوش با چشم شه را بسیکجا گوش و چشمش بود هر کسی
چو شه دادگر باشد و ره شناسبدو داشت باید ز یزدان سپاس
نباید گواژه زدن بر فسوسنه بر یافه گفتن شدن چاپلوس
چنان خوش نباید بدن کت خورندچنان ترش نه نیز کت ننگرند
ز زخم سنان بیش زخم زبانکه این تن کند خسته و آن روان
چو دستور شد دل خرد همچو شاهزبان چون سپهبد سخن چون سپاه
سپهدار دارد سپه را به جایکز اندازه ننهد کسی پیش پای
بنا گفته بر چون کسی غم خورداز آن به که بر گفته کیفر برد
سه چیز آورد پادشاهی به شورکزآن هر سه شه را بود بخت شور
یکی با زنان رام بودن به همدوم زفت کاری سیوم دان ستم
شه نیک با کامرانی بودچو بد گشت کم زندگانی بود
سزا پادشاهی مر آنرا سزاستکه او بر هوای دلش پادشاست
ز گیتی بی آهو نیابی کسیاگرچه دارد هنرها بسی
شه آن به که باشد بزرگ از گهرخرد دارد و داد و فرهنگ و فر
به آکندن گنج نکند ستمنخواهد که خسبد ازو کس دژم
ز هر بد به دادار جوید پناهبه انداز هر کس دهد پایگاه 
نماند به تیغ و به تدبیر و گنجکه آید ز دشمن به کشورش رنج
مرا این همه هست و پاکی تندگر تا شهم بد نیاید ز من
نه رنج کسی یافه بگذاشتمنه بر بی گنه رنج بگماشتم
جهانبان دهد پادشاهی و تختنگردد کسی جز بدو نیکبخت
جز ایزد ندادستم این تاج کسسپاس از جهان بر من او راست بس
سزد پس که بدگوی چیزی کندبه بد گفتن من دلیری کند
پس آن گه ابا خشم گفت ای قبادبد مردمان از چه گویی به یاد
مگر رشک مغزت بکاهد همیزبانت سرت را نخواهد همی
ز گرشاسب وز کاوه رانی سخنگله هر چه کردی شنیدم ز بن
همه روم تا خاور و هند و چینزبون گشت گرشاسب را روز کین
جهان خیره ماند ز برزش همیبه گردون کشد پیل گرزش همی
سته دیو و پیل از خم خام اوستژیان شیر و تند اژدها رام اوست
کجا نیزه زد در صف کارزارپسین مرد باشد چو پیشین فکار
به هند ار فرو کوبد از گرز بومز بس زور او لرزه گیرد به روم
چو من هم ز جمشید دارد نژادتو چون کاوه دانیش گشته به باد
پدرت از سپاهان بد آهنگرینه زیبا بزرگی نه والاسری
چو بگزید ما را نکونام شدبه کف درش پتک گران جام شد
از آهنگری رست و سالار گشتپس از کلبه داری سپهدار گشت
بد آن گاه در کلبه با دود و دمکنونست در بزم با ما به هم
بدادیمش اهواز و ده باره شهرهمی زین فزونتر ز ما یافت بهر
اگر برد رنج آمدش گنج برتو نیز آیدت آرزو رنج بر 
ز بهر همه کس بود شهریارنه از بهر یک تن که باشدش یار
دگر تا تویی یافه زینسان مگویبه دشتی که گمراه گردی مپوی
مجوی آنچت آرد سرانجام بیممکش پای از اندازه بیش از گلیم
مینداز سنگ گران از برتکه چون بازگردد فتد بر سرت
گر آزرم بابت نبودی ز بنچو از رفتگان بودی از تو سخن
همان کردمی با تو از راه دادکه در چین نریمان به دیگر قباد
سخن هر چه گفتم به دانش ببیننگاری کن این را و دل را نگین
شد از بیم شه زرد و ارزان قبادبه زاری و پوزش زبان برگشاد
بس گشت در خاک زنهار خواهببخشید خون و ببخشود شاه
خبر یافت کاوه پسر را بخواندفراوان بر او خشم و خواری براند
به خون کرد با خنجر آهنگ اورهاندند خویشانش از چنگ او
فرستاد کس شاه کشور نوازبه یک جایشان آشتی داد باز
وزآن سو جهان پهلوان شادکامهمی زیست خرم به دیدار سام
همی گفت کاو چون گرد زور و برزز من به بود گاه شمشیر و گرز
به یک سال از آن شادی و فرهینشد دستش از جام روزی تهی
نوندی سر سال نو کرد راستخراج خداوند کابل بخواست
شه کابلی گفت کاین نیست دادشهنشه به بیداد فرمان نداد
تو خواهی و خواهد خداوند تاجبه سالی دوباره نباشد خراج
بر این آرزو پهلوان سترگفرستاد نامه به شاه بزرگ
خراج همه کابل و بوم اویبدو داد یکسر شه نامجوی
جهان پهلوان از پی نام راببخشید باز آن همه شام را
ز گیتی همه سیستان ساخت جایبه رفتن نزد چند گه نرد رای
جهان سرگذشت نو از هر کسیچنین گونه گون یاد دارد بسی
جهان خانه دیو بد پیکرستسرایی پرآشوب و درد سرست 
یکی گور دانیست بر راه روکه گوری فزون نیست هر گاه نو
بیابانش لهوست و ریگش نیازسمومش هوای دل و غول آز
دهی شد که باشد برو رهگذار درون هست و بیرون شدن نیست چار
دهندست و آنچ او دهد بیش و کمستاند همان باز با جان به هم
به دانندگان همچو زندان زشتبر آن کس که نادان و بی دین بهشت
برش این یکی دان که دانش سرایبرد زو همی توشه آن سرای
وی ار ناگهانت بخواهد ربودتو زو بهره خویش بردار زود
کنون از شه طنجه و پهلوانشنو کار کین جستن هر دوان
بدان گه که از نزد ضحاک شاهسوی طنجه شد پهلوان سپاه
ز دریا و خشک آنچه آورده بودبه دست شه طنجه بسپرده بود
که تا باز خواهد چه آرد هوابدین کرده بد مرد چندی گوا
سرآمد مر آن شاه را روزگارپسرش از پس او شده شهریار 
پسر نیز رفته به راه پدرنبیره ببسته به جایش کمر
چنان بود رای شه سرفرازکه آن خواسته خواهد از طنجه باز
بر این کار پوینده ای کرد راستز شاه کیان هم بدین نامه خواست
شه طنجه را طمع بربود و گفتکه این آگهی با دلم نیست جفت
گذشتست از این کار سالی دویستمرا سال نیز از چهل بیش نیست
چنین دام هرگز مگستر به راهز گنجم گرت رای چیزیست خواه
نهی پایت از پایه بیرون همیکه خرگوش گیری به گردون همی
سپهبد بدانست کآنست رنگبه جنگ آید آن خواسته باز چنگ
ده و دو هزار از سران سپاهگزید و برون شد به فرمان شاه
به فرخ نریمان چنین کرد یادکه کارت همه راه دین باد و داد
گر آیم من ار نه به هر بیش و کممزن جز به رای شهنشاه دم
ببوسیدش از مهر و لشکر کشیدخبر چون بر شاه طنجه رسید
پراکند بس گنج و کین کرد سازبی اندازه آورد لشکر فراز
شد از بس که بودش سپاه گرانزمین چون سپهر از کران تا کران
برآمد سپهدار با لشکرش ز گرد ابر بست از بر کشورش
بر طنجه نزدیک یک روز راهبه گرد دهی خیمه زد با سپاه 
مه ده یکی پیر بد نامجویبسی سال پیموده گردون بدوی
فراوان ز نزل و علف برشمردهمه برد نزد سپهدار گرد
از آن خواسته گفت دارم خبرکه در طنجه بنهادی از پیشتر
برادرم زندست و با من گواستدر آن نامه هم نام و هم خط ماست
از آن شاد شد پهلوان چون شنودسوی طنجه شه نامه ای ساخت زود
سر نامه کرد از جهاندار یادخداوند دین و خداوند داد
فرازنده هفت چرخ سپهرفروزنده گیتی از ماه و مهره
دگر گفت کای گمره از کردگارچه طمع است کاندر دلت کرد کار
بود نزد فرزانه کمتر کس آن که خیره کند طمع چیز کسان
نکوتر بود نام زفتی بسیز خوانی که با طمع بنهد کسی
همانا به چشمت هزاک آیدمو یا چون تو ابله فغاک آیدم
کزینسان سخن های غاب آوریهمی چشم دل را به خواب آوری
کرا رنگ چهره سیه تر ز زنگبدو کی پدید آید از شرم رنگ
هنرهام هر کس شنیدست و دیدتو از ابلهی چون کنی ناپدید
کجا من شتاب آورم بر درنگنوند زمان را شود پای لنگ
اگر بر زمین برزنم بانگ تیزجهد مرده از گور بی رستخیز
به گهواره در هند کودک خروشچو گیرد به نامم نباشد خموش
به چین آتشی کاید از آسمانبرند از تف تیغ تیزم گمان
یکی خواسته کان جهان را بهاستچو من گردی آورده از چپ و راست
چو در گنجت ای زاغ رخ تیره روزنهفتی چو اندر زمین زاغ کوز
کنون گویی آگه نی ام ز آن درستهمه کس شناسند کآن نزد تست
سرانت گواه اند بسیار و منفرستادم اینک به نزدت دو تن
اگر چند باشند بسیار کسگوا نزد داور دو آرند و بس
اگر باز بفرستی آن خواستهزان هم که بودست آراسته
هم از من بود پایه ات نزد شاههم از شاه یابی بزرگی و جاه
وگر ناوری آنچه رای آورمسرو افسرت زیر پای آورم
بر از چرخ کیوان گر ایوان تستوگر نام دیوان به دیوان تست
سرت را ز گرودن به گرد آورمدل دوستانت به درد آورم
پیمبر براهیم بود آن زمانبدش نام زردشت از آسمان
به صحفش بر این خورد سوگند نیزبدان دو گوا داد بسیار چیز
به هم با فرستاده شان رنجه کردفرستاده آهنگ زی طنجه کرد
چو شه نامه برخواند آن هر دو تنگوایی بدادند بر انجمن
جز ایشان گوا بود دیگر بسیولیکن نیارست دم زد کسی
دژم زی فرسته شه آورد رویبدو گفت رو پهلوان را بگوی
چو دیوار بر برف سازی نخستنگون زود گردد به بنیاد سست
نه هرچ آن بگویند باشد همانبر راست گم زود گردد گمان
به مردی و گنج و سپاه از تو کمنی ام چیست این طمع پر باد و دم
نبودی مرا در جوانی همالکنون چون بوی کت بفرسود سال
یکی مویم افتاد در کار زاراگر بینی از بیمت آید چومار
مرا با شهنشاه از این نیست جنگبه جنگم تویی آمده تیز چنگ
فرستادگان را به خواری برانددو ره صد هزار از یلان را بخواند
در آهن بیاراست صد زنده پیلز طنجه برون خیمه زد بر دو میل
بد از سرفرازان یکی کینه توزسپهدار او بود نامش متوز
ز لشکرش نیمی بدو داد بیشز بهر نبردش فرستاد پیش
فرسته خبر زی سپهدار بردسپهبد سبک دست پیکار برد
بیآورد نزدیک دشمن سپاهبه جنگ اندر آمد هم از گرد راه
طلایه بزد بر طلایه نخستبه خون هر سوی غرقه شد بوم و رست
به پیچش گرفتند گردان عنانسوی سینه ها راست کرده سنان
توگفتی ز بس گرد بالا و پستکه هامون به گردون درآورد دست
یکی ژرف دریا شد از خون زمینکه بد نزد او چشمه دریای چین
زمانه زمین را همی خون گریستستاره ندانست رفتن که چیست
گرفتند زاول گروه بی شمارسلیح و ستور اندر آن کار زار
چو چرخ شب آرایش از سر گرفتز ماه تمام آینه برگرفت
فرو هشت زلفین مشکین نگونز زر خال زد بر رخ نیلگون
نفرمود پیکار دیگر متوزکه شد گاه آورد و بگذشت روز
به گردان فرستان گرد سپاهکه دارید امشب شبیخون نگاه
کمین ساخت هر جای بالای و شیبسپاهش کس آن شب نخفت از نهیب
همه شب ز بیم شبیخون متوزهمی بود بیدار تا گشت روز
چو بازی برآورد چرخ روانبه زرین و سیمین دو گوی دوان
یکی گوی سیمین فرو برد سردگر گوی زرین برآورد سر
دو لشکر سنان ها برافراختندکمینگه گرفتند و صف ساختند
زمین را سپهر از گرانی سپاهنداند همی داشت گفتی نگاه
جهان پهلوان درع گردی چو گردبپوشید و بگرفت گرز نبرد
بر او هفتصد سال بگذشته بودز گشت سپهری کهن گشته بود
خروشید گفتا مرا خیره خیرز بیغاره دشمن کهن خواند و پیر
کنون به کنم رزم و کوشش ز بنکه بهتر کند کار تیغ کهن
کهن بهتر از رنگ یاقوت و زرهمیدون می از نو کهن نیکتر
مرا گشت چرخ ارچه خم داد پشتهمان بیش زورم به زخم درشت
بگفت این و با لشکر از چپ و راستبه جنگ آمد و گرد کوشش بخاست
پر از بومهن شد سراسر جهانستاره هویدار و گردون نهان
ز بس در زمین از تف نعل تاببه دریای قلزم به جوش آمد آب
همی تا دو صد میل در که خروشفتادی و باز آمدی باز گوش
زبر آسمانی بد از تیره گردزمین زیر دریا بد از خون مرد
سواران در آن ژرف دریا نوانچو کشتی درفش از برش بادبان
پر از دام هامون ز خم کمندبه هر دام درمانده گردی به بند
شده لعل گرد از دم خون و تیغچو گاه شب از عکس خورشید میغ
ز بس کاینه بد درفشان ز پیلهمی خاست آتش ز دریای نیل
سپهدار با گرز و نیزه به چنگپیاده همی تاخت هر سو به جنگ
به هر گنبدی جست پنجاه گامهمی کوفت گرز و همی گفت نام
گهی دوخت با سینه خرطوم پیلگهی ریخت خون همچون دریای نیل
چه خیل پیاده چه خیل سوارز بد خواه چندان بیفکند خوار
که مر مرگ را گشت چنگال سستشد از دست او پیش یزدان نخست
به درعش در از زخم مردان جنگبه هر حلقه در بود تیری خدنگ
شل و ناوک و تیر در مغفرشفزون زانبه موی بد بر سرش
که و دشت پر کشته بد پیش و پسچنین تا شب از رزم ناسود کس
شب تیره چون شعر بافنده گشتکبود و سیه بافت بر کوه و دشت
مراین را به زر پود در تار زدمر آن را به مشک آب آهار زد
در جنگ هر دو سپه شد فرازبه سوی سپه پهلوان گشت باز
ز خون دید هر جای جویی روانهمی هر کسی گفت با پهلوان
که فردا اگر پیشت آید متوزنخستین جز از وی ز کس کین متوز
که سالار این بیکران لشکر اوستبرین شهسواران خاور سر اوست
درفشش نهنگست و خفتان پلنگسیاه اسپ و برگستوان لعل رنگ
ز پولاد و در آژده مغفرشپرندین نشان بسته اندر سرش
نبرده درفشش برون سپاهبیاید بود هر سوی کینه خواه
برون آمد امروز تند از کمینفراوان سران زد زما بر زمین
ندیدیم جز تو چنان نیز گردبه زور تن و مردی و دستبرد
جهان پهلوان گفت کامروز جنگچو شد تیز جستمش نآمد به چنگ
چو خور تیغ رخشان ز تاری نیامکشد گردد از خون شب لعل فام
هر آنجا که فردا به چنگ آرمشبه یک دم زدن زنده نگذارمش
وز آن سو سپه با متوز دلیرسخن راندند از سپهدار چیر
که گفتند گرشاسب پیرست و سست جوان کی تواند چنان رزم جست
کنون تیز دندان تر آمد به جنگکه دندان نماندستش از بس درنگ
کجا جستی از جای و جستی ستیزچو آتش بدی تند و چون باد تیز
فکندی به هر زخم پیلی نگونبکشتی به هر حمله ده تن فزون
گرفتی دم اسپ و بفراختیبه هم با سوارش بینداختی
متوز جفا پیشه گفت این نبردهمه سخت از آن باد بودست و گرد
چو گردد شب از تیرگی نا امیدسپیده برآرد درفش سپید
من و گرز و گرشاسب و آوردگاهسرش بر سنان آورم پیش شاه
سپیده چو شب را به بر درگرفتشبش کرد بدرود و ره برگفت
ببد سیم دریا زمین زر زردخم آهن که و آسمان لاژورد
گرفتند گردان به کین ساختنجهان از یلان گشت پر تاختن
ز غریدن کوس و شیپور و نایز بانگ جرس وز جرنگ درای
سته مغز کیوان و بی هوش گشتدل و زهره زهره پر جوش گشت
دم اسپ کوته شد و تک درازفرازی ببد پست و پستی فراز
ز بس تیرگی چهر گیتی فروزسیه گشت گفتی شب آمد به روز
سر گرد با جان به جوزا رسیدتن کشته با خون به دریا رسید
درنگ جهان گفت گیتی شتاباز آهن روان خون چو از سنگ آب
یلان را به خون غرقه تیغ و سپریکی جان سپار و یکی تن سپر
پر از شیر غران ز نعره زنانپر از مار پران ز خشت آسمان
ز خرطوم پیل و سر جنگجویهمه دشت پاشیده چوگان و گوی
چو مرغی شده مرگ پرش خدنگز سرنیزه منقارش و خشت چنگ
یلان را به منقار درنده نافسران را به چنگال تارک شکاف
در آن رزم زاول گروه یکسرهشکسته شدند از سوی میسره
برایشان یکی گرد سالار بودکه عم زاد فرخ سپهدار بود
نهاد اندر آوردگه پای پیشسپه را فرو داشت بر جای خویش
بسی کشت چندان که سرگشته شدسرانجام در رزمگه کشته شد
سپهبد بر آن درد تند از کمینبه زیر آمد از پیل با گرز کین
دو دستی همی کوفت از پیش و پسنیارست با زخمش استاد کس
مگر توبئی کآمد از صف جنگیکی خشت چون مار پیچان به چنگ
بیفکند او را و ناسود هیچگریزان عنان را ز پس داد پیچ
گرفت از هوا خشت او پهلوانبینداخت و بردوختش پهلوان
متوز از کمینگه برانگیخت اسپعمودی به دستش چو زآهن فرسپ
بیفکند چندان سر از چپ و راستچو گرشاسب را دید بگریخت خواست
سپهبد به یک تک در اسپش رسیدبرآورد گرز و غوی برگشید
چنان زدش و با اسپ برهم فکندکه از زورش اندر زمین خم فکند
دلیران ایران پسش هر که بودبه زین کوهه بر سر نهادند زود
گرفتند هر سو ره کارزارفکنده شد از طنجه ای سی هزار
گریزنده جان در تک پای دیدنبد پای کس کاو ز یک جای دید
ز درج شبه سر چو شب باز کردبه پیرایه پیوستن آغاز کرد
بتی گشت گیسوش رنگ سیاهزنخدانش ناهید و رخ گرد ماه
شد طنجه تازنده از جای جنگز پس باز شد تا در شهر تنگ
سپه را ز سر باز نو ساز کرددل جنگیان یک به یک باز کرد
دگر گفت پیروز گاه نبردز بختست نز گنج و مردان مرد
بکوشید یکدست فردا دگردهد بختم این بار یاری مگر
چو گرشاسب تنها دراید به جنگز هر سو بر او ره بگیرید تنگ
به زخمش فرازید بازو همهشبان کز میان شد چه باشد رمه
به کشتی بنه هر چه بد کرد بارسپه برد نزدیک دریا کنار
که تا گر دگر بارش افتد شکستبه دریا گریزان شود دوردست
همه شب بدین رای بفشرد پیدرازی شب کرد کوته به می
سپهبد چو از طنجه برگاشت بازبگشت اندر آن مرز شیب و فراز
همی خواست تا یکسر آن بوم و برببیند که کم دید بار دگر
چو یک هفته شد دید کوهی چو نیلبدو رودی از آب پهنا دو میل
درختان رده کرده بر گرد رودتنه لعلگون شاخهاشان کبود
بدان شاخ ها برگ ها سبز و ترنه آهن نه آتش بر او کارگر
وزو هر که کندی به دندان برشنبردی دگر درد دندان سرش
ز بهر شگفتی بزرگان و خردبه نی ز آن فراوان بریدند و برد
از آن پس بر سبزدشتی رسیدهمه کو کنار و گل و سبزه دید
چنان بد بزرگی هر کوکنارکه پر گشتی از گوشه او کنار
دگر دید مرغی به تن خوب رنگبزرگیش هم برنهاد کلنگ
یکی مرغ کوچکتر از فاختههمیشه پسش تاختن ساخته
همه ساله بر طمع پیخال اویبدی مانده در سایه بال اوی
هر آن گه که پیخال بنداختیوی اندر هوا آن خورش ساختی
سپهدار از اندیشه شد خیره سرهمی گفت کاین بخش یزدان نگر
بدین آن دهد کآید آن را بروندرین بخش او راه داند که چون
یکی گفت مرغی چو رنگی تذروهمانجاست در بیشه بید و غرو
نداند ز بن برچدن دانه چیزکه کورست و کور آید از خایه نیز
همه روز نالان و جوشان بودبه یک جای تا شب خروشان بود
دگر مرغکی کوچک آید فرازدهدش آب و چینه به روز دراز
چو از بس چنه پرشود ژاغرشگرد زورمندی تن لاغرش
خروشنده از جای بجهد دژممرین کوچکک را بدرد ز هم
برین بوم و بر هر کس از راستانزند بی وفا را از او داستان
دهی دید جای دگر چون بهشتز پیرامنش باغ و بسیار کشت
برآورد بت خانه ای زو به ماهدرش جزع رنگین سپید و سیاه
زمینش به یکپاره از لاژوردهمه بوم و دیوار مینای زرد
درو شیری از سیم و تختی به زیربتی کرده از زر بر پشت شیر
به دست آینه چون درفشنده مهربدآن آینه درهمی دید چهر
هرآن دردمندی که بودی تباهچو کردی بدآن آینه در نگاه
چو چهرش ندیدی شدی زین سرایورایدون که دیدی شدی باز جای
شب تیره بی آتش تابناکبدی روشن آن خانه چون روز پاک
بت آرای خیلی در آن انجمنکه بودندی از پیش آن بت شمن
جدا هر یکی هدیه ای کرده سازببردند پیش سپهبد فراز
بپرسید از ایشان جهان پهلوانکزینسان دهی وآب هر سو دوان
سرا و دز و کشتش ایدون بسیچرا جز شما نیست ایدر کسی
دژم هر کسی گفت کز راه راستیکی بیشه نزدیک این مرز ماست
ددی در وی از پیل مهتر به تنچو تند اژدها زهر پاش از دهن
تن او یکی هشت پای و دو سرسرش از دو سو پای زیر و زبر
چو شد پای زیرینش از کار و سازبگردد برآن پای کش از فراز
همش چنگ شیرست و هم زور پیلبدرد به آواز کوه از دو میل
شگفتیست جویان خون آمدهز دریای خاور برون آمده
به چنگ از که و بیشه شیر آوردبه دم کرکس از ابر زیر آورد
کمینی نهد هر زمان از نهانبرد هر که یابد ز ما ناگهان
به راهش بویم از نهان دیده دارگریزیم چون او شود آشکار
تهی شد ده از مردم و چارپاینماندست جز ما کس ایدر به جای
همی شد نشاییم زن بوم و رستکه این جای بد زادن ما نخست
برین بام بتخانه دلفروزنشسته بود دیده بانی به روز
که تا چونش بیند زند نعره زودز هامون گریزیم در ده چو دود
سپهدار پذرفت کامروز منرهایی دهمتان از این اهرمن
سپه برد تا نزد بیشه رسیدبر بیشه صف سپه برکشید
چنان تنگ درهم یکی بیشه بودکه رفتن درو کار اندیشه بود
درختانش سر در کشیده به سرچو خط دبیران یک اندر دگر
همه شاخ ها تا به چرخ کبودبه هم برشده تنگ چون تار و پود
تو گفتی سپاهیست در جنگ سختوزو هست گردی دگر هر درخت
کشان شاخ ها نیزه و گرز بارسپر برگ ها و سنان نوک خار
ز بس برگ ریزش گه باد تیزگرفتی جهان هر زمان رستخیز
نتابیدی اندر وی از چرخ هورز تنگی بسودی درو پوست مور
نی اش گفتی از برگ و خار از گرهمگر تیغ این دارد و آن زره
به پهلوی بیشه یکی آب کندبرش خفته دد همچون کوهی بلند
بپوشید خفتان کین پهلوانبرافکند بر پیل برگستوان
به صندوق در رفت با ساز جنگهمی راند تا نزد او رفت تنگ
سوی روشن پاک برداشت دستاز او خواست زور و به زانو نشست
زه آورد بر چرخ پیکار برز دستش گره زد به سوفار بر
یکی فیلکی سود سندان گذاربزد دوخت بر هم ز فرش استوار
دد آن گه سر از جای بر کرد تیزبه پیل اندر آمد به خشم و ستیز
به چنگال بفکند خرطوم اویبه دندان بکندش سر از تن چو گوی
زدش نیزه بر سینه گرد دلیرز صندوق با گرز کین جست زیر
چنان کوفت بر سرش کز زخم سختدر آن بیشه بی برگ و بر شد درخت
همی چند زد بر سرش گرز جنگتن پیل خست او به دندان و چنگ
چنین تا همه ریخت مغز سرشبه زهر و به خون غرقه گشته برش
بمالید رخ پهلوان بر زمینگرفت آفرین بر جهان آفرین
که کردش بر آن زشت پتیاره چیرکه هم اژدها بود و هم پیل و شیر
همان گه بیاکند چرمش به کاهبرافکند بر پیل و برداشت راه
به سوی بیابانی آمد شگفتشتابان بیابان به پی برگرفت
به نزدیکی بادیه روز چندچو شد دید در ره حصاری بلند
هم سنگ دیوار برج و حصارز گردش روان ریگ و جای استوار
بر او نردبانی هم از خاره سنگیکی راهش از پیش دشوار و تنگ
از آهن دری بر سر نردبانبر او مردی از چوب چون دیده بان
بر آیین تیرافکنانش نشستکمانی و تیری گرفته به دست
بر آن پایه نردبان هر که پاینهادی سبک مرد چوبین ز جای
به تیرش فکندی هم اندر زمانشدی تیر او باز سوی کمان
به درع و سپر چند کس رفت تفتهمین بود و شد کشته هر کس که رفت
جهان پهلوان خواست درع نبردخدنگی بینداخت بر چشم مرد
چنان زد که یک نیزه بفراختشز بالا به ریگ اندر انداختش
هم اندر پی آهنگ افراز کردز بر قفل بشکست و در باز کرد
یکی شیر دید از پس در بپایز روی و ز مس کرده جنبان ز جای
به کردار کوره پر آتش دهاندمادم درخش از دهانش جهان
سپهبد ز فرازنگان باز جستطلسمش که چون بود شاید درست
یکی گفت هست آتش تیز تفتدرین سنگ‌ کش‌ زیر چاهست و نفت
ز چشمه همی زاید آن نفت زیروز او گیرد آتش همی کام شیر
همان جنبش مرد و تیر و کمانازین آتش و نفت بد بی گمان
چنان ساخت فرزانه پیش بینکه تا گیتیست این بود هم چنین
به چاره شدند اندر آن جای تنگهمه بوم و دیوار بد خاره سنگ
ز مرمر برافراز بام و حصاریکی قبه جزعین ستونش چهار
دراو تختی از زر و مردی درازبرآن تخت بد مرده از دیرباز
گرفته همه تنش در قیر و مشکگهر برش و از زیر کافور خشک
به طمع آنکه رفتی برش ز آزمونزدی بانگ و بی هش فتادی نگون
چنان کرد فرزانه ز آن مرد یادکز اخنوخ پیغمبرش بد نژاد
کجا نام اخنوخ دانی همیدگر نامش ادریس خوانی همی
دژم پهلوان با دلی پرشگفتتهی رفت از آن جا و ره برگرفت
به ایران سوی شاه با فرهیچو آمد به شاه کیان آگهی 
پذیره شدش منزلی بیش و کمنشست از بر تخت با او به هم
ببوسید و پرسید چیزی که دیدسپهبد همی گفت و شه زو شنید
پس آن چرم پتیاره کآورده بودبیآورد و شاه و سپه را نمود
کهی بد دو سر بر وی و هشت پایکه ده زنده پیلش نبردی ز جای
همه کام دندان پیل و نهنگهمه پنجه چنگال شیر و پلنگ
ازو خیره شد شاه با هر که بودهمی هر کسی پهلوان را ستود
فکندند بر درگه شهریاربر او مردم انبوه شد صد هزار
پس از پهلوان باز پرسید شاهکه چون طنجه کندی و بردی سپاه
چرا کردی آباد بار دگرچنین داد پاسخ یل پرهنر
که هنگام ضحاک گیتی ستاننهادم یکی شهر چون سیستان
نشایستی اکنون که شاهی تراستشدی شهری از بنده با خاک راست
چو پولی است زی آن جهان این جهاندر او عمر ما راه و ما کاروان
چو از بهرم آن کاو شد آباد داشتبه دیگر کس آباد باید گذاشت
پس از گنج طنجه سخن کرد یادهر آنچ از ره آورد شه را بداد
نپذرفت شه زان همه هیچ چیزدگر چیز بخشیدش از گنج نیز
از آن پس یکی مه ز شادی و میبیاسود با وی جهاندار کی
همی خواست کآسوده گردد ز رنجکه تا رفت زی طنجه بد سال پنج
چو شد چهره ادهم شب سپیدبه زربفت روزش بپوشید شید
سر مه رسید از نریمان پگاهدو نامه به نزد سپهدار و شاه
بسی آفرین کرد بر شاه و دادبسی بویه پهلوان کرده یاد
چو برخواند نامه یل نامجویبراند از دو دیده به رخ بر دو جوی
شدش موی کافوری از اشک پرچو بر شفشه سیم خوشاب در
بدانست شه کآرزو راز کرددگر روز کار رهش ساز کرد
ز گنجش بسی گونه گون هدیه دادسوی سیستانش فرستاد شاد
نریمان چو زاین مژده آگاه گشتزد آیین و گنبد همه کوه و دشت
زمین رنگ باغ بهاران گرفتهوا از درم ریز باران گرفت
ز دیبا تو گفتی بر آن شهر بربگسترد همواره سیمرغ پر
دو فرسنگ بد لشکر آراستهغو کوس و نای از جهان خاسته
پیاده ز دو سوش دیوار بستسپر در سپر تیغ و نیزه به دست
برافکنده بر پیل بر خیل خیلچه برگستوان و چه دیبا جلیل
میان اندر آراسته پیل سامبه دیبای چینی و زرین ستام
بر او سام بر کتف کوبال خویشزره از پس و گرز و خفتانش پیش
درفش نریمان ز بالای سرفروهشته از پیل گرز و سپر
نریمان ز پس با همه سرورانتبیره زنان پیش و رامشگران
خزان و بهاریست گفتی به همز دینار باریدن و از درم
چو آمد به تنگی سپهدار شیرسبک سام گرد آمد از پیل زیر
گرفتش به بر پهلوان گزیننریمان فرخنده را همچنین
همه راه بودند با می به دستشدند اندر ایوان به هم شاد و مست
بیاسود هر کس ز شادی و کامز کف پهلوان نیز ننهاد جام
هر آنچ از ره آورد بد نام راسراسر ببخشید مر سام را
سپاس جهانبان بسی یاد کردکه جانش به دیدار او شاد کرد
دل و رای از آن پس برافروختششکار و سواری بیاموختش
بدان گه که سالش ده و چار شدسوار و دلیر و صف آوار شد
به هم برزدی لشکری در نبردربودی به نیزه ز زین کوهه مرد
بدی پیل در صف کین رام اوشدی غرقه غواص در جام او
برفتند گریان و گرشاسب بازدگر باره شد با نریمان به راز
بدو گفت کآمد سر امید منز دیوار در رفت خورشید من
چو مرگ آمد و کار رفتن ببودنه دانش نماید نه پرهیز سود
ره پیری و مرگ را باره نیستبه نزد کس این هر دو را چاره نیست
دلم زین به صد گونه ریش اندرستکه راهی درازم به پیش اندرست
به ره باز خوهی که پیدا و رازنیابد کسی زو گذر بی جواز
یکی شهر نو ساختم چون زرنجبسی گنج گرد آوردیم به رنج
به تو ماندمش چون من آباد داربه فرزندمان همچنین یادگار
پس از من چنان کن که پیش خدایبنازد روانم به دیگر سرای
نگر تا گناهت نباشد بسیبه یزدان ز رنجت ننالد کسی
فرومایه را دار دور از برتمکن آنکه ننگی شود گوهرت
ازآن ترس کاو از تو ترسان بودوگر با تو هزمان دگرسان بود
مکن با سخن چین دوروی رازکه نیکت به زشتی برد پاک باز
به کس بیش از اندازه نیکی مکنکه گردد بداندیش بشنو سخن
چو زاندازه تن را فزایی خورشگرد دردمندی ز بس پرورش
شب و روز بر چار بهره بپاییکی بهره دین را ز بهر خدای
دگر باز تدبیر و فرجام را سیم بزم را چارم آرام را
به فرهنگ پرور چو داری پسرنخستین نویسنده کن از هنر
نویسنده را دست گویا بودگل دانش از دلش بویا بود
به فرمان نادان مکن هیچ کارمشو نیز با پارسا باد سار
مده دل به غم تا نکاهد روانبه شادی همی دار تن را جوان
ببخشای بر زیردستان به مهربرایشان به هر خشم مفروز چهر
که ایشان به تو پاک ماننده اندخداوند را همچو تو بنده اند
چنان زی که از رشک نبوی به دردنه عیب آورد عیب جوینده مرد
بود زشت در مرد جوینده رشکچو دیدار بیماری اندر پزشک
سپیدی به زر اندر آهو بوداگرچند در سیم نیکو بود
به گیتی آور از دل پناهکه آیی به منزل به هنگام راه
چو دستت رسد دوستان را بپایکه تا در غم آرند مهرت بجای
ز دشمن مدار ایمنی جز به دوستکه بر دشمنت چیرگی هم بدوست
به هر کار مر مهتران را دلیرمکن کانگهی بر تو گردند چیر
مگردان از آزادگان فرهیمده ناسزا را بدیشان مهی
به آغالش هرکسی بد مکننشانه مشو پیش تیر سخن
مخند ار کسی را سخن نادرستکه گویایی جان نه در دست تست
کرا چهره زشت ار سرشتش نکوستمکن عیب کآن زشت چهری نه زوست
نکوکار با چهره زشت و تارفراوان به از نیکوی راستکار
گناهی که بخشیده باشی ز بنسخن زان دگر باره تازه مکن
چنان زی خردمند و دانا و رادکه تا بر بدت کس نباشند شاد
کرا نیست در دوستی راستیبیفشان تو از گرد او آستی
مگیر ایچ مزدور را مزد بازپرستندگان را مپیچ از نیاز
مکن بد که چو کردی و کار بودپشیمانی از پس نداردت سود
میاسای از اندیشه گونه گونکه دانش ز اندیشه گردد فزون
به کاری که فرجام او ناپدیدمبر دست کآن رای را کس ندید
به هرجای بخشایش از دل میارنگر تا همی چون کند روزگار
ز یکی ستاند همی هوش و رایزیکی سر از دیگری دست و پای
برآن کوش کت سال تا بیشتربری پایگاه از هنر پیشتر
هنرها به برنایی آور پدیدز بازی بکش سر چو پیری رسید
به تو هرکسی را که بگذاشتمنکودارشان همچو من داشتم
بگرد از جهان راه مهرش مپویاز آن پیشتر کز تو برگردد اوی
چو رخشنده تیغم ز تاری نیامبرآید شود لاله ام زردفام
تن ام را به عنبر بشوی و گلاببیا کن تهی گاهم از مشک ناب
بپوشم به جامه بر آیین جمکفن و آبچین ده به کافور نم
ستوانی از سنگ خارا برآرز بیرون بر او نام من کن نگار
به گردم همه جای مجمر بنهبه آتش دمان عود و عنبر بنه
از آن پس در خوابگه سخت کندل از دیدنم پاک پردخت کن
ز پوشیده رویان ممان کس به کویکه بیگانگانشان نبینند روی
شکیب آور از درد و بر من مشیبکه از مهر بسیار بهتر شکیب
به یک مه بمان سوک تا بد گماننگوید به مرگم بدی شادمان
زکم توشه هرکس که بینی نژنداگر پولی و چشمه کندمند
براین هر یکی ده یک از گنج منهزینه به مردم کن از رنج من
ز زندان درآور کرا نیست خونرها کن خراج دوساله برون
ز بی آبی آن را که ویران ببودنشان مرد و ده ساز و کشت و درود
چنان کن که هر کس که آید ز راهبرد توشه زو رایگان سال و ماه
در اندرزنامه سخن هرچه گفتنبشت و چو جان داشت اندر نهفت
زوی هرچه آمخت از راه دینبیآموخت فرزند را همچنین
از آن پس چو روز دهم بود خواستخورش آرزو کرد و بنشست راست
بخورد اندکی وز خورش بازماندسبک سام را با نریمان بخواند
چنین گفت کز بهر زخمم زمانگشاید کنون مرگ تیر از کمان
بوید از پی جان غمگین منیک امروز هردو به بالین من
مگر کم روان چون هراسان شودبه روی شما مرگم آسان شود
بگفت این و از دیده آب دریغببارید چون ژاله بارد ز میغ
دمش هر زمان گشت کوتاه تردلش زان دگر گیتی آگاه تر
به لب باد سردی برآورد و گفتکه ای پاک دادار بی یار و جفت
جهان را جهاندار و یزدان تویبرآرنده چرخ گردان توی
زمین و زمان کرده تست راستبرآن و براین پادشایی تراست
همه پادشاهان به تو زنده اندتوی پادشه دیگران بنده اند
به تو هم به پیغمبران تو پاکگوایی دهم ترسم از تست و باک
پشیمانم از هرچه کردم گناهببخشای و نزد خودم ده پناه
چو گفت این سخن جان به یزدان سپردگرفتند زاری بزرگان و خرد
از ایوان به کیوان برآمد خروشزبر زآن فغان خاست و ز شهر جوش
بر آن خانه پاک آتش اندر زدندهمه کاخ و گلشن به هم برزدند
دل و جان هرکس چنان غم گرفتکه ماهی به دریاب ماتم گرفت
هوا زاشک مرغان پر از ژاله شدکه از بانگ نخچیر پرناله شد
همان روز بگرفت نیز آفتابنمود ابر از آن پی به باران شتاب
به هر گوشه ای گریه ای خاستهبه هر خانه ای شیون آراسته
زنان رخ زنان بانگ و زاری کنانکنان مویه و موی مشکین کنان
به فندق دو گلنار کرده فکاربه در از دو پیلسته شویان نگار
بزرگان همه در سیاه و کبودز دو دیده ابر از دو رخ کرده رود
سرشک همه لعل و رخسار زردبر از زخم نیلی و لب لاجورد
بریده دم اسپ بیش از هزارنگون کرده زین و آلت کارزار
ز خون پشت صندوق پیلان بنفششکسته تبیره دریده درفش
عقابان و بازان رها کرده پاکبر یوز و پیلان پر از گرد و خاک
در ایوانش بردند بر تخت زربپوشیده خفتان و بسته کمر
یکی گرز بر کتف و تیغ آختهدرفشش فراز سر افراخته
به برگستوان باره پیشش بپایبرو هرکسی گشته زاری فزای
همی گفت سام ای یل سرفرازبرفتی چنان کت نبینیم باز
درفشان مهی بودی از راستیچو گشتی تمام آمدت کاستی
نبود از تو نزدیکتر کس دگرکنون از توام نیست کس دورتر
به تو شادتر من بدم زانجمنکسی نیست غمگین تر اکنون ز من
ببستی در بار چون بر سپاهشدی سوی آن برترین جایگاه
همانا که در خواب خوش رفته ایچه خوابی که تا جاودان خفته ای
نریمان همی گفت زار ای دلیرکجات آن دل و زور و بازوی چیر
کجات آن سواری وصف ساختنکجات آن به هر کشوری تاختن
جهان گشتی و رنج برداشتیچو گنجت بینباشت بگذاشتی
همه کشورت کز تو آباد شدبه باد پسین دست با باد شد
کهان سوی فرمانت دارند چشمچبودت که با ما به جنگی و خشم
نه در بزم دینار باری همینه در رزم خنجر گزاری همی
نمودی به هر کشور آیین خویشکشیدی ز هر دشمنی کین خویش
کنون باز رزم از چه آراستیکه اسپ و سلیح و کمر خواستی
به هند ار به چین برد خواهی سپاهکه بر مه کشیدی درفش سیاه
بدی از دل و دست دریا و میغیکی مشت خاکی کنون ای دریغ
دریغا تهی از تو زابلستاندریغا جهان بی تو کشور ستان
دریغا که بدخواه دلشاد گشتدریغا که رنجت همه باد گشت
همی گرید ابر از دریغت به مهرسلب هم به سوکت سی کرد چهر
کس از مرگ نرسد به مردی و فرکجا تو نرستی به چندین هنر
چو شیون از اندازه بگذاشتندپس آنگاهش از تخت برداشتند
به مشک و گلابش بشستند پاکسپردندش اندر ستودان به خاک
ببسند از آن پس برش راه بارنبد پهلوان گفتی از بیخ و بار
چنینست گیتی ز نزدیک و دورگهی سوگ و ماتم گهی بزم و سور
به کردار دریاست کز وی به چنگیکی در دارد یکی ریگ و سنگ
سرانجام از او ایمنی نیست رویکه هر کش پرستد بمیرد در اوی
چو پایی تو ای پیر مانده شگفتکه بارت شد و کاروان برگرفت
به پیری چرا گشت آز تو بیشجوانان نگر چند رفتند پیش
ترا آنکه شد گوش دارد همیوزاو دل ترا یاد نارد همی
چو همراه شد توشه ساز و مییستکه دورست ره وز شدن چاره نیست
درین ره مدان توشه و بار نیکبه از دانش نیک و کردار نیک
از این گیتی ار پاک و دانا شویبه هر گامی آنجا توانا شوی
که نادان بد آنجای خوارست و زشتشه آنجاست درویش نیکو سرشت
به دانایی این ره به جایی بریبه بی دانشی هیچ ره نسپری
چو نزد فریدون ز سوگ و ز غمرسید آگهی گشت از انده دژم
همه جامه زد چاک و بنداخت تاجغریوان به خاک آمد از تخت عاج
همی گفت گردا گوا سروراهژبرا جهانگیر نام آورا
که گیرد کنون گرز و شمشیر توچو بی کار شد بازوی چیر تو
به هر کشور از بهر من کارزارکه جوید چو شد مر ترا کارزار
درختی بدی سال و مه بارورخرد بیخ و دین برگ و بارش هنر
درخت از زمین سرکشد برفرازتو زیر زمین چون شدی پست باز
چو گنجی بدی از هنر در جهاننهان گشتی و گنج باشد نهان
جهان از پس تو مماناد دیرشدم سیر ازاو کز تو او گشت سیر
روان تو زندست گر تن بمردندارد خردمند مرگ تو خرد
بدین سوک و غم در کبود و سیاهببد هفته ای با سران سپاه
به نزد نریمان چو یک هفته بودیکی سوکنامه فرستاد زود
سر نامه نام جهاندار گفتکه با جان دانا خرد ساخت جفت
تن زندگان را زمین جای کردز بر بیستون چرخ بر پای کرد
دهد جان و پس بازخواهد چو دادبد و نیک هرچ او کند هست داد
دگر گفت ازآن روز انده فزایرسید آگهی کند دل ها ز جای
به مرگ سپهبد جهان پهلوانکه یزدانش داراد روشن روان
ازین درد گردون به تاب اندرستستاره ز گریه به آب اندرست
گیا پشت از اندوه دارد به خمدل خاره پرجوش و خونست و غم
همان طبع گیتی بگشت ای شگفتجدا هریکی ساز دیگر گرفت
شد آتش به هر دل درون تف و تابسرشک خروشان روان خون ناب
زمین سر به سر سوک آن مرد شدهوا بر جگرها دم سرد شد
بدان ای سپهدار خسروپرستکه غم مر مرا از تو افزونترست
ولیکن چو خرسند نبوم چه سودکه با مرگ چاره نخواهدت بود
جهان چون یکی هفت سر اژدهاستکسی نیست کز چنگ و نابش رهاست
دهانش آتشست و شب و روز دمهوا سینه دم آب و هامون شکم
براو هفت سر هفت چرخ از فرازستاره همه چشمش از دور باز
سراسر شکم هستش انباشتهز بس گونه گون هرکس اوباشته
چه فرزانگان و چه مردان گردچه خوبان چه شاهان با دستبرد
چو شاهیست گردون ز ما کینه خواهشب و روز گردش ستاره سپاه
نبینی که بر جنگ ما ساختنهمی هیچ ناساید از تاختن
به یک گردش از زیر و بر چرخ وارکند کارها زیروبر صدهزار
جهان بزمگاهیست نغز از نشانمی اش عمر ما پاک و ما می کشان
جوانیش خوشی و مستیش نازغمش روز پیرست کآید فراز
ازین مستی آن کس که شد خفته پستنه هش یافت هرگز نه از خواب جست
اگر چند بسیار مانی بجایهم آخر سرآید سپنجی سرای
نه آن ماند خواهد که بازور و گنجنه آن کس که درویش با درد و رنج
بهشتی بدی گیتی از رنگ و بویاگر مرگ و پیری نبودی در اوی
کهن کارگاهیست برساختهکزاو کس نشد کار پرداخته
تن ما چو میوه ست و او میوه داربچینند یک روز میوه ز دار
شب و روز همواره با ما به راهدو پیک اند پویان سپید و سیاه
ولیکن ز پس ما بمانیم زودشوند این دو از پیش چون باد و دود
یکی جامه زندگانیست تنکه جان داردش پوشش خویشتن
بفرساید آخرش چرخ بلندچو فرسود جامه بباید فکند
ز ما تا ره مرگ یک دم رهستاگر دم درازست اگر کوتهست
چو پولیست این مرگ کانجام کاربرین پول دارند یکسر گذار
بمیرد هرآنکس که زاید درستشود نیست چونان که بود از نخست
نیابی کسی کش کسی مرده نیستدلی نیست کز گیتی آزرده نیست
کجا شد کیومرث شاه بلندکجا جم و طهمورث دیوبند
جهانشان به خاک اندر افکند پاکبرآورد پس گنجهاشان ز خاک
ازیشان نماندست جز نام چیزبرفتند و ما رفت خواهیم نیز
اگر مرگ بر ما نکردی کمینز بس جانور تنگ بودی زمین
تمامی مردم به مرگ اندرستکجا با فرشته چو شد هم پرست
اگر پهلوان رفت نامش بماندجهانبان بخواند ار جهانش براند
سپهر آب خود برد و او را نبرددلیری و فرهنگ مرد او نمرد
دهاد آفریننده خوب و زشتترا مزد نیکان مرورا بهشت
گر او شد کنون ماند گاهش تراسپردیم ما بارگاهش ترا
ز دل مهر او بر تو انگیختیمغمش را به شادی برآمیختیم
که تو یادگاری از آن پهلوانهمیشه بزی شاد و روشن روان
چو مه نو شود جامه نو ساز کنببر از غم و شادی آغاز کن
می و یوز خلعت ز بالای خویشفرستادم اینک به آیین به پیش
بدین تن بپوش و بد آن غم گسار بدین جوی بزم و بد آن کن شکار
چنان کن که در مهرگان نام رابیاری به نزدیک ما سام را
که تا دل به فرزند تو خوش کنیمبسوزیم غم را چو آتش کنیم
نگه کن مرا این نامه را وزفرود همینست گفتار و بر تو درود
فرسته شد و نامه و هدیه بردبپوشید خلعت نریمان گرد
به شادی فرستاده برگشت بازگه مهرگان راه را کرد ساز
سوی شاه با سام یل داد رویچو آگاه شد زو کی نامجوی
پذیره فرستاد یکسر سپاهپیاده شدش پیش از بارگاه
نشاندش بر اورنگ و پرسید چندبه خرسندی اش داد هرگونه پند
بدآن روز جشن گزین مهرگانگه بزم و رود پری چهرگان
بفرمود تا خوان نهادند کیپس از خوان نشستند در بزم می
بر اورنگ بد پهلوان پیش شاهسوی راستش سام بد نزدگاه
یکی ده منی جام زر پر نبیدندانستی آنرا به جز شه کشید
به یاد نریمان شه آن نوش کردنریمان همیدون به یادش بخورد
همان جام را سام گردن فرازبه یک دم به از هر دو انداخت باز
در او خیره شد شاه و گفت این سترگبود به ز گرشاسب چون شد بزرگ
بلند آتش مهرگانی بساختکه تفش ز چرخ اختران را بتاخت
درفشان درفشی برآمد به ماهز زر ذرها چرخ مشک سیاه
به هامون درش ذره سونش فشانبه گردش جهان چرخ اختر فشان 
زمین شد یکی پرفروغ آفتابز زر رشتها چرخش از مشک ناب
چو کرده برن خنجر زردفامهزاران هزار از عقیقی نیام
چو در زرد حله کنیزان مستبه بازیگری دست داده به دست
همه پای کوبنده بر فرش چینز سر مشک پاشان گل از آستین
چو رزمی گران زنگیان ساختههمه غرقه در خون و تیغ آخته
چو لرزان کهی یکسر از زر خشکبر او بسدین قطره ابری ز مشک
بزرگان به بزم آرام کزمنشستند با می گساران به بزم
سر چنگ سازنده جنگ شددم نای هم ناله زنگ شد
به کف جام می چشمه نوش گشتهوا پر نوای خلالوش گشت
ز بس رامش و خوشی مهترانگرفتند در چرخ بزم اختران
ز شادی همی کوفت مریخ دستبه دستان شده زهره می پرست
چنین بد مهی شاد شاه بلندنه بر گنج مهر و نه بر بدره بند
سر مه چو آمد نریمانش پیشبسی هدیه بخشیدش از گنج خویش
درفشیش داد اژدهافش سیاهجهان پهلوان خواندش اندر سپاه
دگر شیر پیکر درفشی به سامبداد و سپهبدش فرمود نام
چنین آمد این گیتی از فر و سازبدارد به ناز آورد مرگ باز
چو ماری که زرین دهد خایه بهرپس از ناگهان باز بکشد به زهر
درختیست با شاخ بسیار باربرش تازه گل یکسر و تیزخار
نخستین به گل شادخوارت کندپس آنگاه از خار خوارت کند
نه در وی کسی زیست کآخر نمردنه زاو شد کسی تا دریغی نبرد
ز دوران مگر مانده بیچاره ایمگرفتار این زال پتیاره ایم
